Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1ca (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x3044): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xb57): ../Core/Src/CAN/can_bus.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x18c7): /home/saveasmtz/Documents/embedded/stepper_boards_firmware/Debug
    <19>   DW_AT_stmt_list   : 0x0
    <1d>   DW_AT_GNU_macros  : 0x0
 <1><21>: Abbrev Number: 2 (DW_TAG_typedef)
    <22>   DW_AT_name        : (indirect string, offset: 0x24ef): __int8_t
    <26>   DW_AT_decl_file   : 1
    <27>   DW_AT_decl_line   : 41
    <28>   DW_AT_decl_column : 23
    <29>   DW_AT_type        : <0x2d>
 <1><2d>: Abbrev Number: 3 (DW_TAG_base_type)
    <2e>   DW_AT_byte_size   : 1
    <2f>   DW_AT_encoding    : 6	(signed char)
    <30>   DW_AT_name        : (indirect string, offset: 0x29e5): signed char
 <1><34>: Abbrev Number: 2 (DW_TAG_typedef)
    <35>   DW_AT_name        : (indirect string, offset: 0x2c64): __uint8_t
    <39>   DW_AT_decl_file   : 1
    <3a>   DW_AT_decl_line   : 43
    <3b>   DW_AT_decl_column : 24
    <3c>   DW_AT_type        : <0x40>
 <1><40>: Abbrev Number: 3 (DW_TAG_base_type)
    <41>   DW_AT_byte_size   : 1
    <42>   DW_AT_encoding    : 8	(unsigned char)
    <43>   DW_AT_name        : (indirect string, offset: 0x2bdf): unsigned char
 <1><47>: Abbrev Number: 3 (DW_TAG_base_type)
    <48>   DW_AT_byte_size   : 2
    <49>   DW_AT_encoding    : 5	(signed)
    <4a>   DW_AT_name        : (indirect string, offset: 0x74b): short int
 <1><4e>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f>   DW_AT_name        : (indirect string, offset: 0x112a): __uint16_t
    <53>   DW_AT_decl_file   : 1
    <54>   DW_AT_decl_line   : 57
    <55>   DW_AT_decl_column : 25
    <56>   DW_AT_type        : <0x5a>
 <1><5a>: Abbrev Number: 3 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 2
    <5c>   DW_AT_encoding    : 7	(unsigned)
    <5d>   DW_AT_name        : (indirect string, offset: 0x5ec): short unsigned int
 <1><61>: Abbrev Number: 3 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : (indirect string, offset: 0x2868): long int
 <1><68>: Abbrev Number: 2 (DW_TAG_typedef)
    <69>   DW_AT_name        : (indirect string, offset: 0x3251): __uint32_t
    <6d>   DW_AT_decl_file   : 1
    <6e>   DW_AT_decl_line   : 79
    <6f>   DW_AT_decl_column : 25
    <70>   DW_AT_type        : <0x74>
 <1><74>: Abbrev Number: 3 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 4
    <76>   DW_AT_encoding    : 7	(unsigned)
    <77>   DW_AT_name        : (indirect string, offset: 0x2598): long unsigned int
 <1><7b>: Abbrev Number: 3 (DW_TAG_base_type)
    <7c>   DW_AT_byte_size   : 8
    <7d>   DW_AT_encoding    : 5	(signed)
    <7e>   DW_AT_name        : (indirect string, offset: 0x177d): long long int
 <1><82>: Abbrev Number: 3 (DW_TAG_base_type)
    <83>   DW_AT_byte_size   : 8
    <84>   DW_AT_encoding    : 7	(unsigned)
    <85>   DW_AT_name        : (indirect string, offset: 0x36c6): long long unsigned int
 <1><89>: Abbrev Number: 4 (DW_TAG_base_type)
    <8a>   DW_AT_byte_size   : 4
    <8b>   DW_AT_encoding    : 5	(signed)
    <8c>   DW_AT_name        : int
 <1><90>: Abbrev Number: 3 (DW_TAG_base_type)
    <91>   DW_AT_byte_size   : 4
    <92>   DW_AT_encoding    : 7	(unsigned)
    <93>   DW_AT_name        : (indirect string, offset: 0x3390): unsigned int
 <1><97>: Abbrev Number: 2 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indirect string, offset: 0x24f1): int8_t
    <9c>   DW_AT_decl_file   : 2
    <9d>   DW_AT_decl_line   : 20
    <9e>   DW_AT_decl_column : 18
    <9f>   DW_AT_type        : <0x21>
 <1><a3>: Abbrev Number: 2 (DW_TAG_typedef)
    <a4>   DW_AT_name        : (indirect string, offset: 0x2c66): uint8_t
    <a8>   DW_AT_decl_file   : 2
    <a9>   DW_AT_decl_line   : 24
    <aa>   DW_AT_decl_column : 19
    <ab>   DW_AT_type        : <0x34>
 <1><af>: Abbrev Number: 2 (DW_TAG_typedef)
    <b0>   DW_AT_name        : (indirect string, offset: 0xa577a): uint16_t
    <b4>   DW_AT_decl_file   : 2
    <b5>   DW_AT_decl_line   : 36
    <b6>   DW_AT_decl_column : 20
    <b7>   DW_AT_type        : <0x4e>
 <1><bb>: Abbrev Number: 2 (DW_TAG_typedef)
    <bc>   DW_AT_name        : (indirect string, offset: 0xa367c): uint32_t
    <c0>   DW_AT_decl_file   : 2
    <c1>   DW_AT_decl_line   : 48
    <c2>   DW_AT_decl_column : 20
    <c3>   DW_AT_type        : <0x68>
 <1><c7>: Abbrev Number: 5 (DW_TAG_structure_type)
    <c8>   DW_AT_byte_size   : 20
    <c9>   DW_AT_decl_file   : 3
    <ca>   DW_AT_decl_line   : 43
    <cb>   DW_AT_decl_column : 9
    <cc>   DW_AT_sibling     : <0x11f>
 <2><d0>: Abbrev Number: 6 (DW_TAG_member)
    <d1>   DW_AT_name        : (indirect string, offset: 0x11e2): motor_1_steps
    <d5>   DW_AT_decl_file   : 3
    <d6>   DW_AT_decl_line   : 44
    <d7>   DW_AT_decl_column : 11
    <d8>   DW_AT_type        : <0xaf>
    <dc>   DW_AT_data_member_location: 0
 <2><dd>: Abbrev Number: 6 (DW_TAG_member)
    <de>   DW_AT_name        : (indirect string, offset: 0x1480): motor_2_steps
    <e2>   DW_AT_decl_file   : 3
    <e3>   DW_AT_decl_line   : 45
    <e4>   DW_AT_decl_column : 11
    <e5>   DW_AT_type        : <0xaf>
    <e9>   DW_AT_data_member_location: 2
 <2><ea>: Abbrev Number: 6 (DW_TAG_member)
    <eb>   DW_AT_name        : (indirect string, offset: 0x1a65): motor_1_direction
    <ef>   DW_AT_decl_file   : 3
    <f0>   DW_AT_decl_line   : 46
    <f1>   DW_AT_decl_column : 9
    <f2>   DW_AT_type        : <0x97>
    <f6>   DW_AT_data_member_location: 4
 <2><f7>: Abbrev Number: 6 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x1264): motor_2_direction
    <fc>   DW_AT_decl_file   : 3
    <fd>   DW_AT_decl_line   : 47
    <fe>   DW_AT_decl_column : 9
    <ff>   DW_AT_type        : <0x97>
    <103>   DW_AT_data_member_location: 5
 <2><104>: Abbrev Number: 6 (DW_TAG_member)
    <105>   DW_AT_name        : (indirect string, offset: 0x198c): encoderAngle
    <109>   DW_AT_decl_file   : 3
    <10a>   DW_AT_decl_line   : 48
    <10b>   DW_AT_decl_column : 8
    <10c>   DW_AT_type        : <0x11f>
    <110>   DW_AT_data_member_location: 8
 <2><111>: Abbrev Number: 6 (DW_TAG_member)
    <112>   DW_AT_name        : (indirect string, offset: 0x17a1): jetsonHBTick
    <116>   DW_AT_decl_file   : 3
    <117>   DW_AT_decl_line   : 49
    <118>   DW_AT_decl_column : 11
    <119>   DW_AT_type        : <0xbb>
    <11d>   DW_AT_data_member_location: 16
 <2><11e>: Abbrev Number: 0
 <1><11f>: Abbrev Number: 7 (DW_TAG_array_type)
    <120>   DW_AT_type        : <0x12f>
    <124>   DW_AT_sibling     : <0x12f>
 <2><128>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <129>   DW_AT_type        : <0x90>
    <12d>   DW_AT_upper_bound : 1
 <2><12e>: Abbrev Number: 0
 <1><12f>: Abbrev Number: 3 (DW_TAG_base_type)
    <130>   DW_AT_byte_size   : 4
    <131>   DW_AT_encoding    : 4	(float)
    <132>   DW_AT_name        : (indirect string, offset: 0x74cf): float
 <1><136>: Abbrev Number: 2 (DW_TAG_typedef)
    <137>   DW_AT_name        : (indirect string, offset: 0x16fc): can_rx
    <13b>   DW_AT_decl_file   : 3
    <13c>   DW_AT_decl_line   : 50
    <13d>   DW_AT_decl_column : 3
    <13e>   DW_AT_type        : <0xc7>
 <1><142>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <143>   DW_AT_type        : <0x136>
 <1><147>: Abbrev Number: 5 (DW_TAG_structure_type)
    <148>   DW_AT_byte_size   : 40
    <149>   DW_AT_decl_file   : 3
    <14a>   DW_AT_decl_line   : 52
    <14b>   DW_AT_decl_column : 9
    <14c>   DW_AT_sibling     : <0x178>
 <2><150>: Abbrev Number: 6 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x2419): heartbeat
    <155>   DW_AT_decl_file   : 3
    <156>   DW_AT_decl_line   : 53
    <157>   DW_AT_decl_column : 11
    <158>   DW_AT_type        : <0xbb>
    <15c>   DW_AT_data_member_location: 0
 <2><15d>: Abbrev Number: 6 (DW_TAG_member)
    <15e>   DW_AT_name        : (indirect string, offset: 0x29b5): sbusData
    <162>   DW_AT_decl_file   : 3
    <163>   DW_AT_decl_line   : 54
    <164>   DW_AT_decl_column : 11
    <165>   DW_AT_type        : <0x178>
    <169>   DW_AT_data_member_location: 4
 <2><16a>: Abbrev Number: 6 (DW_TAG_member)
    <16b>   DW_AT_name        : (indirect string, offset: 0x1471): sbusIsFailsafe
    <16f>   DW_AT_decl_file   : 3
    <170>   DW_AT_decl_line   : 55
    <171>   DW_AT_decl_column : 10
    <172>   DW_AT_type        : <0xa3>
    <176>   DW_AT_data_member_location: 36
 <2><177>: Abbrev Number: 0
 <1><178>: Abbrev Number: 7 (DW_TAG_array_type)
    <179>   DW_AT_type        : <0xaf>
    <17d>   DW_AT_sibling     : <0x188>
 <2><181>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <182>   DW_AT_type        : <0x90>
    <186>   DW_AT_upper_bound : 15
 <2><187>: Abbrev Number: 0
 <1><188>: Abbrev Number: 2 (DW_TAG_typedef)
    <189>   DW_AT_name        : (indirect string, offset: 0x1ec4): can_tx
    <18d>   DW_AT_decl_file   : 3
    <18e>   DW_AT_decl_line   : 56
    <18f>   DW_AT_decl_column : 3
    <190>   DW_AT_type        : <0x147>
 <1><194>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <195>   DW_AT_type        : <0x188>
 <1><199>: Abbrev Number: 10 (DW_TAG_variable)
    <19a>   DW_AT_name        : (indirect string, offset: 0x28e9): can_rx_data
    <19e>   DW_AT_decl_file   : 3
    <19f>   DW_AT_decl_line   : 58
    <1a0>   DW_AT_decl_column : 24
    <1a1>   DW_AT_type        : <0x142>
    <1a5>   DW_AT_external    : 1
    <1a5>   DW_AT_declaration : 1
 <1><1a5>: Abbrev Number: 10 (DW_TAG_variable)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x3148): can_tx_data
    <1aa>   DW_AT_decl_file   : 3
    <1ab>   DW_AT_decl_line   : 59
    <1ac>   DW_AT_decl_column : 24
    <1ad>   DW_AT_type        : <0x194>
    <1b1>   DW_AT_external    : 1
    <1b1>   DW_AT_declaration : 1
 <1><1b1>: Abbrev Number: 11 (DW_TAG_variable)
    <1b2>   DW_AT_specification: <0x199>
    <1b6>   DW_AT_decl_file   : 4
    <1b7>   DW_AT_decl_line   : 14
    <1b8>   DW_AT_decl_column : 17
    <1b9>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><1bf>: Abbrev Number: 11 (DW_TAG_variable)
    <1c0>   DW_AT_specification: <0x1a5>
    <1c4>   DW_AT_decl_file   : 4
    <1c5>   DW_AT_decl_line   : 15
    <1c6>   DW_AT_decl_column : 17
    <1c7>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1cd>: Abbrev Number: 0
  Compilation Unit @ offset 0x1ce:
   Length:        0x3dd (32-bit)
   Version:       4
   Abbrev Offset: 0x93
   Pointer Size:  4
 <0><1d9>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <1da>   DW_AT_producer    : (indirect string, offset: 0x3044): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <1de>   DW_AT_language    : 12	(ANSI C99)
    <1df>   DW_AT_name        : (indirect string, offset: 0x4c536): ../Core/Src/CAN/can_bus_parser.c
    <1e3>   DW_AT_comp_dir    : (indirect string, offset: 0x18c7): /home/saveasmtz/Documents/embedded/stepper_boards_firmware/Debug
    <1e7>   DW_AT_ranges      : 0x0
    <1eb>   DW_AT_low_pc      : 0x0
    <1ef>   DW_AT_stmt_list   : 0x36f
    <1f3>   DW_AT_GNU_macros  : 0xf7d
 <1><1f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x24ef): __int8_t
    <1fc>   DW_AT_decl_file   : 2
    <1fd>   DW_AT_decl_line   : 41
    <1fe>   DW_AT_decl_column : 23
    <1ff>   DW_AT_type        : <0x203>
 <1><203>: Abbrev Number: 3 (DW_TAG_base_type)
    <204>   DW_AT_byte_size   : 1
    <205>   DW_AT_encoding    : 6	(signed char)
    <206>   DW_AT_name        : (indirect string, offset: 0x29e5): signed char
 <1><20a>: Abbrev Number: 2 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0x2c64): __uint8_t
    <20f>   DW_AT_decl_file   : 2
    <210>   DW_AT_decl_line   : 43
    <211>   DW_AT_decl_column : 24
    <212>   DW_AT_type        : <0x216>
 <1><216>: Abbrev Number: 3 (DW_TAG_base_type)
    <217>   DW_AT_byte_size   : 1
    <218>   DW_AT_encoding    : 8	(unsigned char)
    <219>   DW_AT_name        : (indirect string, offset: 0x2bdf): unsigned char
 <1><21d>: Abbrev Number: 3 (DW_TAG_base_type)
    <21e>   DW_AT_byte_size   : 2
    <21f>   DW_AT_encoding    : 5	(signed)
    <220>   DW_AT_name        : (indirect string, offset: 0x74b): short int
 <1><224>: Abbrev Number: 2 (DW_TAG_typedef)
    <225>   DW_AT_name        : (indirect string, offset: 0x112a): __uint16_t
    <229>   DW_AT_decl_file   : 2
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 25
    <22c>   DW_AT_type        : <0x230>
 <1><230>: Abbrev Number: 3 (DW_TAG_base_type)
    <231>   DW_AT_byte_size   : 2
    <232>   DW_AT_encoding    : 7	(unsigned)
    <233>   DW_AT_name        : (indirect string, offset: 0x5ec): short unsigned int
 <1><237>: Abbrev Number: 3 (DW_TAG_base_type)
    <238>   DW_AT_byte_size   : 4
    <239>   DW_AT_encoding    : 5	(signed)
    <23a>   DW_AT_name        : (indirect string, offset: 0x2868): long int
 <1><23e>: Abbrev Number: 2 (DW_TAG_typedef)
    <23f>   DW_AT_name        : (indirect string, offset: 0x3251): __uint32_t
    <243>   DW_AT_decl_file   : 2
    <244>   DW_AT_decl_line   : 79
    <245>   DW_AT_decl_column : 25
    <246>   DW_AT_type        : <0x24a>
 <1><24a>: Abbrev Number: 3 (DW_TAG_base_type)
    <24b>   DW_AT_byte_size   : 4
    <24c>   DW_AT_encoding    : 7	(unsigned)
    <24d>   DW_AT_name        : (indirect string, offset: 0x2598): long unsigned int
 <1><251>: Abbrev Number: 3 (DW_TAG_base_type)
    <252>   DW_AT_byte_size   : 8
    <253>   DW_AT_encoding    : 5	(signed)
    <254>   DW_AT_name        : (indirect string, offset: 0x177d): long long int
 <1><258>: Abbrev Number: 3 (DW_TAG_base_type)
    <259>   DW_AT_byte_size   : 8
    <25a>   DW_AT_encoding    : 7	(unsigned)
    <25b>   DW_AT_name        : (indirect string, offset: 0x36c6): long long unsigned int
 <1><25f>: Abbrev Number: 4 (DW_TAG_base_type)
    <260>   DW_AT_byte_size   : 4
    <261>   DW_AT_encoding    : 5	(signed)
    <262>   DW_AT_name        : int
 <1><266>: Abbrev Number: 3 (DW_TAG_base_type)
    <267>   DW_AT_byte_size   : 4
    <268>   DW_AT_encoding    : 7	(unsigned)
    <269>   DW_AT_name        : (indirect string, offset: 0x3390): unsigned int
 <1><26d>: Abbrev Number: 2 (DW_TAG_typedef)
    <26e>   DW_AT_name        : (indirect string, offset: 0x24f1): int8_t
    <272>   DW_AT_decl_file   : 3
    <273>   DW_AT_decl_line   : 20
    <274>   DW_AT_decl_column : 18
    <275>   DW_AT_type        : <0x1f7>
 <1><279>: Abbrev Number: 2 (DW_TAG_typedef)
    <27a>   DW_AT_name        : (indirect string, offset: 0x2c66): uint8_t
    <27e>   DW_AT_decl_file   : 3
    <27f>   DW_AT_decl_line   : 24
    <280>   DW_AT_decl_column : 19
    <281>   DW_AT_type        : <0x20a>
 <1><285>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <286>   DW_AT_type        : <0x279>
 <1><28a>: Abbrev Number: 6 (DW_TAG_const_type)
    <28b>   DW_AT_type        : <0x279>
 <1><28f>: Abbrev Number: 2 (DW_TAG_typedef)
    <290>   DW_AT_name        : (indirect string, offset: 0xa577a): uint16_t
    <294>   DW_AT_decl_file   : 3
    <295>   DW_AT_decl_line   : 36
    <296>   DW_AT_decl_column : 20
    <297>   DW_AT_type        : <0x224>
 <1><29b>: Abbrev Number: 2 (DW_TAG_typedef)
    <29c>   DW_AT_name        : (indirect string, offset: 0xa367c): uint32_t
    <2a0>   DW_AT_decl_file   : 3
    <2a1>   DW_AT_decl_line   : 48
    <2a2>   DW_AT_decl_column : 20
    <2a3>   DW_AT_type        : <0x23e>
 <1><2a7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <2a8>   DW_AT_byte_size   : 20
    <2a9>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 43
    <2ab>   DW_AT_decl_column : 9
    <2ac>   DW_AT_sibling     : <0x2ff>
 <2><2b0>: Abbrev Number: 8 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x11e2): motor_1_steps
    <2b5>   DW_AT_decl_file   : 4
    <2b6>   DW_AT_decl_line   : 44
    <2b7>   DW_AT_decl_column : 11
    <2b8>   DW_AT_type        : <0x28f>
    <2bc>   DW_AT_data_member_location: 0
 <2><2bd>: Abbrev Number: 8 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0x1480): motor_2_steps
    <2c2>   DW_AT_decl_file   : 4
    <2c3>   DW_AT_decl_line   : 45
    <2c4>   DW_AT_decl_column : 11
    <2c5>   DW_AT_type        : <0x28f>
    <2c9>   DW_AT_data_member_location: 2
 <2><2ca>: Abbrev Number: 8 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x1a65): motor_1_direction
    <2cf>   DW_AT_decl_file   : 4
    <2d0>   DW_AT_decl_line   : 46
    <2d1>   DW_AT_decl_column : 9
    <2d2>   DW_AT_type        : <0x26d>
    <2d6>   DW_AT_data_member_location: 4
 <2><2d7>: Abbrev Number: 8 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x1264): motor_2_direction
    <2dc>   DW_AT_decl_file   : 4
    <2dd>   DW_AT_decl_line   : 47
    <2de>   DW_AT_decl_column : 9
    <2df>   DW_AT_type        : <0x26d>
    <2e3>   DW_AT_data_member_location: 5
 <2><2e4>: Abbrev Number: 8 (DW_TAG_member)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x198c): encoderAngle
    <2e9>   DW_AT_decl_file   : 4
    <2ea>   DW_AT_decl_line   : 48
    <2eb>   DW_AT_decl_column : 8
    <2ec>   DW_AT_type        : <0x2ff>
    <2f0>   DW_AT_data_member_location: 8
 <2><2f1>: Abbrev Number: 8 (DW_TAG_member)
    <2f2>   DW_AT_name        : (indirect string, offset: 0x17a1): jetsonHBTick
    <2f6>   DW_AT_decl_file   : 4
    <2f7>   DW_AT_decl_line   : 49
    <2f8>   DW_AT_decl_column : 11
    <2f9>   DW_AT_type        : <0x29b>
    <2fd>   DW_AT_data_member_location: 16
 <2><2fe>: Abbrev Number: 0
 <1><2ff>: Abbrev Number: 9 (DW_TAG_array_type)
    <300>   DW_AT_type        : <0x30f>
    <304>   DW_AT_sibling     : <0x30f>
 <2><308>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <309>   DW_AT_type        : <0x266>
    <30d>   DW_AT_upper_bound : 1
 <2><30e>: Abbrev Number: 0
 <1><30f>: Abbrev Number: 3 (DW_TAG_base_type)
    <310>   DW_AT_byte_size   : 4
    <311>   DW_AT_encoding    : 4	(float)
    <312>   DW_AT_name        : (indirect string, offset: 0x74cf): float
 <1><316>: Abbrev Number: 2 (DW_TAG_typedef)
    <317>   DW_AT_name        : (indirect string, offset: 0x16fc): can_rx
    <31b>   DW_AT_decl_file   : 4
    <31c>   DW_AT_decl_line   : 50
    <31d>   DW_AT_decl_column : 3
    <31e>   DW_AT_type        : <0x2a7>
 <1><322>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <323>   DW_AT_type        : <0x316>
 <1><327>: Abbrev Number: 11 (DW_TAG_variable)
    <328>   DW_AT_name        : (indirect string, offset: 0x28e9): can_rx_data
    <32c>   DW_AT_decl_file   : 4
    <32d>   DW_AT_decl_line   : 58
    <32e>   DW_AT_decl_column : 24
    <32f>   DW_AT_type        : <0x322>
    <333>   DW_AT_external    : 1
    <333>   DW_AT_declaration : 1
 <1><333>: Abbrev Number: 3 (DW_TAG_base_type)
    <334>   DW_AT_byte_size   : 8
    <335>   DW_AT_encoding    : 4	(float)
    <336>   DW_AT_name        : (indirect string, offset: 0x17f4f): long double
 <1><33a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <33b>   DW_AT_byte_size   : 28
    <33c>   DW_AT_decl_file   : 5
    <33d>   DW_AT_decl_line   : 183
    <33e>   DW_AT_decl_column : 9
    <33f>   DW_AT_sibling     : <0x39f>
 <2><343>: Abbrev Number: 8 (DW_TAG_member)
    <344>   DW_AT_name        : (indirect string, offset: 0x23943): StdId
    <348>   DW_AT_decl_file   : 5
    <349>   DW_AT_decl_line   : 185
    <34a>   DW_AT_decl_column : 12
    <34b>   DW_AT_type        : <0x29b>
    <34f>   DW_AT_data_member_location: 0
 <2><350>: Abbrev Number: 8 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x81706): ExtId
    <355>   DW_AT_decl_file   : 5
    <356>   DW_AT_decl_line   : 188
    <357>   DW_AT_decl_column : 12
    <358>   DW_AT_type        : <0x29b>
    <35c>   DW_AT_data_member_location: 4
 <2><35d>: Abbrev Number: 12 (DW_TAG_member)
    <35e>   DW_AT_name        : IDE
    <362>   DW_AT_decl_file   : 5
    <363>   DW_AT_decl_line   : 191
    <364>   DW_AT_decl_column : 12
    <365>   DW_AT_type        : <0x29b>
    <369>   DW_AT_data_member_location: 8
 <2><36a>: Abbrev Number: 12 (DW_TAG_member)
    <36b>   DW_AT_name        : RTR
    <36f>   DW_AT_decl_file   : 5
    <370>   DW_AT_decl_line   : 194
    <371>   DW_AT_decl_column : 12
    <372>   DW_AT_type        : <0x29b>
    <376>   DW_AT_data_member_location: 12
 <2><377>: Abbrev Number: 12 (DW_TAG_member)
    <378>   DW_AT_name        : DLC
    <37c>   DW_AT_decl_file   : 5
    <37d>   DW_AT_decl_line   : 197
    <37e>   DW_AT_decl_column : 12
    <37f>   DW_AT_type        : <0x29b>
    <383>   DW_AT_data_member_location: 16
 <2><384>: Abbrev Number: 8 (DW_TAG_member)
    <385>   DW_AT_name        : (indirect string, offset: 0xe5fd4): Timestamp
    <389>   DW_AT_decl_file   : 5
    <38a>   DW_AT_decl_line   : 200
    <38b>   DW_AT_decl_column : 12
    <38c>   DW_AT_type        : <0x29b>
    <390>   DW_AT_data_member_location: 20
 <2><391>: Abbrev Number: 8 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0x1e495): FilterMatchIndex
    <396>   DW_AT_decl_file   : 5
    <397>   DW_AT_decl_line   : 204
    <398>   DW_AT_decl_column : 12
    <399>   DW_AT_type        : <0x29b>
    <39d>   DW_AT_data_member_location: 24
 <2><39e>: Abbrev Number: 0
 <1><39f>: Abbrev Number: 2 (DW_TAG_typedef)
    <3a0>   DW_AT_name        : (indirect string, offset: 0xa7671): CAN_RxHeaderTypeDef
    <3a4>   DW_AT_decl_file   : 5
    <3a5>   DW_AT_decl_line   : 207
    <3a6>   DW_AT_decl_column : 3
    <3a7>   DW_AT_type        : <0x33a>
 <1><3ab>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <3ac>   DW_AT_byte_size   : 4
    <3ad>   DW_AT_type        : <0x279>
 <1><3b1>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <3b2>   DW_AT_byte_size   : 4
    <3b3>   DW_AT_type        : <0x28a>
 <1><3b7>: Abbrev Number: 3 (DW_TAG_base_type)
    <3b8>   DW_AT_byte_size   : 1
    <3b9>   DW_AT_encoding    : 8	(unsigned char)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x4974e): char
 <1><3be>: Abbrev Number: 3 (DW_TAG_base_type)
    <3bf>   DW_AT_byte_size   : 8
    <3c0>   DW_AT_encoding    : 4	(float)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x1e4d1): double
 <1><3c5>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <3c6>   DW_AT_encoding    : 7	(unsigned)
    <3c7>   DW_AT_byte_size   : 1
    <3c8>   DW_AT_type        : <0x216>
    <3cc>   DW_AT_decl_file   : 6
    <3cd>   DW_AT_decl_line   : 18
    <3ce>   DW_AT_decl_column : 14
    <3cf>   DW_AT_sibling     : <0x3e0>
 <2><3d3>: Abbrev Number: 15 (DW_TAG_enumerator)
    <3d4>   DW_AT_name        : (indirect string, offset: 0xb6242): STEERING
    <3d8>   DW_AT_const_value : 0
 <2><3d9>: Abbrev Number: 15 (DW_TAG_enumerator)
    <3da>   DW_AT_name        : (indirect string, offset: 0xc2d8c): BRAKING
    <3de>   DW_AT_const_value : 1
 <2><3df>: Abbrev Number: 0
 <1><3e0>: Abbrev Number: 2 (DW_TAG_typedef)
    <3e1>   DW_AT_name        : (indirect string, offset: 0x7b5e6): stepper_id
    <3e5>   DW_AT_decl_file   : 6
    <3e6>   DW_AT_decl_line   : 21
    <3e7>   DW_AT_decl_column : 3
    <3e8>   DW_AT_type        : <0x3c5>
 <1><3ec>: Abbrev Number: 6 (DW_TAG_const_type)
    <3ed>   DW_AT_type        : <0x3e0>
 <1><3f1>: Abbrev Number: 11 (DW_TAG_variable)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x84c6f): g_sendPing
    <3f6>   DW_AT_decl_file   : 1
    <3f7>   DW_AT_decl_line   : 14
    <3f8>   DW_AT_decl_column : 25
    <3f9>   DW_AT_type        : <0x285>
    <3fd>   DW_AT_external    : 1
    <3fd>   DW_AT_declaration : 1
 <1><3fd>: Abbrev Number: 16 (DW_TAG_subprogram)
    <3fe>   DW_AT_external    : 1
    <3fe>   DW_AT_name        : (indirect string, offset: 0xe09ff): HAL_GetTick
    <402>   DW_AT_decl_file   : 8
    <403>   DW_AT_decl_line   : 653
    <405>   DW_AT_decl_column : 20
    <406>   DW_AT_prototyped  : 1
    <406>   DW_AT_type        : <0x29b>
    <40a>   DW_AT_declaration : 1
 <1><40a>: Abbrev Number: 17 (DW_TAG_subprogram)
    <40b>   DW_AT_external    : 1
    <40b>   DW_AT_name        : (indirect string, offset: 0x5918a): can_parse_float
    <40f>   DW_AT_decl_file   : 7
    <410>   DW_AT_decl_line   : 47
    <411>   DW_AT_decl_column : 7
    <412>   DW_AT_prototyped  : 1
    <412>   DW_AT_type        : <0x30f>
    <416>   DW_AT_declaration : 1
    <416>   DW_AT_sibling     : <0x425>
 <2><41a>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <41b>   DW_AT_type        : <0x3b1>
 <2><41f>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <420>   DW_AT_type        : <0x279>
 <2><424>: Abbrev Number: 0
 <1><425>: Abbrev Number: 19 (DW_TAG_subprogram)
    <426>   DW_AT_external    : 1
    <426>   DW_AT_name        : (indirect string, offset: 0x69df0): set_direction
    <42a>   DW_AT_decl_file   : 6
    <42b>   DW_AT_decl_line   : 61
    <42c>   DW_AT_decl_column : 6
    <42d>   DW_AT_prototyped  : 1
    <42d>   DW_AT_declaration : 1
    <42d>   DW_AT_sibling     : <0x43c>
 <2><431>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <432>   DW_AT_type        : <0x3ec>
 <2><436>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <437>   DW_AT_type        : <0x279>
 <2><43b>: Abbrev Number: 0
 <1><43c>: Abbrev Number: 19 (DW_TAG_subprogram)
    <43d>   DW_AT_external    : 1
    <43d>   DW_AT_name        : (indirect string, offset: 0x5cbca): set_setpoint
    <441>   DW_AT_decl_file   : 6
    <442>   DW_AT_decl_line   : 62
    <443>   DW_AT_decl_column : 6
    <444>   DW_AT_prototyped  : 1
    <444>   DW_AT_declaration : 1
    <444>   DW_AT_sibling     : <0x458>
 <2><448>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <449>   DW_AT_type        : <0x3ec>
 <2><44d>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <44e>   DW_AT_type        : <0x28f>
 <2><452>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <453>   DW_AT_type        : <0x26d>
 <2><457>: Abbrev Number: 0
 <1><458>: Abbrev Number: 20 (DW_TAG_subprogram)
    <459>   DW_AT_external    : 1
    <459>   DW_AT_name        : (indirect string, offset: 0xae835): stop
    <45d>   DW_AT_decl_file   : 6
    <45e>   DW_AT_decl_line   : 60
    <45f>   DW_AT_decl_column : 6
    <460>   DW_AT_declaration : 1
    <460>   DW_AT_sibling     : <0x466>
 <2><464>: Abbrev Number: 21 (DW_TAG_unspecified_parameters)
 <2><465>: Abbrev Number: 0
 <1><466>: Abbrev Number: 20 (DW_TAG_subprogram)
    <467>   DW_AT_external    : 1
    <467>   DW_AT_name        : (indirect string, offset: 0xd27db): start
    <46b>   DW_AT_decl_file   : 6
    <46c>   DW_AT_decl_line   : 59
    <46d>   DW_AT_decl_column : 6
    <46e>   DW_AT_declaration : 1
    <46e>   DW_AT_sibling     : <0x474>
 <2><472>: Abbrev Number: 21 (DW_TAG_unspecified_parameters)
 <2><473>: Abbrev Number: 0
 <1><474>: Abbrev Number: 17 (DW_TAG_subprogram)
    <475>   DW_AT_external    : 1
    <475>   DW_AT_name        : (indirect string, offset: 0x78ab8): can_parse_long
    <479>   DW_AT_decl_file   : 7
    <47a>   DW_AT_decl_line   : 53
    <47b>   DW_AT_decl_column : 10
    <47c>   DW_AT_prototyped  : 1
    <47c>   DW_AT_type        : <0x29b>
    <480>   DW_AT_declaration : 1
    <480>   DW_AT_sibling     : <0x48f>
 <2><484>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <485>   DW_AT_type        : <0x3b1>
 <2><489>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <48a>   DW_AT_type        : <0x279>
 <2><48e>: Abbrev Number: 0
 <1><48f>: Abbrev Number: 17 (DW_TAG_subprogram)
    <490>   DW_AT_external    : 1
    <490>   DW_AT_name        : (indirect string, offset: 0x10e89): can_parse_id
    <494>   DW_AT_decl_file   : 7
    <495>   DW_AT_decl_line   : 41
    <496>   DW_AT_decl_column : 9
    <497>   DW_AT_prototyped  : 1
    <497>   DW_AT_type        : <0x279>
    <49b>   DW_AT_declaration : 1
    <49b>   DW_AT_sibling     : <0x4aa>
 <2><49f>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <4a0>   DW_AT_type        : <0x3b1>
 <2><4a4>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <4a5>   DW_AT_type        : <0x279>
 <2><4a9>: Abbrev Number: 0
 <1><4aa>: Abbrev Number: 22 (DW_TAG_subprogram)
    <4ab>   DW_AT_external    : 1
    <4ab>   DW_AT_name        : (indirect string, offset: 0x61746): can_parse_msg
    <4af>   DW_AT_decl_file   : 1
    <4b0>   DW_AT_decl_line   : 16
    <4b1>   DW_AT_decl_column : 6
    <4b2>   DW_AT_prototyped  : 1
    <4b2>   DW_AT_low_pc      : 0x80004d4
    <4b6>   DW_AT_high_pc     : 0x12c
    <4ba>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4bc>   DW_AT_GNU_all_tail_call_sites: 1
    <4bc>   DW_AT_sibling     : <0x5a8>
 <2><4c0>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x69742): header
    <4c5>   DW_AT_decl_file   : 1
    <4c6>   DW_AT_decl_line   : 16
    <4c7>   DW_AT_decl_column : 41
    <4c8>   DW_AT_type        : <0x5a8>
    <4cc>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><4cf>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xe8b0e): data
    <4d4>   DW_AT_decl_file   : 1
    <4d5>   DW_AT_decl_line   : 16
    <4d6>   DW_AT_decl_column : 58
    <4d7>   DW_AT_type        : <0x3ab>
    <4db>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><4de>: Abbrev Number: 24 (DW_TAG_variable)
    <4df>   DW_AT_name        : id
    <4e2>   DW_AT_decl_file   : 1
    <4e3>   DW_AT_decl_line   : 19
    <4e4>   DW_AT_decl_column : 10
    <4e5>   DW_AT_type        : <0x279>
    <4e9>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><4ec>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <4ed>   DW_AT_low_pc      : 0x8000502
    <4f1>   DW_AT_high_pc     : 0x26
    <4f5>   DW_AT_sibling     : <0x518>
 <3><4f9>: Abbrev Number: 26 (DW_TAG_variable)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x727ff): frame
    <4fe>   DW_AT_decl_file   : 1
    <4ff>   DW_AT_decl_line   : 23
    <500>   DW_AT_decl_column : 12
    <501>   DW_AT_type        : <0x29b>
    <505>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><508>: Abbrev Number: 26 (DW_TAG_variable)
    <509>   DW_AT_name        : (indirect string, offset: 0xe72c6): state
    <50d>   DW_AT_decl_file   : 1
    <50e>   DW_AT_decl_line   : 24
    <50f>   DW_AT_decl_column : 11
    <510>   DW_AT_type        : <0x279>
    <514>   DW_AT_location    : 2 byte block: 91 57 	(DW_OP_fbreg: -41)
 <3><517>: Abbrev Number: 0
 <2><518>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <519>   DW_AT_low_pc      : 0x8000530
    <51d>   DW_AT_high_pc     : 0x28
    <521>   DW_AT_sibling     : <0x553>
 <3><525>: Abbrev Number: 26 (DW_TAG_variable)
    <526>   DW_AT_name        : (indirect string, offset: 0x727ff): frame
    <52a>   DW_AT_decl_file   : 1
    <52b>   DW_AT_decl_line   : 31
    <52c>   DW_AT_decl_column : 12
    <52d>   DW_AT_type        : <0x29b>
    <531>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><534>: Abbrev Number: 26 (DW_TAG_variable)
    <535>   DW_AT_name        : (indirect string, offset: 0x11ea): steps
    <539>   DW_AT_decl_file   : 1
    <53a>   DW_AT_decl_line   : 32
    <53b>   DW_AT_decl_column : 12
    <53c>   DW_AT_type        : <0x28f>
    <540>   DW_AT_location    : 2 byte block: 91 5e 	(DW_OP_fbreg: -34)
 <3><543>: Abbrev Number: 24 (DW_TAG_variable)
    <544>   DW_AT_name        : dir
    <548>   DW_AT_decl_file   : 1
    <549>   DW_AT_decl_line   : 33
    <54a>   DW_AT_decl_column : 11
    <54b>   DW_AT_type        : <0x279>
    <54f>   DW_AT_location    : 2 byte block: 91 5d 	(DW_OP_fbreg: -35)
 <3><552>: Abbrev Number: 0
 <2><553>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <554>   DW_AT_low_pc      : 0x8000562
    <558>   DW_AT_high_pc     : 0x1e
    <55c>   DW_AT_sibling     : <0x57f>
 <3><560>: Abbrev Number: 26 (DW_TAG_variable)
    <561>   DW_AT_name        : (indirect string, offset: 0x727ff): frame
    <565>   DW_AT_decl_file   : 1
    <566>   DW_AT_decl_line   : 37
    <567>   DW_AT_decl_column : 12
    <568>   DW_AT_type        : <0x29b>
    <56c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><56f>: Abbrev Number: 24 (DW_TAG_variable)
    <570>   DW_AT_name        : dir
    <574>   DW_AT_decl_file   : 1
    <575>   DW_AT_decl_line   : 39
    <576>   DW_AT_decl_column : 11
    <577>   DW_AT_type        : <0x279>
    <57b>   DW_AT_location    : 2 byte block: 91 67 	(DW_OP_fbreg: -25)
 <3><57e>: Abbrev Number: 0
 <2><57f>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <580>   DW_AT_low_pc      : 0x8000592
    <584>   DW_AT_high_pc     : 0x30
 <3><588>: Abbrev Number: 24 (DW_TAG_variable)
    <589>   DW_AT_name        : val
    <58d>   DW_AT_decl_file   : 1
    <58e>   DW_AT_decl_line   : 44
    <58f>   DW_AT_decl_column : 9
    <590>   DW_AT_type        : <0x30f>
    <594>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><597>: Abbrev Number: 26 (DW_TAG_variable)
    <598>   DW_AT_name        : (indirect string, offset: 0xde556): angle
    <59c>   DW_AT_decl_file   : 1
    <59d>   DW_AT_decl_line   : 45
    <59e>   DW_AT_decl_column : 9
    <59f>   DW_AT_type        : <0x30f>
    <5a3>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><5a6>: Abbrev Number: 0
 <2><5a7>: Abbrev Number: 0
 <1><5a8>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5a9>   DW_AT_byte_size   : 4
    <5aa>   DW_AT_type        : <0x39f>
 <1><5ae>: Abbrev Number: 0
  Compilation Unit @ offset 0x5af:
   Length:        0xdc8 (32-bit)
   Version:       4
   Abbrev Offset: 0x21b
   Pointer Size:  4
 <0><5ba>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <5bb>   DW_AT_producer    : (indirect string, offset: 0x3044): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <5bf>   DW_AT_language    : 12	(ANSI C99)
    <5c0>   DW_AT_name        : (indirect string, offset: 0xe3034): ../Core/Src/CAN/can_tasks.c
    <5c4>   DW_AT_comp_dir    : (indirect string, offset: 0x18c7): /home/saveasmtz/Documents/embedded/stepper_boards_firmware/Debug
    <5c8>   DW_AT_ranges      : 0x10
    <5cc>   DW_AT_low_pc      : 0x0
    <5d0>   DW_AT_stmt_list   : 0xe59
    <5d4>   DW_AT_GNU_macros  : 0x22651
 <1><5d8>: Abbrev Number: 2 (DW_TAG_base_type)
    <5d9>   DW_AT_byte_size   : 1
    <5da>   DW_AT_encoding    : 6	(signed char)
    <5db>   DW_AT_name        : (indirect string, offset: 0x29e5): signed char
 <1><5df>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x2c64): __uint8_t
    <5e4>   DW_AT_decl_file   : 2
    <5e5>   DW_AT_decl_line   : 43
    <5e6>   DW_AT_decl_column : 24
    <5e7>   DW_AT_type        : <0x5eb>
 <1><5eb>: Abbrev Number: 2 (DW_TAG_base_type)
    <5ec>   DW_AT_byte_size   : 1
    <5ed>   DW_AT_encoding    : 8	(unsigned char)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x2bdf): unsigned char
 <1><5f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <5f3>   DW_AT_byte_size   : 2
    <5f4>   DW_AT_encoding    : 5	(signed)
    <5f5>   DW_AT_name        : (indirect string, offset: 0x74b): short int
 <1><5f9>: Abbrev Number: 2 (DW_TAG_base_type)
    <5fa>   DW_AT_byte_size   : 2
    <5fb>   DW_AT_encoding    : 7	(unsigned)
    <5fc>   DW_AT_name        : (indirect string, offset: 0x5ec): short unsigned int
 <1><600>: Abbrev Number: 2 (DW_TAG_base_type)
    <601>   DW_AT_byte_size   : 4
    <602>   DW_AT_encoding    : 5	(signed)
    <603>   DW_AT_name        : (indirect string, offset: 0x2868): long int
 <1><607>: Abbrev Number: 3 (DW_TAG_typedef)
    <608>   DW_AT_name        : (indirect string, offset: 0x3251): __uint32_t
    <60c>   DW_AT_decl_file   : 2
    <60d>   DW_AT_decl_line   : 79
    <60e>   DW_AT_decl_column : 25
    <60f>   DW_AT_type        : <0x613>
 <1><613>: Abbrev Number: 2 (DW_TAG_base_type)
    <614>   DW_AT_byte_size   : 4
    <615>   DW_AT_encoding    : 7	(unsigned)
    <616>   DW_AT_name        : (indirect string, offset: 0x2598): long unsigned int
 <1><61a>: Abbrev Number: 2 (DW_TAG_base_type)
    <61b>   DW_AT_byte_size   : 8
    <61c>   DW_AT_encoding    : 5	(signed)
    <61d>   DW_AT_name        : (indirect string, offset: 0x177d): long long int
 <1><621>: Abbrev Number: 2 (DW_TAG_base_type)
    <622>   DW_AT_byte_size   : 8
    <623>   DW_AT_encoding    : 7	(unsigned)
    <624>   DW_AT_name        : (indirect string, offset: 0x36c6): long long unsigned int
 <1><628>: Abbrev Number: 4 (DW_TAG_base_type)
    <629>   DW_AT_byte_size   : 4
    <62a>   DW_AT_encoding    : 5	(signed)
    <62b>   DW_AT_name        : int
 <1><62f>: Abbrev Number: 2 (DW_TAG_base_type)
    <630>   DW_AT_byte_size   : 4
    <631>   DW_AT_encoding    : 7	(unsigned)
    <632>   DW_AT_name        : (indirect string, offset: 0x3390): unsigned int
 <1><636>: Abbrev Number: 3 (DW_TAG_typedef)
    <637>   DW_AT_name        : (indirect string, offset: 0x2c66): uint8_t
    <63b>   DW_AT_decl_file   : 3
    <63c>   DW_AT_decl_line   : 24
    <63d>   DW_AT_decl_column : 19
    <63e>   DW_AT_type        : <0x5df>
 <1><642>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <643>   DW_AT_type        : <0x636>
 <1><647>: Abbrev Number: 6 (DW_TAG_const_type)
    <648>   DW_AT_type        : <0x636>
 <1><64c>: Abbrev Number: 3 (DW_TAG_typedef)
    <64d>   DW_AT_name        : (indirect string, offset: 0xa367c): uint32_t
    <651>   DW_AT_decl_file   : 3
    <652>   DW_AT_decl_line   : 48
    <653>   DW_AT_decl_column : 20
    <654>   DW_AT_type        : <0x607>
 <1><658>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <659>   DW_AT_type        : <0x64c>
 <1><65d>: Abbrev Number: 6 (DW_TAG_const_type)
    <65e>   DW_AT_type        : <0x64c>
 <1><662>: Abbrev Number: 2 (DW_TAG_base_type)
    <663>   DW_AT_byte_size   : 4
    <664>   DW_AT_encoding    : 4	(float)
    <665>   DW_AT_name        : (indirect string, offset: 0x74cf): float
 <1><669>: Abbrev Number: 7 (DW_TAG_structure_type)
    <66a>   DW_AT_byte_size   : 9
    <66b>   DW_AT_decl_file   : 4
    <66c>   DW_AT_decl_line   : 61
    <66d>   DW_AT_decl_column : 9
    <66e>   DW_AT_sibling     : <0x68d>
 <2><672>: Abbrev Number: 8 (DW_TAG_member)
    <673>   DW_AT_name        : buf
    <677>   DW_AT_decl_file   : 4
    <678>   DW_AT_decl_line   : 62
    <679>   DW_AT_decl_column : 10
    <67a>   DW_AT_type        : <0x68d>
    <67e>   DW_AT_data_member_location: 0
 <2><67f>: Abbrev Number: 9 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0xe17c6): msg_size
    <684>   DW_AT_decl_file   : 4
    <685>   DW_AT_decl_line   : 63
    <686>   DW_AT_decl_column : 10
    <687>   DW_AT_type        : <0x636>
    <68b>   DW_AT_data_member_location: 8
 <2><68c>: Abbrev Number: 0
 <1><68d>: Abbrev Number: 10 (DW_TAG_array_type)
    <68e>   DW_AT_type        : <0x636>
    <692>   DW_AT_sibling     : <0x69d>
 <2><696>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <697>   DW_AT_type        : <0x62f>
    <69b>   DW_AT_upper_bound : 7
 <2><69c>: Abbrev Number: 0
 <1><69d>: Abbrev Number: 3 (DW_TAG_typedef)
    <69e>   DW_AT_name        : (indirect string, offset: 0xe1f31): CAN_TX_QUEUE_OBJ
    <6a2>   DW_AT_decl_file   : 4
    <6a3>   DW_AT_decl_line   : 64
    <6a4>   DW_AT_decl_column : 3
    <6a5>   DW_AT_type        : <0x669>
 <1><6a9>: Abbrev Number: 2 (DW_TAG_base_type)
    <6aa>   DW_AT_byte_size   : 8
    <6ab>   DW_AT_encoding    : 4	(float)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x17f4f): long double
 <1><6b0>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <6b1>   DW_AT_byte_size   : 4
    <6b2>   DW_AT_type        : <0x6b6>
 <1><6b6>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <6b7>   DW_AT_prototyped  : 1
    <6b7>   DW_AT_sibling     : <0x6c1>
 <2><6bb>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <6bc>   DW_AT_type        : <0x6c1>
 <2><6c0>: Abbrev Number: 0
 <1><6c1>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <6c2>   DW_AT_byte_size   : 4
 <1><6c3>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <6c4>   DW_AT_byte_size   : 4
    <6c5>   DW_AT_type        : <0x636>
 <1><6c9>: Abbrev Number: 2 (DW_TAG_base_type)
    <6ca>   DW_AT_byte_size   : 1
    <6cb>   DW_AT_encoding    : 8	(unsigned char)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x4974e): char
 <1><6d0>: Abbrev Number: 6 (DW_TAG_const_type)
    <6d1>   DW_AT_type        : <0x6c9>
 <1><6d5>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <6d6>   DW_AT_byte_size   : 4
    <6d7>   DW_AT_type        : <0x6d0>
 <1><6db>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <6dc>   DW_AT_encoding    : 5	(signed)
    <6dd>   DW_AT_byte_size   : 4
    <6de>   DW_AT_type        : <0x628>
    <6e2>   DW_AT_decl_file   : 5
    <6e3>   DW_AT_decl_line   : 82
    <6e4>   DW_AT_decl_column : 14
    <6e5>   DW_AT_sibling     : <0x82b>
 <2><6e9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6ea>   DW_AT_name        : (indirect string, offset: 0xe1e22): osPriorityNone
    <6ee>   DW_AT_const_value : 0
 <2><6ef>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6f0>   DW_AT_name        : (indirect string, offset: 0xe2ce4): osPriorityIdle
    <6f4>   DW_AT_const_value : 1
 <2><6f5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6f6>   DW_AT_name        : (indirect string, offset: 0xe2e76): osPriorityLow
    <6fa>   DW_AT_const_value : 8
 <2><6fb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6fc>   DW_AT_name        : (indirect string, offset: 0xe2b55): osPriorityLow1
    <700>   DW_AT_const_value : 9
 <2><701>: Abbrev Number: 17 (DW_TAG_enumerator)
    <702>   DW_AT_name        : (indirect string, offset: 0xe2f98): osPriorityLow2
    <706>   DW_AT_const_value : 10
 <2><707>: Abbrev Number: 17 (DW_TAG_enumerator)
    <708>   DW_AT_name        : (indirect string, offset: 0xe2fa7): osPriorityLow3
    <70c>   DW_AT_const_value : 11
 <2><70d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <70e>   DW_AT_name        : (indirect string, offset: 0xe2fb6): osPriorityLow4
    <712>   DW_AT_const_value : 12
 <2><713>: Abbrev Number: 17 (DW_TAG_enumerator)
    <714>   DW_AT_name        : (indirect string, offset: 0xe2fc5): osPriorityLow5
    <718>   DW_AT_const_value : 13
 <2><719>: Abbrev Number: 17 (DW_TAG_enumerator)
    <71a>   DW_AT_name        : (indirect string, offset: 0xe2fd4): osPriorityLow6
    <71e>   DW_AT_const_value : 14
 <2><71f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <720>   DW_AT_name        : (indirect string, offset: 0xe2027): osPriorityLow7
    <724>   DW_AT_const_value : 15
 <2><725>: Abbrev Number: 17 (DW_TAG_enumerator)
    <726>   DW_AT_name        : (indirect string, offset: 0xe29a9): osPriorityBelowNormal
    <72a>   DW_AT_const_value : 16
 <2><72b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <72c>   DW_AT_name        : (indirect string, offset: 0xe251a): osPriorityBelowNormal1
    <730>   DW_AT_const_value : 17
 <2><731>: Abbrev Number: 17 (DW_TAG_enumerator)
    <732>   DW_AT_name        : (indirect string, offset: 0xe2c32): osPriorityBelowNormal2
    <736>   DW_AT_const_value : 18
 <2><737>: Abbrev Number: 17 (DW_TAG_enumerator)
    <738>   DW_AT_name        : (indirect string, offset: 0xe28e0): osPriorityBelowNormal3
    <73c>   DW_AT_const_value : 19
 <2><73d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <73e>   DW_AT_name        : (indirect string, offset: 0xe2c49): osPriorityBelowNormal4
    <742>   DW_AT_const_value : 20
 <2><743>: Abbrev Number: 17 (DW_TAG_enumerator)
    <744>   DW_AT_name        : (indirect string, offset: 0xe2c60): osPriorityBelowNormal5
    <748>   DW_AT_const_value : 21
 <2><749>: Abbrev Number: 17 (DW_TAG_enumerator)
    <74a>   DW_AT_name        : (indirect string, offset: 0xe2c77): osPriorityBelowNormal6
    <74e>   DW_AT_const_value : 22
 <2><74f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <750>   DW_AT_name        : (indirect string, offset: 0xe2c8e): osPriorityBelowNormal7
    <754>   DW_AT_const_value : 23
 <2><755>: Abbrev Number: 17 (DW_TAG_enumerator)
    <756>   DW_AT_name        : (indirect string, offset: 0xe2b75): osPriorityNormal
    <75a>   DW_AT_const_value : 24
 <2><75b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <75c>   DW_AT_name        : (indirect string, offset: 0xe19fa): osPriorityNormal1
    <760>   DW_AT_const_value : 25
 <2><761>: Abbrev Number: 17 (DW_TAG_enumerator)
    <762>   DW_AT_name        : (indirect string, offset: 0xe1a0c): osPriorityNormal2
    <766>   DW_AT_const_value : 26
 <2><767>: Abbrev Number: 17 (DW_TAG_enumerator)
    <768>   DW_AT_name        : (indirect string, offset: 0xe1a1e): osPriorityNormal3
    <76c>   DW_AT_const_value : 27
 <2><76d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <76e>   DW_AT_name        : (indirect string, offset: 0xe1a30): osPriorityNormal4
    <772>   DW_AT_const_value : 28
 <2><773>: Abbrev Number: 17 (DW_TAG_enumerator)
    <774>   DW_AT_name        : (indirect string, offset: 0xe2a64): osPriorityNormal5
    <778>   DW_AT_const_value : 29
 <2><779>: Abbrev Number: 17 (DW_TAG_enumerator)
    <77a>   DW_AT_name        : (indirect string, offset: 0xe1a42): osPriorityNormal6
    <77e>   DW_AT_const_value : 30
 <2><77f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <780>   DW_AT_name        : (indirect string, offset: 0xe1a54): osPriorityNormal7
    <784>   DW_AT_const_value : 31
 <2><785>: Abbrev Number: 17 (DW_TAG_enumerator)
    <786>   DW_AT_name        : (indirect string, offset: 0xe26ac): osPriorityAboveNormal
    <78a>   DW_AT_const_value : 32
 <2><78b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <78c>   DW_AT_name        : (indirect string, offset: 0xe30ea): osPriorityAboveNormal1
    <790>   DW_AT_const_value : 33
 <2><791>: Abbrev Number: 17 (DW_TAG_enumerator)
    <792>   DW_AT_name        : (indirect string, offset: 0xe3101): osPriorityAboveNormal2
    <796>   DW_AT_const_value : 34
 <2><797>: Abbrev Number: 17 (DW_TAG_enumerator)
    <798>   DW_AT_name        : (indirect string, offset: 0xe3118): osPriorityAboveNormal3
    <79c>   DW_AT_const_value : 35
 <2><79d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <79e>   DW_AT_name        : (indirect string, offset: 0xe312f): osPriorityAboveNormal4
    <7a2>   DW_AT_const_value : 36
 <2><7a3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7a4>   DW_AT_name        : (indirect string, offset: 0xe2d6b): osPriorityAboveNormal5
    <7a8>   DW_AT_const_value : 37
 <2><7a9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7aa>   DW_AT_name        : (indirect string, offset: 0xe3146): osPriorityAboveNormal6
    <7ae>   DW_AT_const_value : 38
 <2><7af>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7b0>   DW_AT_name        : (indirect string, offset: 0xe315d): osPriorityAboveNormal7
    <7b4>   DW_AT_const_value : 39
 <2><7b5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xe1f55): osPriorityHigh
    <7ba>   DW_AT_const_value : 40
 <2><7bb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7bc>   DW_AT_name        : (indirect string, offset: 0xe27ae): osPriorityHigh1
    <7c0>   DW_AT_const_value : 41
 <2><7c1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7c2>   DW_AT_name        : (indirect string, offset: 0xe27be): osPriorityHigh2
    <7c6>   DW_AT_const_value : 42
 <2><7c7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7c8>   DW_AT_name        : (indirect string, offset: 0xe27ce): osPriorityHigh3
    <7cc>   DW_AT_const_value : 43
 <2><7cd>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7ce>   DW_AT_name        : (indirect string, offset: 0xe27de): osPriorityHigh4
    <7d2>   DW_AT_const_value : 44
 <2><7d3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7d4>   DW_AT_name        : (indirect string, offset: 0xe27ee): osPriorityHigh5
    <7d8>   DW_AT_const_value : 45
 <2><7d9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7da>   DW_AT_name        : (indirect string, offset: 0xe27fe): osPriorityHigh6
    <7de>   DW_AT_const_value : 46
 <2><7df>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7e0>   DW_AT_name        : (indirect string, offset: 0xe280e): osPriorityHigh7
    <7e4>   DW_AT_const_value : 47
 <2><7e5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7e6>   DW_AT_name        : (indirect string, offset: 0xe2df2): osPriorityRealtime
    <7ea>   DW_AT_const_value : 48
 <2><7eb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7ec>   DW_AT_name        : (indirect string, offset: 0xe25ed): osPriorityRealtime1
    <7f0>   DW_AT_const_value : 49
 <2><7f1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7f2>   DW_AT_name        : (indirect string, offset: 0xe2601): osPriorityRealtime2
    <7f6>   DW_AT_const_value : 50
 <2><7f7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7f8>   DW_AT_name        : (indirect string, offset: 0xe2615): osPriorityRealtime3
    <7fc>   DW_AT_const_value : 51
 <2><7fd>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7fe>   DW_AT_name        : (indirect string, offset: 0xe2629): osPriorityRealtime4
    <802>   DW_AT_const_value : 52
 <2><803>: Abbrev Number: 17 (DW_TAG_enumerator)
    <804>   DW_AT_name        : (indirect string, offset: 0xe263d): osPriorityRealtime5
    <808>   DW_AT_const_value : 53
 <2><809>: Abbrev Number: 17 (DW_TAG_enumerator)
    <80a>   DW_AT_name        : (indirect string, offset: 0xe2651): osPriorityRealtime6
    <80e>   DW_AT_const_value : 54
 <2><80f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <810>   DW_AT_name        : (indirect string, offset: 0xe2665): osPriorityRealtime7
    <814>   DW_AT_const_value : 55
 <2><815>: Abbrev Number: 17 (DW_TAG_enumerator)
    <816>   DW_AT_name        : (indirect string, offset: 0xe16cd): osPriorityISR
    <81a>   DW_AT_const_value : 56
 <2><81b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <81c>   DW_AT_name        : (indirect string, offset: 0xe2d5b): osPriorityError
    <820>   DW_AT_const_value : -1
 <2><821>: Abbrev Number: 19 (DW_TAG_enumerator)
    <822>   DW_AT_name        : (indirect string, offset: 0xe2fe3): osPriorityReserved
    <826>   DW_AT_const_value : 0x7fffffff
 <2><82a>: Abbrev Number: 0
 <1><82b>: Abbrev Number: 3 (DW_TAG_typedef)
    <82c>   DW_AT_name        : (indirect string, offset: 0xbd574): osPriority_t
    <830>   DW_AT_decl_file   : 5
    <831>   DW_AT_decl_line   : 136
    <832>   DW_AT_decl_column : 3
    <833>   DW_AT_type        : <0x6db>
 <1><837>: Abbrev Number: 3 (DW_TAG_typedef)
    <838>   DW_AT_name        : (indirect string, offset: 0xe2444): osThreadFunc_t
    <83c>   DW_AT_decl_file   : 5
    <83d>   DW_AT_decl_line   : 139
    <83e>   DW_AT_decl_column : 16
    <83f>   DW_AT_type        : <0x6b0>
 <1><843>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <844>   DW_AT_encoding    : 5	(signed)
    <845>   DW_AT_byte_size   : 4
    <846>   DW_AT_type        : <0x628>
    <84a>   DW_AT_decl_file   : 5
    <84b>   DW_AT_decl_line   : 176
    <84c>   DW_AT_decl_column : 14
    <84d>   DW_AT_sibling     : <0x885>
 <2><851>: Abbrev Number: 17 (DW_TAG_enumerator)
    <852>   DW_AT_name        : (indirect string, offset: 0xe2acb): osOK
    <856>   DW_AT_const_value : 0
 <2><857>: Abbrev Number: 18 (DW_TAG_enumerator)
    <858>   DW_AT_name        : (indirect string, offset: 0x68656): osError
    <85c>   DW_AT_const_value : -1
 <2><85d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <85e>   DW_AT_name        : (indirect string, offset: 0x94d5f): osErrorTimeout
    <862>   DW_AT_const_value : -2
 <2><863>: Abbrev Number: 18 (DW_TAG_enumerator)
    <864>   DW_AT_name        : (indirect string, offset: 0xe2754): osErrorResource
    <868>   DW_AT_const_value : -3
 <2><869>: Abbrev Number: 18 (DW_TAG_enumerator)
    <86a>   DW_AT_name        : (indirect string, offset: 0xe1d2d): osErrorParameter
    <86e>   DW_AT_const_value : -4
 <2><86f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <870>   DW_AT_name        : (indirect string, offset: 0xe1a8b): osErrorNoMemory
    <874>   DW_AT_const_value : -5
 <2><875>: Abbrev Number: 18 (DW_TAG_enumerator)
    <876>   DW_AT_name        : (indirect string, offset: 0xe2b21): osErrorISR
    <87a>   DW_AT_const_value : -6
 <2><87b>: Abbrev Number: 19 (DW_TAG_enumerator)
    <87c>   DW_AT_name        : (indirect string, offset: 0xe237c): osStatusReserved
    <880>   DW_AT_const_value : 0x7fffffff
 <2><884>: Abbrev Number: 0
 <1><885>: Abbrev Number: 3 (DW_TAG_typedef)
    <886>   DW_AT_name        : (indirect string, offset: 0xe1ee9): osStatus_t
    <88a>   DW_AT_decl_file   : 5
    <88b>   DW_AT_decl_line   : 185
    <88c>   DW_AT_decl_column : 3
    <88d>   DW_AT_type        : <0x843>
 <1><891>: Abbrev Number: 3 (DW_TAG_typedef)
    <892>   DW_AT_name        : (indirect string, offset: 0x947ac): osThreadId_t
    <896>   DW_AT_decl_file   : 5
    <897>   DW_AT_decl_line   : 189
    <898>   DW_AT_decl_column : 15
    <899>   DW_AT_type        : <0x6c1>
 <1><89d>: Abbrev Number: 3 (DW_TAG_typedef)
    <89e>   DW_AT_name        : (indirect string, offset: 0xe219c): osMessageQueueId_t
    <8a2>   DW_AT_decl_file   : 5
    <8a3>   DW_AT_decl_line   : 207
    <8a4>   DW_AT_decl_column : 15
    <8a5>   DW_AT_type        : <0x6c1>
 <1><8a9>: Abbrev Number: 3 (DW_TAG_typedef)
    <8aa>   DW_AT_name        : (indirect string, offset: 0xe2836): TZ_ModuleId_t
    <8ae>   DW_AT_decl_file   : 5
    <8af>   DW_AT_decl_line   : 213
    <8b0>   DW_AT_decl_column : 18
    <8b1>   DW_AT_type        : <0x64c>
 <1><8b5>: Abbrev Number: 7 (DW_TAG_structure_type)
    <8b6>   DW_AT_byte_size   : 36
    <8b7>   DW_AT_decl_file   : 5
    <8b8>   DW_AT_decl_line   : 218
    <8b9>   DW_AT_decl_column : 9
    <8ba>   DW_AT_sibling     : <0x934>
 <2><8be>: Abbrev Number: 9 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xc932a): name
    <8c3>   DW_AT_decl_file   : 5
    <8c4>   DW_AT_decl_line   : 219
    <8c5>   DW_AT_decl_column : 33
    <8c6>   DW_AT_type        : <0x6d5>
    <8ca>   DW_AT_data_member_location: 0
 <2><8cb>: Abbrev Number: 9 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0xe274a): attr_bits
    <8d0>   DW_AT_decl_file   : 5
    <8d1>   DW_AT_decl_line   : 220
    <8d2>   DW_AT_decl_column : 28
    <8d3>   DW_AT_type        : <0x64c>
    <8d7>   DW_AT_data_member_location: 4
 <2><8d8>: Abbrev Number: 9 (DW_TAG_member)
    <8d9>   DW_AT_name        : (indirect string, offset: 0xe1b9d): cb_mem
    <8dd>   DW_AT_decl_file   : 5
    <8de>   DW_AT_decl_line   : 221
    <8df>   DW_AT_decl_column : 30
    <8e0>   DW_AT_type        : <0x6c1>
    <8e4>   DW_AT_data_member_location: 8
 <2><8e5>: Abbrev Number: 9 (DW_TAG_member)
    <8e6>   DW_AT_name        : (indirect string, offset: 0xe2f7b): cb_size
    <8ea>   DW_AT_decl_file   : 5
    <8eb>   DW_AT_decl_line   : 222
    <8ec>   DW_AT_decl_column : 30
    <8ed>   DW_AT_type        : <0x64c>
    <8f1>   DW_AT_data_member_location: 12
 <2><8f2>: Abbrev Number: 9 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0xe2e05): stack_mem
    <8f7>   DW_AT_decl_file   : 5
    <8f8>   DW_AT_decl_line   : 223
    <8f9>   DW_AT_decl_column : 27
    <8fa>   DW_AT_type        : <0x6c1>
    <8fe>   DW_AT_data_member_location: 16
 <2><8ff>: Abbrev Number: 9 (DW_TAG_member)
    <900>   DW_AT_name        : (indirect string, offset: 0xe2679): stack_size
    <904>   DW_AT_decl_file   : 5
    <905>   DW_AT_decl_line   : 224
    <906>   DW_AT_decl_column : 27
    <907>   DW_AT_type        : <0x64c>
    <90b>   DW_AT_data_member_location: 20
 <2><90c>: Abbrev Number: 9 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0xe2095): priority
    <911>   DW_AT_decl_file   : 5
    <912>   DW_AT_decl_line   : 225
    <913>   DW_AT_decl_column : 29
    <914>   DW_AT_type        : <0x82b>
    <918>   DW_AT_data_member_location: 24
 <2><919>: Abbrev Number: 9 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0xe212e): tz_module
    <91e>   DW_AT_decl_file   : 5
    <91f>   DW_AT_decl_line   : 226
    <920>   DW_AT_decl_column : 28
    <921>   DW_AT_type        : <0x8a9>
    <925>   DW_AT_data_member_location: 28
 <2><926>: Abbrev Number: 9 (DW_TAG_member)
    <927>   DW_AT_name        : (indirect string, offset: 0xe2dcd): reserved
    <92b>   DW_AT_decl_file   : 5
    <92c>   DW_AT_decl_line   : 227
    <92d>   DW_AT_decl_column : 29
    <92e>   DW_AT_type        : <0x64c>
    <932>   DW_AT_data_member_location: 32
 <2><933>: Abbrev Number: 0
 <1><934>: Abbrev Number: 3 (DW_TAG_typedef)
    <935>   DW_AT_name        : (indirect string, offset: 0xe19eb): osThreadAttr_t
    <939>   DW_AT_decl_file   : 5
    <93a>   DW_AT_decl_line   : 228
    <93b>   DW_AT_decl_column : 3
    <93c>   DW_AT_type        : <0x8b5>
 <1><940>: Abbrev Number: 6 (DW_TAG_const_type)
    <941>   DW_AT_type        : <0x934>
 <1><945>: Abbrev Number: 20 (DW_TAG_structure_type)
    <946>   DW_AT_byte_size   : 24
    <947>   DW_AT_decl_file   : 5
    <948>   DW_AT_decl_line   : 273
    <94a>   DW_AT_decl_column : 9
    <94b>   DW_AT_sibling     : <0x9a4>
 <2><94f>: Abbrev Number: 21 (DW_TAG_member)
    <950>   DW_AT_name        : (indirect string, offset: 0xc932a): name
    <954>   DW_AT_decl_file   : 5
    <955>   DW_AT_decl_line   : 274
    <957>   DW_AT_decl_column : 33
    <958>   DW_AT_type        : <0x6d5>
    <95c>   DW_AT_data_member_location: 0
 <2><95d>: Abbrev Number: 21 (DW_TAG_member)
    <95e>   DW_AT_name        : (indirect string, offset: 0xe274a): attr_bits
    <962>   DW_AT_decl_file   : 5
    <963>   DW_AT_decl_line   : 275
    <965>   DW_AT_decl_column : 28
    <966>   DW_AT_type        : <0x64c>
    <96a>   DW_AT_data_member_location: 4
 <2><96b>: Abbrev Number: 21 (DW_TAG_member)
    <96c>   DW_AT_name        : (indirect string, offset: 0xe1b9d): cb_mem
    <970>   DW_AT_decl_file   : 5
    <971>   DW_AT_decl_line   : 276
    <973>   DW_AT_decl_column : 30
    <974>   DW_AT_type        : <0x6c1>
    <978>   DW_AT_data_member_location: 8
 <2><979>: Abbrev Number: 21 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0xe2f7b): cb_size
    <97e>   DW_AT_decl_file   : 5
    <97f>   DW_AT_decl_line   : 277
    <981>   DW_AT_decl_column : 30
    <982>   DW_AT_type        : <0x64c>
    <986>   DW_AT_data_member_location: 12
 <2><987>: Abbrev Number: 21 (DW_TAG_member)
    <988>   DW_AT_name        : (indirect string, offset: 0xe208e): mq_mem
    <98c>   DW_AT_decl_file   : 5
    <98d>   DW_AT_decl_line   : 278
    <98f>   DW_AT_decl_column : 30
    <990>   DW_AT_type        : <0x6c1>
    <994>   DW_AT_data_member_location: 16
 <2><995>: Abbrev Number: 21 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0xe2db2): mq_size
    <99a>   DW_AT_decl_file   : 5
    <99b>   DW_AT_decl_line   : 279
    <99d>   DW_AT_decl_column : 30
    <99e>   DW_AT_type        : <0x64c>
    <9a2>   DW_AT_data_member_location: 20
 <2><9a3>: Abbrev Number: 0
 <1><9a4>: Abbrev Number: 22 (DW_TAG_typedef)
    <9a5>   DW_AT_name        : (indirect string, offset: 0xe21c1): osMessageQueueAttr_t
    <9a9>   DW_AT_decl_file   : 5
    <9aa>   DW_AT_decl_line   : 280
    <9ac>   DW_AT_decl_column : 3
    <9ad>   DW_AT_type        : <0x945>
 <1><9b1>: Abbrev Number: 6 (DW_TAG_const_type)
    <9b2>   DW_AT_type        : <0x9a4>
 <1><9b6>: Abbrev Number: 23 (DW_TAG_variable)
    <9b7>   DW_AT_name        : (indirect string, offset: 0xe2e64): debugMessageQueue
    <9bb>   DW_AT_decl_file   : 6
    <9bc>   DW_AT_decl_line   : 15
    <9bd>   DW_AT_decl_column : 27
    <9be>   DW_AT_type        : <0x89d>
    <9c2>   DW_AT_external    : 1
    <9c2>   DW_AT_declaration : 1
 <1><9c2>: Abbrev Number: 23 (DW_TAG_variable)
    <9c3>   DW_AT_name        : (indirect string, offset: 0xe2ff6): txMessageQueue
    <9c7>   DW_AT_decl_file   : 6
    <9c8>   DW_AT_decl_line   : 16
    <9c9>   DW_AT_decl_column : 27
    <9ca>   DW_AT_type        : <0x89d>
    <9ce>   DW_AT_external    : 1
    <9ce>   DW_AT_declaration : 1
 <1><9ce>: Abbrev Number: 10 (DW_TAG_array_type)
    <9cf>   DW_AT_type        : <0x64c>
    <9d3>   DW_AT_sibling     : <0x9de>
 <2><9d7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9d8>   DW_AT_type        : <0x62f>
    <9dc>   DW_AT_upper_bound : 7
 <2><9dd>: Abbrev Number: 0
 <1><9de>: Abbrev Number: 7 (DW_TAG_structure_type)
    <9df>   DW_AT_byte_size   : 16
    <9e0>   DW_AT_decl_file   : 7
    <9e1>   DW_AT_decl_line   : 215
    <9e2>   DW_AT_decl_column : 9
    <9e3>   DW_AT_sibling     : <0xa1c>
 <2><9e7>: Abbrev Number: 8 (DW_TAG_member)
    <9e8>   DW_AT_name        : TIR
    <9ec>   DW_AT_decl_file   : 7
    <9ed>   DW_AT_decl_line   : 217
    <9ee>   DW_AT_decl_column : 17
    <9ef>   DW_AT_type        : <0x658>
    <9f3>   DW_AT_data_member_location: 0
 <2><9f4>: Abbrev Number: 9 (DW_TAG_member)
    <9f5>   DW_AT_name        : (indirect string, offset: 0xe2313): TDTR
    <9f9>   DW_AT_decl_file   : 7
    <9fa>   DW_AT_decl_line   : 218
    <9fb>   DW_AT_decl_column : 17
    <9fc>   DW_AT_type        : <0x658>
    <a00>   DW_AT_data_member_location: 4
 <2><a01>: Abbrev Number: 9 (DW_TAG_member)
    <a02>   DW_AT_name        : (indirect string, offset: 0xe2214): TDLR
    <a06>   DW_AT_decl_file   : 7
    <a07>   DW_AT_decl_line   : 219
    <a08>   DW_AT_decl_column : 17
    <a09>   DW_AT_type        : <0x658>
    <a0d>   DW_AT_data_member_location: 8
 <2><a0e>: Abbrev Number: 9 (DW_TAG_member)
    <a0f>   DW_AT_name        : (indirect string, offset: 0xe2202): TDHR
    <a13>   DW_AT_decl_file   : 7
    <a14>   DW_AT_decl_line   : 220
    <a15>   DW_AT_decl_column : 17
    <a16>   DW_AT_type        : <0x658>
    <a1a>   DW_AT_data_member_location: 12
 <2><a1b>: Abbrev Number: 0
 <1><a1c>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1d>   DW_AT_name        : (indirect string, offset: 0xe24dd): CAN_TxMailBox_TypeDef
    <a21>   DW_AT_decl_file   : 7
    <a22>   DW_AT_decl_line   : 221
    <a23>   DW_AT_decl_column : 3
    <a24>   DW_AT_type        : <0x9de>
 <1><a28>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a29>   DW_AT_byte_size   : 16
    <a2a>   DW_AT_decl_file   : 7
    <a2b>   DW_AT_decl_line   : 227
    <a2c>   DW_AT_decl_column : 9
    <a2d>   DW_AT_sibling     : <0xa66>
 <2><a31>: Abbrev Number: 8 (DW_TAG_member)
    <a32>   DW_AT_name        : RIR
    <a36>   DW_AT_decl_file   : 7
    <a37>   DW_AT_decl_line   : 229
    <a38>   DW_AT_decl_column : 17
    <a39>   DW_AT_type        : <0x658>
    <a3d>   DW_AT_data_member_location: 0
 <2><a3e>: Abbrev Number: 9 (DW_TAG_member)
    <a3f>   DW_AT_name        : (indirect string, offset: 0xe1930): RDTR
    <a43>   DW_AT_decl_file   : 7
    <a44>   DW_AT_decl_line   : 230
    <a45>   DW_AT_decl_column : 17
    <a46>   DW_AT_type        : <0x658>
    <a4a>   DW_AT_data_member_location: 4
 <2><a4b>: Abbrev Number: 9 (DW_TAG_member)
    <a4c>   DW_AT_name        : (indirect string, offset: 0xe18e4): RDLR
    <a50>   DW_AT_decl_file   : 7
    <a51>   DW_AT_decl_line   : 231
    <a52>   DW_AT_decl_column : 17
    <a53>   DW_AT_type        : <0x658>
    <a57>   DW_AT_data_member_location: 8
 <2><a58>: Abbrev Number: 9 (DW_TAG_member)
    <a59>   DW_AT_name        : (indirect string, offset: 0xe18df): RDHR
    <a5d>   DW_AT_decl_file   : 7
    <a5e>   DW_AT_decl_line   : 232
    <a5f>   DW_AT_decl_column : 17
    <a60>   DW_AT_type        : <0x658>
    <a64>   DW_AT_data_member_location: 12
 <2><a65>: Abbrev Number: 0
 <1><a66>: Abbrev Number: 3 (DW_TAG_typedef)
    <a67>   DW_AT_name        : (indirect string, offset: 0xe1bf5): CAN_FIFOMailBox_TypeDef
    <a6b>   DW_AT_decl_file   : 7
    <a6c>   DW_AT_decl_line   : 233
    <a6d>   DW_AT_decl_column : 3
    <a6e>   DW_AT_type        : <0xa28>
 <1><a72>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a73>   DW_AT_byte_size   : 8
    <a74>   DW_AT_decl_file   : 7
    <a75>   DW_AT_decl_line   : 239
    <a76>   DW_AT_decl_column : 9
    <a77>   DW_AT_sibling     : <0xa96>
 <2><a7b>: Abbrev Number: 8 (DW_TAG_member)
    <a7c>   DW_AT_name        : FR1
    <a80>   DW_AT_decl_file   : 7
    <a81>   DW_AT_decl_line   : 241
    <a82>   DW_AT_decl_column : 17
    <a83>   DW_AT_type        : <0x658>
    <a87>   DW_AT_data_member_location: 0
 <2><a88>: Abbrev Number: 8 (DW_TAG_member)
    <a89>   DW_AT_name        : FR2
    <a8d>   DW_AT_decl_file   : 7
    <a8e>   DW_AT_decl_line   : 242
    <a8f>   DW_AT_decl_column : 17
    <a90>   DW_AT_type        : <0x658>
    <a94>   DW_AT_data_member_location: 4
 <2><a95>: Abbrev Number: 0
 <1><a96>: Abbrev Number: 3 (DW_TAG_typedef)
    <a97>   DW_AT_name        : (indirect string, offset: 0xe222c): CAN_FilterRegister_TypeDef
    <a9b>   DW_AT_decl_file   : 7
    <a9c>   DW_AT_decl_line   : 243
    <a9d>   DW_AT_decl_column : 3
    <a9e>   DW_AT_type        : <0xa72>
 <1><aa2>: Abbrev Number: 24 (DW_TAG_structure_type)
    <aa3>   DW_AT_byte_size   : 800
    <aa5>   DW_AT_decl_file   : 7
    <aa6>   DW_AT_decl_line   : 249
    <aa7>   DW_AT_decl_column : 9
    <aa8>   DW_AT_sibling     : <0xbe9>
 <2><aac>: Abbrev Number: 8 (DW_TAG_member)
    <aad>   DW_AT_name        : MCR
    <ab1>   DW_AT_decl_file   : 7
    <ab2>   DW_AT_decl_line   : 251
    <ab3>   DW_AT_decl_column : 30
    <ab4>   DW_AT_type        : <0x658>
    <ab8>   DW_AT_data_member_location: 0
 <2><ab9>: Abbrev Number: 8 (DW_TAG_member)
    <aba>   DW_AT_name        : MSR
    <abe>   DW_AT_decl_file   : 7
    <abf>   DW_AT_decl_line   : 252
    <ac0>   DW_AT_decl_column : 30
    <ac1>   DW_AT_type        : <0x658>
    <ac5>   DW_AT_data_member_location: 4
 <2><ac6>: Abbrev Number: 8 (DW_TAG_member)
    <ac7>   DW_AT_name        : TSR
    <acb>   DW_AT_decl_file   : 7
    <acc>   DW_AT_decl_line   : 253
    <acd>   DW_AT_decl_column : 30
    <ace>   DW_AT_type        : <0x658>
    <ad2>   DW_AT_data_member_location: 8
 <2><ad3>: Abbrev Number: 9 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xe1eaa): RF0R
    <ad8>   DW_AT_decl_file   : 7
    <ad9>   DW_AT_decl_line   : 254
    <ada>   DW_AT_decl_column : 30
    <adb>   DW_AT_type        : <0x658>
    <adf>   DW_AT_data_member_location: 12
 <2><ae0>: Abbrev Number: 9 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0xe1eaf): RF1R
    <ae5>   DW_AT_decl_file   : 7
    <ae6>   DW_AT_decl_line   : 255
    <ae7>   DW_AT_decl_column : 30
    <ae8>   DW_AT_type        : <0x658>
    <aec>   DW_AT_data_member_location: 16
 <2><aed>: Abbrev Number: 25 (DW_TAG_member)
    <aee>   DW_AT_name        : IER
    <af2>   DW_AT_decl_file   : 7
    <af3>   DW_AT_decl_line   : 256
    <af5>   DW_AT_decl_column : 30
    <af6>   DW_AT_type        : <0x658>
    <afa>   DW_AT_data_member_location: 20
 <2><afb>: Abbrev Number: 25 (DW_TAG_member)
    <afc>   DW_AT_name        : ESR
    <b00>   DW_AT_decl_file   : 7
    <b01>   DW_AT_decl_line   : 257
    <b03>   DW_AT_decl_column : 30
    <b04>   DW_AT_type        : <0x658>
    <b08>   DW_AT_data_member_location: 24
 <2><b09>: Abbrev Number: 25 (DW_TAG_member)
    <b0a>   DW_AT_name        : BTR
    <b0e>   DW_AT_decl_file   : 7
    <b0f>   DW_AT_decl_line   : 258
    <b11>   DW_AT_decl_column : 30
    <b12>   DW_AT_type        : <0x658>
    <b16>   DW_AT_data_member_location: 28
 <2><b17>: Abbrev Number: 21 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0xe2f3a): RESERVED0
    <b1c>   DW_AT_decl_file   : 7
    <b1d>   DW_AT_decl_line   : 259
    <b1f>   DW_AT_decl_column : 30
    <b20>   DW_AT_type        : <0xbe9>
    <b24>   DW_AT_data_member_location: 32
 <2><b25>: Abbrev Number: 26 (DW_TAG_member)
    <b26>   DW_AT_name        : (indirect string, offset: 0xe1f8a): sTxMailBox
    <b2a>   DW_AT_decl_file   : 7
    <b2b>   DW_AT_decl_line   : 260
    <b2d>   DW_AT_decl_column : 30
    <b2e>   DW_AT_type        : <0xbf9>
    <b32>   DW_AT_data_member_location: 384
 <2><b34>: Abbrev Number: 26 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0xe1c0d): sFIFOMailBox
    <b39>   DW_AT_decl_file   : 7
    <b3a>   DW_AT_decl_line   : 261
    <b3c>   DW_AT_decl_column : 30
    <b3d>   DW_AT_type        : <0xc09>
    <b41>   DW_AT_data_member_location: 432
 <2><b43>: Abbrev Number: 26 (DW_TAG_member)
    <b44>   DW_AT_name        : (indirect string, offset: 0xe2f44): RESERVED1
    <b48>   DW_AT_decl_file   : 7
    <b49>   DW_AT_decl_line   : 262
    <b4b>   DW_AT_decl_column : 30
    <b4c>   DW_AT_type        : <0xc19>
    <b50>   DW_AT_data_member_location: 464
 <2><b52>: Abbrev Number: 27 (DW_TAG_member)
    <b53>   DW_AT_name        : FMR
    <b57>   DW_AT_decl_file   : 7
    <b58>   DW_AT_decl_line   : 263
    <b5a>   DW_AT_decl_column : 30
    <b5b>   DW_AT_type        : <0x658>
    <b5f>   DW_AT_data_member_location: 512
 <2><b61>: Abbrev Number: 26 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0xe17e4): FM1R
    <b66>   DW_AT_decl_file   : 7
    <b67>   DW_AT_decl_line   : 264
    <b69>   DW_AT_decl_column : 30
    <b6a>   DW_AT_type        : <0x658>
    <b6e>   DW_AT_data_member_location: 516
 <2><b70>: Abbrev Number: 26 (DW_TAG_member)
    <b71>   DW_AT_name        : (indirect string, offset: 0xe2f4e): RESERVED2
    <b75>   DW_AT_decl_file   : 7
    <b76>   DW_AT_decl_line   : 265
    <b78>   DW_AT_decl_column : 30
    <b79>   DW_AT_type        : <0x64c>
    <b7d>   DW_AT_data_member_location: 520
 <2><b7f>: Abbrev Number: 26 (DW_TAG_member)
    <b80>   DW_AT_name        : (indirect string, offset: 0xe2dc8): FS1R
    <b84>   DW_AT_decl_file   : 7
    <b85>   DW_AT_decl_line   : 266
    <b87>   DW_AT_decl_column : 30
    <b88>   DW_AT_type        : <0x658>
    <b8c>   DW_AT_data_member_location: 524
 <2><b8e>: Abbrev Number: 26 (DW_TAG_member)
    <b8f>   DW_AT_name        : (indirect string, offset: 0xe2f58): RESERVED3
    <b93>   DW_AT_decl_file   : 7
    <b94>   DW_AT_decl_line   : 267
    <b96>   DW_AT_decl_column : 30
    <b97>   DW_AT_type        : <0x64c>
    <b9b>   DW_AT_data_member_location: 528
 <2><b9d>: Abbrev Number: 26 (DW_TAG_member)
    <b9e>   DW_AT_name        : (indirect string, offset: 0xe2764): FFA1R
    <ba2>   DW_AT_decl_file   : 7
    <ba3>   DW_AT_decl_line   : 268
    <ba5>   DW_AT_decl_column : 30
    <ba6>   DW_AT_type        : <0x658>
    <baa>   DW_AT_data_member_location: 532
 <2><bac>: Abbrev Number: 26 (DW_TAG_member)
    <bad>   DW_AT_name        : (indirect string, offset: 0xe24d3): RESERVED4
    <bb1>   DW_AT_decl_file   : 7
    <bb2>   DW_AT_decl_line   : 269
    <bb4>   DW_AT_decl_column : 30
    <bb5>   DW_AT_type        : <0x64c>
    <bb9>   DW_AT_data_member_location: 536
 <2><bbb>: Abbrev Number: 26 (DW_TAG_member)
    <bbc>   DW_AT_name        : (indirect string, offset: 0xe2765): FA1R
    <bc0>   DW_AT_decl_file   : 7
    <bc1>   DW_AT_decl_line   : 270
    <bc3>   DW_AT_decl_column : 30
    <bc4>   DW_AT_type        : <0x658>
    <bc8>   DW_AT_data_member_location: 540
 <2><bca>: Abbrev Number: 26 (DW_TAG_member)
    <bcb>   DW_AT_name        : (indirect string, offset: 0xe2f62): RESERVED5
    <bcf>   DW_AT_decl_file   : 7
    <bd0>   DW_AT_decl_line   : 271
    <bd2>   DW_AT_decl_column : 30
    <bd3>   DW_AT_type        : <0x9ce>
    <bd7>   DW_AT_data_member_location: 544
 <2><bd9>: Abbrev Number: 26 (DW_TAG_member)
    <bda>   DW_AT_name        : (indirect string, offset: 0xe24b5): sFilterRegister
    <bde>   DW_AT_decl_file   : 7
    <bdf>   DW_AT_decl_line   : 272
    <be1>   DW_AT_decl_column : 30
    <be2>   DW_AT_type        : <0xc29>
    <be6>   DW_AT_data_member_location: 576
 <2><be8>: Abbrev Number: 0
 <1><be9>: Abbrev Number: 10 (DW_TAG_array_type)
    <bea>   DW_AT_type        : <0x64c>
    <bee>   DW_AT_sibling     : <0xbf9>
 <2><bf2>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <bf3>   DW_AT_type        : <0x62f>
    <bf7>   DW_AT_upper_bound : 87
 <2><bf8>: Abbrev Number: 0
 <1><bf9>: Abbrev Number: 10 (DW_TAG_array_type)
    <bfa>   DW_AT_type        : <0xa1c>
    <bfe>   DW_AT_sibling     : <0xc09>
 <2><c02>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <c03>   DW_AT_type        : <0x62f>
    <c07>   DW_AT_upper_bound : 2
 <2><c08>: Abbrev Number: 0
 <1><c09>: Abbrev Number: 10 (DW_TAG_array_type)
    <c0a>   DW_AT_type        : <0xa66>
    <c0e>   DW_AT_sibling     : <0xc19>
 <2><c12>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <c13>   DW_AT_type        : <0x62f>
    <c17>   DW_AT_upper_bound : 1
 <2><c18>: Abbrev Number: 0
 <1><c19>: Abbrev Number: 10 (DW_TAG_array_type)
    <c1a>   DW_AT_type        : <0x64c>
    <c1e>   DW_AT_sibling     : <0xc29>
 <2><c22>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <c23>   DW_AT_type        : <0x62f>
    <c27>   DW_AT_upper_bound : 11
 <2><c28>: Abbrev Number: 0
 <1><c29>: Abbrev Number: 10 (DW_TAG_array_type)
    <c2a>   DW_AT_type        : <0xa96>
    <c2e>   DW_AT_sibling     : <0xc39>
 <2><c32>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <c33>   DW_AT_type        : <0x62f>
    <c37>   DW_AT_upper_bound : 27
 <2><c38>: Abbrev Number: 0
 <1><c39>: Abbrev Number: 22 (DW_TAG_typedef)
    <c3a>   DW_AT_name        : (indirect string, offset: 0xe2da6): CAN_TypeDef
    <c3e>   DW_AT_decl_file   : 7
    <c3f>   DW_AT_decl_line   : 273
    <c41>   DW_AT_decl_column : 3
    <c42>   DW_AT_type        : <0xaa2>
 <1><c46>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <c47>   DW_AT_encoding    : 7	(unsigned)
    <c48>   DW_AT_byte_size   : 1
    <c49>   DW_AT_type        : <0x5eb>
    <c4d>   DW_AT_decl_file   : 8
    <c4e>   DW_AT_decl_line   : 192
    <c4f>   DW_AT_decl_column : 1
    <c50>   DW_AT_sibling     : <0xc61>
 <2><c54>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c55>   DW_AT_name        : (indirect string, offset: 0x2d08a): DISABLE
    <c59>   DW_AT_const_value : 0
 <2><c5a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c5b>   DW_AT_name        : (indirect string, offset: 0x33d4e): ENABLE
    <c5f>   DW_AT_const_value : 1
 <2><c60>: Abbrev Number: 0
 <1><c61>: Abbrev Number: 3 (DW_TAG_typedef)
    <c62>   DW_AT_name        : (indirect string, offset: 0xe2c22): FunctionalState
    <c66>   DW_AT_decl_file   : 8
    <c67>   DW_AT_decl_line   : 195
    <c68>   DW_AT_decl_column : 3
    <c69>   DW_AT_type        : <0xc46>
 <1><c6d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <c6e>   DW_AT_encoding    : 7	(unsigned)
    <c6f>   DW_AT_byte_size   : 1
    <c70>   DW_AT_type        : <0x5eb>
    <c74>   DW_AT_decl_file   : 9
    <c75>   DW_AT_decl_line   : 39
    <c76>   DW_AT_decl_column : 1
    <c77>   DW_AT_sibling     : <0xc94>
 <2><c7b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c7c>   DW_AT_name        : (indirect string, offset: 0xe1ed1): HAL_OK
    <c80>   DW_AT_const_value : 0
 <2><c81>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c82>   DW_AT_name        : (indirect string, offset: 0xe25d9): HAL_ERROR
    <c86>   DW_AT_const_value : 1
 <2><c87>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c88>   DW_AT_name        : (indirect string, offset: 0xe1aab): HAL_BUSY
    <c8c>   DW_AT_const_value : 2
 <2><c8d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c8e>   DW_AT_name        : (indirect string, offset: 0xe1df6): HAL_TIMEOUT
    <c92>   DW_AT_const_value : 3
 <2><c93>: Abbrev Number: 0
 <1><c94>: Abbrev Number: 3 (DW_TAG_typedef)
    <c95>   DW_AT_name        : (indirect string, offset: 0xe16f4): HAL_StatusTypeDef
    <c99>   DW_AT_decl_file   : 9
    <c9a>   DW_AT_decl_line   : 44
    <c9b>   DW_AT_decl_column : 3
    <c9c>   DW_AT_type        : <0xc6d>
 <1><ca0>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <ca1>   DW_AT_encoding    : 7	(unsigned)
    <ca2>   DW_AT_byte_size   : 1
    <ca3>   DW_AT_type        : <0x5eb>
    <ca7>   DW_AT_decl_file   : 10
    <ca8>   DW_AT_decl_line   : 47
    <ca9>   DW_AT_decl_column : 1
    <caa>   DW_AT_sibling     : <0xcd3>
 <2><cae>: Abbrev Number: 17 (DW_TAG_enumerator)
    <caf>   DW_AT_name        : (indirect string, offset: 0xe276a): HAL_CAN_STATE_RESET
    <cb3>   DW_AT_const_value : 0
 <2><cb4>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cb5>   DW_AT_name        : (indirect string, offset: 0xe1b4f): HAL_CAN_STATE_READY
    <cb9>   DW_AT_const_value : 1
 <2><cba>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cbb>   DW_AT_name        : (indirect string, offset: 0xe239e): HAL_CAN_STATE_LISTENING
    <cbf>   DW_AT_const_value : 2
 <2><cc0>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cc1>   DW_AT_name        : (indirect string, offset: 0xe2dd6): HAL_CAN_STATE_SLEEP_PENDING
    <cc5>   DW_AT_const_value : 3
 <2><cc6>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cc7>   DW_AT_name        : (indirect string, offset: 0xe1776): HAL_CAN_STATE_SLEEP_ACTIVE
    <ccb>   DW_AT_const_value : 4
 <2><ccc>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ccd>   DW_AT_name        : (indirect string, offset: 0xe2a9e): HAL_CAN_STATE_ERROR
    <cd1>   DW_AT_const_value : 5
 <2><cd2>: Abbrev Number: 0
 <1><cd3>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd4>   DW_AT_name        : (indirect string, offset: 0xe2cbf): HAL_CAN_StateTypeDef
    <cd8>   DW_AT_decl_file   : 10
    <cd9>   DW_AT_decl_line   : 55
    <cda>   DW_AT_decl_column : 3
    <cdb>   DW_AT_type        : <0xca0>
 <1><cdf>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <ce0>   DW_AT_type        : <0xcd3>
 <1><ce4>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ce5>   DW_AT_byte_size   : 28
    <ce6>   DW_AT_decl_file   : 10
    <ce7>   DW_AT_decl_line   : 60
    <ce8>   DW_AT_decl_column : 9
    <ce9>   DW_AT_sibling     : <0xd7d>
 <2><ced>: Abbrev Number: 9 (DW_TAG_member)
    <cee>   DW_AT_name        : (indirect string, offset: 0xe48ae): Prescaler
    <cf2>   DW_AT_decl_file   : 10
    <cf3>   DW_AT_decl_line   : 62
    <cf4>   DW_AT_decl_column : 12
    <cf5>   DW_AT_type        : <0x64c>
    <cf9>   DW_AT_data_member_location: 0
 <2><cfa>: Abbrev Number: 9 (DW_TAG_member)
    <cfb>   DW_AT_name        : (indirect string, offset: 0xe67cf): Mode
    <cff>   DW_AT_decl_file   : 10
    <d00>   DW_AT_decl_line   : 65
    <d01>   DW_AT_decl_column : 12
    <d02>   DW_AT_type        : <0x64c>
    <d06>   DW_AT_data_member_location: 4
 <2><d07>: Abbrev Number: 9 (DW_TAG_member)
    <d08>   DW_AT_name        : (indirect string, offset: 0xe1958): SyncJumpWidth
    <d0c>   DW_AT_decl_file   : 10
    <d0d>   DW_AT_decl_line   : 68
    <d0e>   DW_AT_decl_column : 12
    <d0f>   DW_AT_type        : <0x64c>
    <d13>   DW_AT_data_member_location: 8
 <2><d14>: Abbrev Number: 9 (DW_TAG_member)
    <d15>   DW_AT_name        : (indirect string, offset: 0xe2152): TimeSeg1
    <d19>   DW_AT_decl_file   : 10
    <d1a>   DW_AT_decl_line   : 72
    <d1b>   DW_AT_decl_column : 12
    <d1c>   DW_AT_type        : <0x64c>
    <d20>   DW_AT_data_member_location: 12
 <2><d21>: Abbrev Number: 9 (DW_TAG_member)
    <d22>   DW_AT_name        : (indirect string, offset: 0xe215b): TimeSeg2
    <d26>   DW_AT_decl_file   : 10
    <d27>   DW_AT_decl_line   : 75
    <d28>   DW_AT_decl_column : 12
    <d29>   DW_AT_type        : <0x64c>
    <d2d>   DW_AT_data_member_location: 16
 <2><d2e>: Abbrev Number: 9 (DW_TAG_member)
    <d2f>   DW_AT_name        : (indirect string, offset: 0xe187b): TimeTriggeredMode
    <d33>   DW_AT_decl_file   : 10
    <d34>   DW_AT_decl_line   : 78
    <d35>   DW_AT_decl_column : 19
    <d36>   DW_AT_type        : <0xc61>
    <d3a>   DW_AT_data_member_location: 20
 <2><d3b>: Abbrev Number: 9 (DW_TAG_member)
    <d3c>   DW_AT_name        : (indirect string, offset: 0xe28b4): AutoBusOff
    <d40>   DW_AT_decl_file   : 10
    <d41>   DW_AT_decl_line   : 81
    <d42>   DW_AT_decl_column : 19
    <d43>   DW_AT_type        : <0xc61>
    <d47>   DW_AT_data_member_location: 21
 <2><d48>: Abbrev Number: 9 (DW_TAG_member)
    <d49>   DW_AT_name        : (indirect string, offset: 0xe1eb4): AutoWakeUp
    <d4d>   DW_AT_decl_file   : 10
    <d4e>   DW_AT_decl_line   : 84
    <d4f>   DW_AT_decl_column : 19
    <d50>   DW_AT_type        : <0xc61>
    <d54>   DW_AT_data_member_location: 22
 <2><d55>: Abbrev Number: 9 (DW_TAG_member)
    <d56>   DW_AT_name        : (indirect string, offset: 0xe30d7): AutoRetransmission
    <d5a>   DW_AT_decl_file   : 10
    <d5b>   DW_AT_decl_line   : 87
    <d5c>   DW_AT_decl_column : 19
    <d5d>   DW_AT_type        : <0xc61>
    <d61>   DW_AT_data_member_location: 23
 <2><d62>: Abbrev Number: 9 (DW_TAG_member)
    <d63>   DW_AT_name        : (indirect string, offset: 0xe1ebf): ReceiveFifoLocked
    <d67>   DW_AT_decl_file   : 10
    <d68>   DW_AT_decl_line   : 90
    <d69>   DW_AT_decl_column : 19
    <d6a>   DW_AT_type        : <0xc61>
    <d6e>   DW_AT_data_member_location: 24
 <2><d6f>: Abbrev Number: 9 (DW_TAG_member)
    <d70>   DW_AT_name        : (indirect string, offset: 0xe2a4f): TransmitFifoPriority
    <d74>   DW_AT_decl_file   : 10
    <d75>   DW_AT_decl_line   : 93
    <d76>   DW_AT_decl_column : 19
    <d77>   DW_AT_type        : <0xc61>
    <d7b>   DW_AT_data_member_location: 25
 <2><d7c>: Abbrev Number: 0
 <1><d7d>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7e>   DW_AT_name        : (indirect string, offset: 0xe1ad0): CAN_InitTypeDef
    <d82>   DW_AT_decl_file   : 10
    <d83>   DW_AT_decl_line   : 96
    <d84>   DW_AT_decl_column : 3
    <d85>   DW_AT_type        : <0xce4>
 <1><d89>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d8a>   DW_AT_byte_size   : 40
    <d8b>   DW_AT_decl_file   : 10
    <d8c>   DW_AT_decl_line   : 101
    <d8d>   DW_AT_decl_column : 9
    <d8e>   DW_AT_sibling     : <0xe15>
 <2><d92>: Abbrev Number: 9 (DW_TAG_member)
    <d93>   DW_AT_name        : (indirect string, offset: 0xe1bc1): FilterIdHigh
    <d97>   DW_AT_decl_file   : 10
    <d98>   DW_AT_decl_line   : 103
    <d99>   DW_AT_decl_column : 12
    <d9a>   DW_AT_type        : <0x64c>
    <d9e>   DW_AT_data_member_location: 0
 <2><d9f>: Abbrev Number: 9 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0xe2ad0): FilterIdLow
    <da4>   DW_AT_decl_file   : 10
    <da5>   DW_AT_decl_line   : 108
    <da6>   DW_AT_decl_column : 12
    <da7>   DW_AT_type        : <0x64c>
    <dab>   DW_AT_data_member_location: 4
 <2><dac>: Abbrev Number: 9 (DW_TAG_member)
    <dad>   DW_AT_name        : (indirect string, offset: 0xe1bb0): FilterMaskIdHigh
    <db1>   DW_AT_decl_file   : 10
    <db2>   DW_AT_decl_line   : 113
    <db3>   DW_AT_decl_column : 12
    <db4>   DW_AT_type        : <0x64c>
    <db8>   DW_AT_data_member_location: 8
 <2><db9>: Abbrev Number: 9 (DW_TAG_member)
    <dba>   DW_AT_name        : (indirect string, offset: 0xe2f0f): FilterMaskIdLow
    <dbe>   DW_AT_decl_file   : 10
    <dbf>   DW_AT_decl_line   : 119
    <dc0>   DW_AT_decl_column : 12
    <dc1>   DW_AT_type        : <0x64c>
    <dc5>   DW_AT_data_member_location: 12
 <2><dc6>: Abbrev Number: 9 (DW_TAG_member)
    <dc7>   DW_AT_name        : (indirect string, offset: 0xe2f83): FilterFIFOAssignment
    <dcb>   DW_AT_decl_file   : 10
    <dcc>   DW_AT_decl_line   : 125
    <dcd>   DW_AT_decl_column : 12
    <dce>   DW_AT_type        : <0x64c>
    <dd2>   DW_AT_data_member_location: 16
 <2><dd3>: Abbrev Number: 9 (DW_TAG_member)
    <dd4>   DW_AT_name        : (indirect string, offset: 0xe2a80): FilterBank
    <dd8>   DW_AT_decl_file   : 10
    <dd9>   DW_AT_decl_line   : 128
    <dda>   DW_AT_decl_column : 12
    <ddb>   DW_AT_type        : <0x64c>
    <ddf>   DW_AT_data_member_location: 20
 <2><de0>: Abbrev Number: 9 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0xe209e): FilterMode
    <de5>   DW_AT_decl_file   : 10
    <de6>   DW_AT_decl_line   : 134
    <de7>   DW_AT_decl_column : 12
    <de8>   DW_AT_type        : <0x64c>
    <dec>   DW_AT_data_member_location: 24
 <2><ded>: Abbrev Number: 9 (DW_TAG_member)
    <dee>   DW_AT_name        : (indirect string, offset: 0xe2eac): FilterScale
    <df2>   DW_AT_decl_file   : 10
    <df3>   DW_AT_decl_line   : 137
    <df4>   DW_AT_decl_column : 12
    <df5>   DW_AT_type        : <0x64c>
    <df9>   DW_AT_data_member_location: 28
 <2><dfa>: Abbrev Number: 9 (DW_TAG_member)
    <dfb>   DW_AT_name        : (indirect string, offset: 0xe18a3): FilterActivation
    <dff>   DW_AT_decl_file   : 10
    <e00>   DW_AT_decl_line   : 140
    <e01>   DW_AT_decl_column : 12
    <e02>   DW_AT_type        : <0x64c>
    <e06>   DW_AT_data_member_location: 32
 <2><e07>: Abbrev Number: 9 (DW_TAG_member)
    <e08>   DW_AT_name        : (indirect string, offset: 0xe2a76): SlaveStartFilterBank
    <e0c>   DW_AT_decl_file   : 10
    <e0d>   DW_AT_decl_line   : 143
    <e0e>   DW_AT_decl_column : 12
    <e0f>   DW_AT_type        : <0x64c>
    <e13>   DW_AT_data_member_location: 36
 <2><e14>: Abbrev Number: 0
 <1><e15>: Abbrev Number: 3 (DW_TAG_typedef)
    <e16>   DW_AT_name        : (indirect string, offset: 0xe2e9a): CAN_FilterTypeDef
    <e1a>   DW_AT_decl_file   : 10
    <e1b>   DW_AT_decl_line   : 150
    <e1c>   DW_AT_decl_column : 3
    <e1d>   DW_AT_type        : <0xd89>
 <1><e21>: Abbrev Number: 6 (DW_TAG_const_type)
    <e22>   DW_AT_type        : <0xe15>
 <1><e26>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e27>   DW_AT_byte_size   : 24
    <e28>   DW_AT_decl_file   : 10
    <e29>   DW_AT_decl_line   : 155
    <e2a>   DW_AT_decl_column : 9
    <e2b>   DW_AT_sibling     : <0xe7e>
 <2><e2f>: Abbrev Number: 9 (DW_TAG_member)
    <e30>   DW_AT_name        : (indirect string, offset: 0x23943): StdId
    <e34>   DW_AT_decl_file   : 10
    <e35>   DW_AT_decl_line   : 157
    <e36>   DW_AT_decl_column : 12
    <e37>   DW_AT_type        : <0x64c>
    <e3b>   DW_AT_data_member_location: 0
 <2><e3c>: Abbrev Number: 9 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x81706): ExtId
    <e41>   DW_AT_decl_file   : 10
    <e42>   DW_AT_decl_line   : 160
    <e43>   DW_AT_decl_column : 12
    <e44>   DW_AT_type        : <0x64c>
    <e48>   DW_AT_data_member_location: 4
 <2><e49>: Abbrev Number: 8 (DW_TAG_member)
    <e4a>   DW_AT_name        : IDE
    <e4e>   DW_AT_decl_file   : 10
    <e4f>   DW_AT_decl_line   : 163
    <e50>   DW_AT_decl_column : 12
    <e51>   DW_AT_type        : <0x64c>
    <e55>   DW_AT_data_member_location: 8
 <2><e56>: Abbrev Number: 8 (DW_TAG_member)
    <e57>   DW_AT_name        : RTR
    <e5b>   DW_AT_decl_file   : 10
    <e5c>   DW_AT_decl_line   : 166
    <e5d>   DW_AT_decl_column : 12
    <e5e>   DW_AT_type        : <0x64c>
    <e62>   DW_AT_data_member_location: 12
 <2><e63>: Abbrev Number: 8 (DW_TAG_member)
    <e64>   DW_AT_name        : DLC
    <e68>   DW_AT_decl_file   : 10
    <e69>   DW_AT_decl_line   : 169
    <e6a>   DW_AT_decl_column : 12
    <e6b>   DW_AT_type        : <0x64c>
    <e6f>   DW_AT_data_member_location: 16
 <2><e70>: Abbrev Number: 9 (DW_TAG_member)
    <e71>   DW_AT_name        : (indirect string, offset: 0xe2bcf): TransmitGlobalTime
    <e75>   DW_AT_decl_file   : 10
    <e76>   DW_AT_decl_line   : 172
    <e77>   DW_AT_decl_column : 19
    <e78>   DW_AT_type        : <0xc61>
    <e7c>   DW_AT_data_member_location: 20
 <2><e7d>: Abbrev Number: 0
 <1><e7e>: Abbrev Number: 3 (DW_TAG_typedef)
    <e7f>   DW_AT_name        : (indirect string, offset: 0xe1cf6): CAN_TxHeaderTypeDef
    <e83>   DW_AT_decl_file   : 10
    <e84>   DW_AT_decl_line   : 178
    <e85>   DW_AT_decl_column : 3
    <e86>   DW_AT_type        : <0xe26>
 <1><e8a>: Abbrev Number: 6 (DW_TAG_const_type)
    <e8b>   DW_AT_type        : <0xe7e>
 <1><e8f>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e90>   DW_AT_byte_size   : 28
    <e91>   DW_AT_decl_file   : 10
    <e92>   DW_AT_decl_line   : 183
    <e93>   DW_AT_decl_column : 9
    <e94>   DW_AT_sibling     : <0xef4>
 <2><e98>: Abbrev Number: 9 (DW_TAG_member)
    <e99>   DW_AT_name        : (indirect string, offset: 0x23943): StdId
    <e9d>   DW_AT_decl_file   : 10
    <e9e>   DW_AT_decl_line   : 185
    <e9f>   DW_AT_decl_column : 12
    <ea0>   DW_AT_type        : <0x64c>
    <ea4>   DW_AT_data_member_location: 0
 <2><ea5>: Abbrev Number: 9 (DW_TAG_member)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x81706): ExtId
    <eaa>   DW_AT_decl_file   : 10
    <eab>   DW_AT_decl_line   : 188
    <eac>   DW_AT_decl_column : 12
    <ead>   DW_AT_type        : <0x64c>
    <eb1>   DW_AT_data_member_location: 4
 <2><eb2>: Abbrev Number: 8 (DW_TAG_member)
    <eb3>   DW_AT_name        : IDE
    <eb7>   DW_AT_decl_file   : 10
    <eb8>   DW_AT_decl_line   : 191
    <eb9>   DW_AT_decl_column : 12
    <eba>   DW_AT_type        : <0x64c>
    <ebe>   DW_AT_data_member_location: 8
 <2><ebf>: Abbrev Number: 8 (DW_TAG_member)
    <ec0>   DW_AT_name        : RTR
    <ec4>   DW_AT_decl_file   : 10
    <ec5>   DW_AT_decl_line   : 194
    <ec6>   DW_AT_decl_column : 12
    <ec7>   DW_AT_type        : <0x64c>
    <ecb>   DW_AT_data_member_location: 12
 <2><ecc>: Abbrev Number: 8 (DW_TAG_member)
    <ecd>   DW_AT_name        : DLC
    <ed1>   DW_AT_decl_file   : 10
    <ed2>   DW_AT_decl_line   : 197
    <ed3>   DW_AT_decl_column : 12
    <ed4>   DW_AT_type        : <0x64c>
    <ed8>   DW_AT_data_member_location: 16
 <2><ed9>: Abbrev Number: 9 (DW_TAG_member)
    <eda>   DW_AT_name        : (indirect string, offset: 0xe5fd4): Timestamp
    <ede>   DW_AT_decl_file   : 10
    <edf>   DW_AT_decl_line   : 200
    <ee0>   DW_AT_decl_column : 12
    <ee1>   DW_AT_type        : <0x64c>
    <ee5>   DW_AT_data_member_location: 20
 <2><ee6>: Abbrev Number: 9 (DW_TAG_member)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x1e495): FilterMatchIndex
    <eeb>   DW_AT_decl_file   : 10
    <eec>   DW_AT_decl_line   : 204
    <eed>   DW_AT_decl_column : 12
    <eee>   DW_AT_type        : <0x64c>
    <ef2>   DW_AT_data_member_location: 24
 <2><ef3>: Abbrev Number: 0
 <1><ef4>: Abbrev Number: 3 (DW_TAG_typedef)
    <ef5>   DW_AT_name        : (indirect string, offset: 0xa7671): CAN_RxHeaderTypeDef
    <ef9>   DW_AT_decl_file   : 10
    <efa>   DW_AT_decl_line   : 207
    <efb>   DW_AT_decl_column : 3
    <efc>   DW_AT_type        : <0xe8f>
 <1><f00>: Abbrev Number: 28 (DW_TAG_structure_type)
    <f01>   DW_AT_name        : (indirect string, offset: 0xe2318): __CAN_HandleTypeDef
    <f05>   DW_AT_byte_size   : 40
    <f06>   DW_AT_decl_file   : 10
    <f07>   DW_AT_decl_line   : 212
    <f08>   DW_AT_decl_column : 16
    <f09>   DW_AT_sibling     : <0xf42>
 <2><f0d>: Abbrev Number: 9 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0xe2b86): Instance
    <f12>   DW_AT_decl_file   : 10
    <f13>   DW_AT_decl_line   : 214
    <f14>   DW_AT_decl_column : 32
    <f15>   DW_AT_type        : <0xf42>
    <f19>   DW_AT_data_member_location: 0
 <2><f1a>: Abbrev Number: 9 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0xe70d1): Init
    <f1f>   DW_AT_decl_file   : 10
    <f20>   DW_AT_decl_line   : 216
    <f21>   DW_AT_decl_column : 31
    <f22>   DW_AT_type        : <0xd7d>
    <f26>   DW_AT_data_member_location: 4
 <2><f27>: Abbrev Number: 9 (DW_TAG_member)
    <f28>   DW_AT_name        : (indirect string, offset: 0xe3742): State
    <f2c>   DW_AT_decl_file   : 10
    <f2d>   DW_AT_decl_line   : 218
    <f2e>   DW_AT_decl_column : 31
    <f2f>   DW_AT_type        : <0xcdf>
    <f33>   DW_AT_data_member_location: 32
 <2><f34>: Abbrev Number: 9 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0xe30a7): ErrorCode
    <f39>   DW_AT_decl_file   : 10
    <f3a>   DW_AT_decl_line   : 220
    <f3b>   DW_AT_decl_column : 31
    <f3c>   DW_AT_type        : <0x658>
    <f40>   DW_AT_data_member_location: 36
 <2><f41>: Abbrev Number: 0
 <1><f42>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <f43>   DW_AT_byte_size   : 4
    <f44>   DW_AT_type        : <0xc39>
 <1><f48>: Abbrev Number: 3 (DW_TAG_typedef)
    <f49>   DW_AT_name        : (indirect string, offset: 0xe231a): CAN_HandleTypeDef
    <f4d>   DW_AT_decl_file   : 10
    <f4e>   DW_AT_decl_line   : 242
    <f4f>   DW_AT_decl_column : 3
    <f50>   DW_AT_type        : <0xf00>
 <1><f54>: Abbrev Number: 6 (DW_TAG_const_type)
    <f55>   DW_AT_type        : <0xf48>
 <1><f59>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <f5a>   DW_AT_byte_size   : 4
    <f5b>   DW_AT_type        : <0x647>
 <1><f5f>: Abbrev Number: 29 (DW_TAG_variable)
    <f60>   DW_AT_name        : (indirect string, offset: 0xe172b): can_tx_task_delay
    <f64>   DW_AT_decl_file   : 11
    <f65>   DW_AT_decl_line   : 19
    <f66>   DW_AT_decl_column : 23
    <f67>   DW_AT_type        : <0x65d>
    <f6b>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><f71>: Abbrev Number: 29 (DW_TAG_variable)
    <f72>   DW_AT_name        : (indirect string, offset: 0xe1f0f): can_rx_task_delay
    <f76>   DW_AT_decl_file   : 11
    <f77>   DW_AT_decl_line   : 21
    <f78>   DW_AT_decl_column : 23
    <f79>   DW_AT_type        : <0x65d>
    <f7d>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><f83>: Abbrev Number: 23 (DW_TAG_variable)
    <f84>   DW_AT_name        : (indirect string, offset: 0xe2063): hcan1
    <f88>   DW_AT_decl_file   : 1
    <f89>   DW_AT_decl_line   : 18
    <f8a>   DW_AT_decl_column : 26
    <f8b>   DW_AT_type        : <0xf48>
    <f8f>   DW_AT_external    : 1
    <f8f>   DW_AT_declaration : 1
 <1><f8f>: Abbrev Number: 30 (DW_TAG_variable)
    <f90>   DW_AT_specification: <0x9b6>
    <f94>   DW_AT_decl_file   : 1
    <f95>   DW_AT_decl_line   : 21
    <f96>   DW_AT_decl_column : 20
    <f97>   DW_AT_location    : 5 byte block: 3 a4 0 0 20 	(DW_OP_addr: 200000a4)
 <1><f9d>: Abbrev Number: 30 (DW_TAG_variable)
    <f9e>   DW_AT_specification: <0x9c2>
    <fa2>   DW_AT_decl_file   : 1
    <fa3>   DW_AT_decl_line   : 22
    <fa4>   DW_AT_decl_column : 20
    <fa5>   DW_AT_location    : 5 byte block: 3 a8 0 0 20 	(DW_OP_addr: 200000a8)
 <1><fab>: Abbrev Number: 31 (DW_TAG_variable)
    <fac>   DW_AT_name        : (indirect string, offset: 0x84c6f): g_sendPing
    <fb0>   DW_AT_decl_file   : 1
    <fb1>   DW_AT_decl_line   : 24
    <fb2>   DW_AT_decl_column : 18
    <fb3>   DW_AT_type        : <0x642>
    <fb7>   DW_AT_external    : 1
    <fb7>   DW_AT_location    : 5 byte block: 3 ac 0 0 20 	(DW_OP_addr: 200000ac)
 <1><fbd>: Abbrev Number: 31 (DW_TAG_variable)
    <fbe>   DW_AT_name        : (indirect string, offset: 0xe18ca): canRxTask_attributes
    <fc2>   DW_AT_decl_file   : 1
    <fc3>   DW_AT_decl_line   : 26
    <fc4>   DW_AT_decl_column : 22
    <fc5>   DW_AT_type        : <0x940>
    <fc9>   DW_AT_external    : 1
    <fc9>   DW_AT_location    : 5 byte block: 3 e8 98 0 8 	(DW_OP_addr: 80098e8)
 <1><fcf>: Abbrev Number: 31 (DW_TAG_variable)
    <fd0>   DW_AT_name        : (indirect string, offset: 0xe1e63): canTxTask_attributes
    <fd4>   DW_AT_decl_file   : 1
    <fd5>   DW_AT_decl_line   : 32
    <fd6>   DW_AT_decl_column : 22
    <fd7>   DW_AT_type        : <0x940>
    <fdb>   DW_AT_external    : 1
    <fdb>   DW_AT_location    : 5 byte block: 3 c 99 0 8 	(DW_OP_addr: 800990c)
 <1><fe1>: Abbrev Number: 32 (DW_TAG_subprogram)
    <fe2>   DW_AT_external    : 1
    <fe2>   DW_AT_name        : (indirect string, offset: 0xe247c): osThreadNew
    <fe6>   DW_AT_decl_file   : 5
    <fe7>   DW_AT_decl_line   : 349
    <fe9>   DW_AT_decl_column : 14
    <fea>   DW_AT_prototyped  : 1
    <fea>   DW_AT_type        : <0x891>
    <fee>   DW_AT_declaration : 1
    <fee>   DW_AT_sibling     : <0x1002>
 <2><ff2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <ff3>   DW_AT_type        : <0x837>
 <2><ff7>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <ff8>   DW_AT_type        : <0x6c1>
 <2><ffc>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <ffd>   DW_AT_type        : <0x1002>
 <2><1001>: Abbrev Number: 0
 <1><1002>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1003>   DW_AT_byte_size   : 4
    <1004>   DW_AT_type        : <0x940>
 <1><1008>: Abbrev Number: 33 (DW_TAG_subprogram)
    <1009>   DW_AT_external    : 1
    <1009>   DW_AT_name        : (indirect string, offset: 0x61746): can_parse_msg
    <100d>   DW_AT_decl_file   : 12
    <100e>   DW_AT_decl_line   : 13
    <100f>   DW_AT_decl_column : 6
    <1010>   DW_AT_prototyped  : 1
    <1010>   DW_AT_declaration : 1
    <1010>   DW_AT_sibling     : <0x101f>
 <2><1014>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1015>   DW_AT_type        : <0x101f>
 <2><1019>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <101a>   DW_AT_type        : <0x6c3>
 <2><101e>: Abbrev Number: 0
 <1><101f>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1020>   DW_AT_byte_size   : 4
    <1021>   DW_AT_type        : <0xef4>
 <1><1025>: Abbrev Number: 32 (DW_TAG_subprogram)
    <1026>   DW_AT_external    : 1
    <1026>   DW_AT_name        : (indirect string, offset: 0xe1bce): HAL_CAN_GetRxMessage
    <102a>   DW_AT_decl_file   : 10
    <102b>   DW_AT_decl_line   : 690
    <102d>   DW_AT_decl_column : 19
    <102e>   DW_AT_prototyped  : 1
    <102e>   DW_AT_type        : <0xc94>
    <1032>   DW_AT_declaration : 1
    <1032>   DW_AT_sibling     : <0x104b>
 <2><1036>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1037>   DW_AT_type        : <0x104b>
 <2><103b>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <103c>   DW_AT_type        : <0x64c>
 <2><1040>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1041>   DW_AT_type        : <0x101f>
 <2><1045>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1046>   DW_AT_type        : <0x6c3>
 <2><104a>: Abbrev Number: 0
 <1><104b>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <104c>   DW_AT_byte_size   : 4
    <104d>   DW_AT_type        : <0xf48>
 <1><1051>: Abbrev Number: 32 (DW_TAG_subprogram)
    <1052>   DW_AT_external    : 1
    <1052>   DW_AT_name        : (indirect string, offset: 0xe1f95): HAL_CAN_GetRxFifoFillLevel
    <1056>   DW_AT_decl_file   : 10
    <1057>   DW_AT_decl_line   : 692
    <1059>   DW_AT_decl_column : 10
    <105a>   DW_AT_prototyped  : 1
    <105a>   DW_AT_type        : <0x64c>
    <105e>   DW_AT_declaration : 1
    <105e>   DW_AT_sibling     : <0x106d>
 <2><1062>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1063>   DW_AT_type        : <0x106d>
 <2><1067>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1068>   DW_AT_type        : <0x64c>
 <2><106c>: Abbrev Number: 0
 <1><106d>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <106e>   DW_AT_byte_size   : 4
    <106f>   DW_AT_type        : <0xf54>
 <1><1073>: Abbrev Number: 32 (DW_TAG_subprogram)
    <1074>   DW_AT_external    : 1
    <1074>   DW_AT_name        : (indirect string, offset: 0xe2183): osMessageQueueGet
    <1078>   DW_AT_decl_file   : 5
    <1079>   DW_AT_decl_line   : 697
    <107b>   DW_AT_decl_column : 12
    <107c>   DW_AT_prototyped  : 1
    <107c>   DW_AT_type        : <0x885>
    <1080>   DW_AT_declaration : 1
    <1080>   DW_AT_sibling     : <0x1099>
 <2><1084>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1085>   DW_AT_type        : <0x89d>
 <2><1089>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <108a>   DW_AT_type        : <0x6c1>
 <2><108e>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <108f>   DW_AT_type        : <0x6c3>
 <2><1093>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1094>   DW_AT_type        : <0x64c>
 <2><1098>: Abbrev Number: 0
 <1><1099>: Abbrev Number: 32 (DW_TAG_subprogram)
    <109a>   DW_AT_external    : 1
    <109a>   DW_AT_name        : (indirect string, offset: 0xe2909): HAL_CAN_AddTxMessage
    <109e>   DW_AT_decl_file   : 10
    <109f>   DW_AT_decl_line   : 684
    <10a1>   DW_AT_decl_column : 19
    <10a2>   DW_AT_prototyped  : 1
    <10a2>   DW_AT_type        : <0xc94>
    <10a6>   DW_AT_declaration : 1
    <10a6>   DW_AT_sibling     : <0x10bf>
 <2><10aa>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <10ab>   DW_AT_type        : <0x104b>
 <2><10af>: Abbrev Number: 14 (DW_TAG_formal_parameter)
