Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1ca (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x3030): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xb57): ../Core/Src/CAN/can_bus.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x18f8): /home/saveasmtz/Documents/embedded/stepper_boards_firmware/Debug
    <19>   DW_AT_stmt_list   : 0x0
    <1d>   DW_AT_GNU_macros  : 0x0
 <1><21>: Abbrev Number: 2 (DW_TAG_typedef)
    <22>   DW_AT_name        : (indirect string, offset: 0x24ef): __int8_t
    <26>   DW_AT_decl_file   : 1
    <27>   DW_AT_decl_line   : 41
    <28>   DW_AT_decl_column : 23
    <29>   DW_AT_type        : <0x2d>
 <1><2d>: Abbrev Number: 3 (DW_TAG_base_type)
    <2e>   DW_AT_byte_size   : 1
    <2f>   DW_AT_encoding    : 6	(signed char)
    <30>   DW_AT_name        : (indirect string, offset: 0x29e5): signed char
 <1><34>: Abbrev Number: 2 (DW_TAG_typedef)
    <35>   DW_AT_name        : (indirect string, offset: 0x2c50): __uint8_t
    <39>   DW_AT_decl_file   : 1
    <3a>   DW_AT_decl_line   : 43
    <3b>   DW_AT_decl_column : 24
    <3c>   DW_AT_type        : <0x40>
 <1><40>: Abbrev Number: 3 (DW_TAG_base_type)
    <41>   DW_AT_byte_size   : 1
    <42>   DW_AT_encoding    : 8	(unsigned char)
    <43>   DW_AT_name        : (indirect string, offset: 0x2bdf): unsigned char
 <1><47>: Abbrev Number: 3 (DW_TAG_base_type)
    <48>   DW_AT_byte_size   : 2
    <49>   DW_AT_encoding    : 5	(signed)
    <4a>   DW_AT_name        : (indirect string, offset: 0x763): short int
 <1><4e>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f>   DW_AT_name        : (indirect string, offset: 0x1143): __uint16_t
    <53>   DW_AT_decl_file   : 1
    <54>   DW_AT_decl_line   : 57
    <55>   DW_AT_decl_column : 25
    <56>   DW_AT_type        : <0x5a>
 <1><5a>: Abbrev Number: 3 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 2
    <5c>   DW_AT_encoding    : 7	(unsigned)
    <5d>   DW_AT_name        : (indirect string, offset: 0x604): short unsigned int
 <1><61>: Abbrev Number: 3 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : (indirect string, offset: 0x2868): long int
 <1><68>: Abbrev Number: 2 (DW_TAG_typedef)
    <69>   DW_AT_name        : (indirect string, offset: 0x323d): __uint32_t
    <6d>   DW_AT_decl_file   : 1
    <6e>   DW_AT_decl_line   : 79
    <6f>   DW_AT_decl_column : 25
    <70>   DW_AT_type        : <0x74>
 <1><74>: Abbrev Number: 3 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 4
    <76>   DW_AT_encoding    : 7	(unsigned)
    <77>   DW_AT_name        : (indirect string, offset: 0x2598): long unsigned int
 <1><7b>: Abbrev Number: 3 (DW_TAG_base_type)
    <7c>   DW_AT_byte_size   : 8
    <7d>   DW_AT_encoding    : 5	(signed)
    <7e>   DW_AT_name        : (indirect string, offset: 0x17ae): long long int
 <1><82>: Abbrev Number: 3 (DW_TAG_base_type)
    <83>   DW_AT_byte_size   : 8
    <84>   DW_AT_encoding    : 7	(unsigned)
    <85>   DW_AT_name        : (indirect string, offset: 0x36cb): long long unsigned int
 <1><89>: Abbrev Number: 4 (DW_TAG_base_type)
    <8a>   DW_AT_byte_size   : 4
    <8b>   DW_AT_encoding    : 5	(signed)
    <8c>   DW_AT_name        : int
 <1><90>: Abbrev Number: 3 (DW_TAG_base_type)
    <91>   DW_AT_byte_size   : 4
    <92>   DW_AT_encoding    : 7	(unsigned)
    <93>   DW_AT_name        : (indirect string, offset: 0x337c): unsigned int
 <1><97>: Abbrev Number: 2 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indirect string, offset: 0x24f1): int8_t
    <9c>   DW_AT_decl_file   : 2
    <9d>   DW_AT_decl_line   : 20
    <9e>   DW_AT_decl_column : 18
    <9f>   DW_AT_type        : <0x21>
 <1><a3>: Abbrev Number: 2 (DW_TAG_typedef)
    <a4>   DW_AT_name        : (indirect string, offset: 0x2c52): uint8_t
    <a8>   DW_AT_decl_file   : 2
    <a9>   DW_AT_decl_line   : 24
    <aa>   DW_AT_decl_column : 19
    <ab>   DW_AT_type        : <0x34>
 <1><af>: Abbrev Number: 2 (DW_TAG_typedef)
    <b0>   DW_AT_name        : (indirect string, offset: 0xa5761): uint16_t
    <b4>   DW_AT_decl_file   : 2
    <b5>   DW_AT_decl_line   : 36
    <b6>   DW_AT_decl_column : 20
    <b7>   DW_AT_type        : <0x4e>
 <1><bb>: Abbrev Number: 2 (DW_TAG_typedef)
    <bc>   DW_AT_name        : (indirect string, offset: 0xa364d): uint32_t
    <c0>   DW_AT_decl_file   : 2
    <c1>   DW_AT_decl_line   : 48
    <c2>   DW_AT_decl_column : 20
    <c3>   DW_AT_type        : <0x68>
 <1><c7>: Abbrev Number: 5 (DW_TAG_structure_type)
    <c8>   DW_AT_byte_size   : 20
    <c9>   DW_AT_decl_file   : 3
    <ca>   DW_AT_decl_line   : 42
    <cb>   DW_AT_decl_column : 9
    <cc>   DW_AT_sibling     : <0x11f>
 <2><d0>: Abbrev Number: 6 (DW_TAG_member)
    <d1>   DW_AT_name        : (indirect string, offset: 0x11fb): motor_1_steps
    <d5>   DW_AT_decl_file   : 3
    <d6>   DW_AT_decl_line   : 43
    <d7>   DW_AT_decl_column : 11
    <d8>   DW_AT_type        : <0xaf>
    <dc>   DW_AT_data_member_location: 0
 <2><dd>: Abbrev Number: 6 (DW_TAG_member)
    <de>   DW_AT_name        : (indirect string, offset: 0x1499): motor_2_steps
    <e2>   DW_AT_decl_file   : 3
    <e3>   DW_AT_decl_line   : 44
    <e4>   DW_AT_decl_column : 11
    <e5>   DW_AT_type        : <0xaf>
    <e9>   DW_AT_data_member_location: 2
 <2><ea>: Abbrev Number: 6 (DW_TAG_member)
    <eb>   DW_AT_name        : (indirect string, offset: 0x1a7d): motor_1_direction
    <ef>   DW_AT_decl_file   : 3
    <f0>   DW_AT_decl_line   : 45
    <f1>   DW_AT_decl_column : 9
    <f2>   DW_AT_type        : <0x97>
    <f6>   DW_AT_data_member_location: 4
 <2><f7>: Abbrev Number: 6 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x127d): motor_2_direction
    <fc>   DW_AT_decl_file   : 3
    <fd>   DW_AT_decl_line   : 46
    <fe>   DW_AT_decl_column : 9
    <ff>   DW_AT_type        : <0x97>
    <103>   DW_AT_data_member_location: 5
 <2><104>: Abbrev Number: 6 (DW_TAG_member)
    <105>   DW_AT_name        : (indirect string, offset: 0x19bd): encoderAngle
    <109>   DW_AT_decl_file   : 3
    <10a>   DW_AT_decl_line   : 47
    <10b>   DW_AT_decl_column : 8
    <10c>   DW_AT_type        : <0x11f>
    <110>   DW_AT_data_member_location: 8
 <2><111>: Abbrev Number: 6 (DW_TAG_member)
    <112>   DW_AT_name        : (indirect string, offset: 0x17d2): jetsonHBTick
    <116>   DW_AT_decl_file   : 3
    <117>   DW_AT_decl_line   : 48
    <118>   DW_AT_decl_column : 11
    <119>   DW_AT_type        : <0xbb>
    <11d>   DW_AT_data_member_location: 16
 <2><11e>: Abbrev Number: 0
 <1><11f>: Abbrev Number: 7 (DW_TAG_array_type)
    <120>   DW_AT_type        : <0x12f>
    <124>   DW_AT_sibling     : <0x12f>
 <2><128>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <129>   DW_AT_type        : <0x90>
    <12d>   DW_AT_upper_bound : 1
 <2><12e>: Abbrev Number: 0
 <1><12f>: Abbrev Number: 3 (DW_TAG_base_type)
    <130>   DW_AT_byte_size   : 4
    <131>   DW_AT_encoding    : 4	(float)
    <132>   DW_AT_name        : (indirect string, offset: 0x74d1): float
 <1><136>: Abbrev Number: 2 (DW_TAG_typedef)
    <137>   DW_AT_name        : (indirect string, offset: 0x172d): can_rx
    <13b>   DW_AT_decl_file   : 3
    <13c>   DW_AT_decl_line   : 49
    <13d>   DW_AT_decl_column : 3
    <13e>   DW_AT_type        : <0xc7>
 <1><142>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <143>   DW_AT_type        : <0x136>
 <1><147>: Abbrev Number: 5 (DW_TAG_structure_type)
    <148>   DW_AT_byte_size   : 40
    <149>   DW_AT_decl_file   : 3
    <14a>   DW_AT_decl_line   : 51
    <14b>   DW_AT_decl_column : 9
    <14c>   DW_AT_sibling     : <0x178>
 <2><150>: Abbrev Number: 6 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x2419): heartbeat
    <155>   DW_AT_decl_file   : 3
    <156>   DW_AT_decl_line   : 52
    <157>   DW_AT_decl_column : 11
    <158>   DW_AT_type        : <0xbb>
    <15c>   DW_AT_data_member_location: 0
 <2><15d>: Abbrev Number: 6 (DW_TAG_member)
    <15e>   DW_AT_name        : (indirect string, offset: 0x29b5): sbusData
    <162>   DW_AT_decl_file   : 3
    <163>   DW_AT_decl_line   : 53
    <164>   DW_AT_decl_column : 11
    <165>   DW_AT_type        : <0x178>
    <169>   DW_AT_data_member_location: 4
 <2><16a>: Abbrev Number: 6 (DW_TAG_member)
    <16b>   DW_AT_name        : (indirect string, offset: 0x148a): sbusIsFailsafe
    <16f>   DW_AT_decl_file   : 3
    <170>   DW_AT_decl_line   : 54
    <171>   DW_AT_decl_column : 10
    <172>   DW_AT_type        : <0xa3>
    <176>   DW_AT_data_member_location: 36
 <2><177>: Abbrev Number: 0
 <1><178>: Abbrev Number: 7 (DW_TAG_array_type)
    <179>   DW_AT_type        : <0xaf>
    <17d>   DW_AT_sibling     : <0x188>
 <2><181>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <182>   DW_AT_type        : <0x90>
    <186>   DW_AT_upper_bound : 15
 <2><187>: Abbrev Number: 0
 <1><188>: Abbrev Number: 2 (DW_TAG_typedef)
    <189>   DW_AT_name        : (indirect string, offset: 0x1ec4): can_tx
    <18d>   DW_AT_decl_file   : 3
    <18e>   DW_AT_decl_line   : 55
    <18f>   DW_AT_decl_column : 3
    <190>   DW_AT_type        : <0x147>
 <1><194>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <195>   DW_AT_type        : <0x188>
 <1><199>: Abbrev Number: 10 (DW_TAG_variable)
    <19a>   DW_AT_name        : (indirect string, offset: 0x28e9): can_rx_data
    <19e>   DW_AT_decl_file   : 3
    <19f>   DW_AT_decl_line   : 57
    <1a0>   DW_AT_decl_column : 24
    <1a1>   DW_AT_type        : <0x142>
    <1a5>   DW_AT_external    : 1
    <1a5>   DW_AT_declaration : 1
 <1><1a5>: Abbrev Number: 10 (DW_TAG_variable)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x3134): can_tx_data
    <1aa>   DW_AT_decl_file   : 3
    <1ab>   DW_AT_decl_line   : 58
    <1ac>   DW_AT_decl_column : 24
    <1ad>   DW_AT_type        : <0x194>
    <1b1>   DW_AT_external    : 1
    <1b1>   DW_AT_declaration : 1
 <1><1b1>: Abbrev Number: 11 (DW_TAG_variable)
    <1b2>   DW_AT_specification: <0x199>
    <1b6>   DW_AT_decl_file   : 4
    <1b7>   DW_AT_decl_line   : 14
    <1b8>   DW_AT_decl_column : 17
    <1b9>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><1bf>: Abbrev Number: 11 (DW_TAG_variable)
    <1c0>   DW_AT_specification: <0x1a5>
    <1c4>   DW_AT_decl_file   : 4
    <1c5>   DW_AT_decl_line   : 15
    <1c6>   DW_AT_decl_column : 17
    <1c7>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1cd>: Abbrev Number: 0
  Compilation Unit @ offset 0x1ce:
   Length:        0x395 (32-bit)
   Version:       4
   Abbrev Offset: 0x93
   Pointer Size:  4
 <0><1d9>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <1da>   DW_AT_producer    : (indirect string, offset: 0x3030): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <1de>   DW_AT_language    : 12	(ANSI C99)
    <1df>   DW_AT_name        : (indirect string, offset: 0x4c45c): ../Core/Src/CAN/can_bus_parser.c
    <1e3>   DW_AT_comp_dir    : (indirect string, offset: 0x18f8): /home/saveasmtz/Documents/embedded/stepper_boards_firmware/Debug
    <1e7>   DW_AT_ranges      : 0x0
    <1eb>   DW_AT_low_pc      : 0x0
    <1ef>   DW_AT_stmt_list   : 0x36f
    <1f3>   DW_AT_GNU_macros  : 0xf77
 <1><1f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x24ef): __int8_t
    <1fc>   DW_AT_decl_file   : 2
    <1fd>   DW_AT_decl_line   : 41
    <1fe>   DW_AT_decl_column : 23
    <1ff>   DW_AT_type        : <0x203>
 <1><203>: Abbrev Number: 3 (DW_TAG_base_type)
    <204>   DW_AT_byte_size   : 1
    <205>   DW_AT_encoding    : 6	(signed char)
    <206>   DW_AT_name        : (indirect string, offset: 0x29e5): signed char
 <1><20a>: Abbrev Number: 2 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0x2c50): __uint8_t
    <20f>   DW_AT_decl_file   : 2
    <210>   DW_AT_decl_line   : 43
    <211>   DW_AT_decl_column : 24
    <212>   DW_AT_type        : <0x216>
 <1><216>: Abbrev Number: 3 (DW_TAG_base_type)
    <217>   DW_AT_byte_size   : 1
    <218>   DW_AT_encoding    : 8	(unsigned char)
    <219>   DW_AT_name        : (indirect string, offset: 0x2bdf): unsigned char
 <1><21d>: Abbrev Number: 3 (DW_TAG_base_type)
    <21e>   DW_AT_byte_size   : 2
    <21f>   DW_AT_encoding    : 5	(signed)
    <220>   DW_AT_name        : (indirect string, offset: 0x763): short int
 <1><224>: Abbrev Number: 2 (DW_TAG_typedef)
    <225>   DW_AT_name        : (indirect string, offset: 0x1143): __uint16_t
    <229>   DW_AT_decl_file   : 2
    <22a>   DW_AT_decl_line   : 57
    <22b>   DW_AT_decl_column : 25
    <22c>   DW_AT_type        : <0x230>
 <1><230>: Abbrev Number: 3 (DW_TAG_base_type)
    <231>   DW_AT_byte_size   : 2
    <232>   DW_AT_encoding    : 7	(unsigned)
    <233>   DW_AT_name        : (indirect string, offset: 0x604): short unsigned int
 <1><237>: Abbrev Number: 3 (DW_TAG_base_type)
    <238>   DW_AT_byte_size   : 4
    <239>   DW_AT_encoding    : 5	(signed)
    <23a>   DW_AT_name        : (indirect string, offset: 0x2868): long int
 <1><23e>: Abbrev Number: 2 (DW_TAG_typedef)
    <23f>   DW_AT_name        : (indirect string, offset: 0x323d): __uint32_t
    <243>   DW_AT_decl_file   : 2
    <244>   DW_AT_decl_line   : 79
    <245>   DW_AT_decl_column : 25
    <246>   DW_AT_type        : <0x24a>
 <1><24a>: Abbrev Number: 3 (DW_TAG_base_type)
    <24b>   DW_AT_byte_size   : 4
    <24c>   DW_AT_encoding    : 7	(unsigned)
    <24d>   DW_AT_name        : (indirect string, offset: 0x2598): long unsigned int
 <1><251>: Abbrev Number: 3 (DW_TAG_base_type)
    <252>   DW_AT_byte_size   : 8
    <253>   DW_AT_encoding    : 5	(signed)
    <254>   DW_AT_name        : (indirect string, offset: 0x17ae): long long int
 <1><258>: Abbrev Number: 3 (DW_TAG_base_type)
    <259>   DW_AT_byte_size   : 8
    <25a>   DW_AT_encoding    : 7	(unsigned)
    <25b>   DW_AT_name        : (indirect string, offset: 0x36cb): long long unsigned int
 <1><25f>: Abbrev Number: 4 (DW_TAG_base_type)
    <260>   DW_AT_byte_size   : 4
    <261>   DW_AT_encoding    : 5	(signed)
    <262>   DW_AT_name        : int
 <1><266>: Abbrev Number: 3 (DW_TAG_base_type)
    <267>   DW_AT_byte_size   : 4
    <268>   DW_AT_encoding    : 7	(unsigned)
    <269>   DW_AT_name        : (indirect string, offset: 0x337c): unsigned int
 <1><26d>: Abbrev Number: 2 (DW_TAG_typedef)
    <26e>   DW_AT_name        : (indirect string, offset: 0x24f1): int8_t
    <272>   DW_AT_decl_file   : 3
    <273>   DW_AT_decl_line   : 20
    <274>   DW_AT_decl_column : 18
    <275>   DW_AT_type        : <0x1f7>
 <1><279>: Abbrev Number: 2 (DW_TAG_typedef)
    <27a>   DW_AT_name        : (indirect string, offset: 0x2c52): uint8_t
    <27e>   DW_AT_decl_file   : 3
    <27f>   DW_AT_decl_line   : 24
    <280>   DW_AT_decl_column : 19
    <281>   DW_AT_type        : <0x20a>
 <1><285>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <286>   DW_AT_type        : <0x279>
 <1><28a>: Abbrev Number: 6 (DW_TAG_const_type)
    <28b>   DW_AT_type        : <0x279>
 <1><28f>: Abbrev Number: 2 (DW_TAG_typedef)
    <290>   DW_AT_name        : (indirect string, offset: 0xa5761): uint16_t
    <294>   DW_AT_decl_file   : 3
    <295>   DW_AT_decl_line   : 36
    <296>   DW_AT_decl_column : 20
    <297>   DW_AT_type        : <0x224>
 <1><29b>: Abbrev Number: 2 (DW_TAG_typedef)
    <29c>   DW_AT_name        : (indirect string, offset: 0xa364d): uint32_t
    <2a0>   DW_AT_decl_file   : 3
    <2a1>   DW_AT_decl_line   : 48
    <2a2>   DW_AT_decl_column : 20
    <2a3>   DW_AT_type        : <0x23e>
 <1><2a7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <2a8>   DW_AT_byte_size   : 20
    <2a9>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 42
    <2ab>   DW_AT_decl_column : 9
    <2ac>   DW_AT_sibling     : <0x2ff>
 <2><2b0>: Abbrev Number: 8 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x11fb): motor_1_steps
    <2b5>   DW_AT_decl_file   : 4
    <2b6>   DW_AT_decl_line   : 43
    <2b7>   DW_AT_decl_column : 11
    <2b8>   DW_AT_type        : <0x28f>
    <2bc>   DW_AT_data_member_location: 0
 <2><2bd>: Abbrev Number: 8 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0x1499): motor_2_steps
    <2c2>   DW_AT_decl_file   : 4
    <2c3>   DW_AT_decl_line   : 44
    <2c4>   DW_AT_decl_column : 11
    <2c5>   DW_AT_type        : <0x28f>
    <2c9>   DW_AT_data_member_location: 2
 <2><2ca>: Abbrev Number: 8 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x1a7d): motor_1_direction
    <2cf>   DW_AT_decl_file   : 4
    <2d0>   DW_AT_decl_line   : 45
    <2d1>   DW_AT_decl_column : 9
    <2d2>   DW_AT_type        : <0x26d>
    <2d6>   DW_AT_data_member_location: 4
 <2><2d7>: Abbrev Number: 8 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x127d): motor_2_direction
    <2dc>   DW_AT_decl_file   : 4
    <2dd>   DW_AT_decl_line   : 46
    <2de>   DW_AT_decl_column : 9
    <2df>   DW_AT_type        : <0x26d>
    <2e3>   DW_AT_data_member_location: 5
 <2><2e4>: Abbrev Number: 8 (DW_TAG_member)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x19bd): encoderAngle
    <2e9>   DW_AT_decl_file   : 4
    <2ea>   DW_AT_decl_line   : 47
    <2eb>   DW_AT_decl_column : 8
    <2ec>   DW_AT_type        : <0x2ff>
    <2f0>   DW_AT_data_member_location: 8
 <2><2f1>: Abbrev Number: 8 (DW_TAG_member)
    <2f2>   DW_AT_name        : (indirect string, offset: 0x17d2): jetsonHBTick
    <2f6>   DW_AT_decl_file   : 4
    <2f7>   DW_AT_decl_line   : 48
    <2f8>   DW_AT_decl_column : 11
    <2f9>   DW_AT_type        : <0x29b>
    <2fd>   DW_AT_data_member_location: 16
 <2><2fe>: Abbrev Number: 0
 <1><2ff>: Abbrev Number: 9 (DW_TAG_array_type)
    <300>   DW_AT_type        : <0x30f>
    <304>   DW_AT_sibling     : <0x30f>
 <2><308>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <309>   DW_AT_type        : <0x266>
    <30d>   DW_AT_upper_bound : 1
 <2><30e>: Abbrev Number: 0
 <1><30f>: Abbrev Number: 3 (DW_TAG_base_type)
    <310>   DW_AT_byte_size   : 4
    <311>   DW_AT_encoding    : 4	(float)
    <312>   DW_AT_name        : (indirect string, offset: 0x74d1): float
 <1><316>: Abbrev Number: 2 (DW_TAG_typedef)
    <317>   DW_AT_name        : (indirect string, offset: 0x172d): can_rx
    <31b>   DW_AT_decl_file   : 4
    <31c>   DW_AT_decl_line   : 49
    <31d>   DW_AT_decl_column : 3
    <31e>   DW_AT_type        : <0x2a7>
 <1><322>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <323>   DW_AT_type        : <0x316>
 <1><327>: Abbrev Number: 11 (DW_TAG_variable)
    <328>   DW_AT_name        : (indirect string, offset: 0x28e9): can_rx_data
    <32c>   DW_AT_decl_file   : 4
    <32d>   DW_AT_decl_line   : 57
    <32e>   DW_AT_decl_column : 24
    <32f>   DW_AT_type        : <0x322>
    <333>   DW_AT_external    : 1
    <333>   DW_AT_declaration : 1
 <1><333>: Abbrev Number: 3 (DW_TAG_base_type)
    <334>   DW_AT_byte_size   : 8
    <335>   DW_AT_encoding    : 4	(float)
    <336>   DW_AT_name        : (indirect string, offset: 0x17f40): long double
 <1><33a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <33b>   DW_AT_byte_size   : 28
    <33c>   DW_AT_decl_file   : 5
    <33d>   DW_AT_decl_line   : 183
    <33e>   DW_AT_decl_column : 9
    <33f>   DW_AT_sibling     : <0x39f>
 <2><343>: Abbrev Number: 8 (DW_TAG_member)
    <344>   DW_AT_name        : (indirect string, offset: 0x2386e): StdId
    <348>   DW_AT_decl_file   : 5
    <349>   DW_AT_decl_line   : 185
    <34a>   DW_AT_decl_column : 12
    <34b>   DW_AT_type        : <0x29b>
    <34f>   DW_AT_data_member_location: 0
 <2><350>: Abbrev Number: 8 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x8163f): ExtId
    <355>   DW_AT_decl_file   : 5
    <356>   DW_AT_decl_line   : 188
    <357>   DW_AT_decl_column : 12
    <358>   DW_AT_type        : <0x29b>
    <35c>   DW_AT_data_member_location: 4
 <2><35d>: Abbrev Number: 12 (DW_TAG_member)
    <35e>   DW_AT_name        : IDE
    <362>   DW_AT_decl_file   : 5
    <363>   DW_AT_decl_line   : 191
    <364>   DW_AT_decl_column : 12
    <365>   DW_AT_type        : <0x29b>
    <369>   DW_AT_data_member_location: 8
 <2><36a>: Abbrev Number: 12 (DW_TAG_member)
    <36b>   DW_AT_name        : RTR
    <36f>   DW_AT_decl_file   : 5
    <370>   DW_AT_decl_line   : 194
    <371>   DW_AT_decl_column : 12
    <372>   DW_AT_type        : <0x29b>
    <376>   DW_AT_data_member_location: 12
 <2><377>: Abbrev Number: 12 (DW_TAG_member)
    <378>   DW_AT_name        : DLC
    <37c>   DW_AT_decl_file   : 5
    <37d>   DW_AT_decl_line   : 197
    <37e>   DW_AT_decl_column : 12
    <37f>   DW_AT_type        : <0x29b>
    <383>   DW_AT_data_member_location: 16
 <2><384>: Abbrev Number: 8 (DW_TAG_member)
    <385>   DW_AT_name        : (indirect string, offset: 0xe5fed): Timestamp
    <389>   DW_AT_decl_file   : 5
    <38a>   DW_AT_decl_line   : 200
    <38b>   DW_AT_decl_column : 12
    <38c>   DW_AT_type        : <0x29b>
    <390>   DW_AT_data_member_location: 20
 <2><391>: Abbrev Number: 8 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0x1e42b): FilterMatchIndex
    <396>   DW_AT_decl_file   : 5
    <397>   DW_AT_decl_line   : 204
    <398>   DW_AT_decl_column : 12
    <399>   DW_AT_type        : <0x29b>
    <39d>   DW_AT_data_member_location: 24
 <2><39e>: Abbrev Number: 0
 <1><39f>: Abbrev Number: 2 (DW_TAG_typedef)
    <3a0>   DW_AT_name        : (indirect string, offset: 0xa7658): CAN_RxHeaderTypeDef
    <3a4>   DW_AT_decl_file   : 5
    <3a5>   DW_AT_decl_line   : 207
    <3a6>   DW_AT_decl_column : 3
    <3a7>   DW_AT_type        : <0x33a>
 <1><3ab>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <3ac>   DW_AT_byte_size   : 4
    <3ad>   DW_AT_type        : <0x279>
 <1><3b1>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <3b2>   DW_AT_byte_size   : 4
    <3b3>   DW_AT_type        : <0x28a>
 <1><3b7>: Abbrev Number: 3 (DW_TAG_base_type)
    <3b8>   DW_AT_byte_size   : 1
    <3b9>   DW_AT_encoding    : 8	(unsigned char)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x49674): char
 <1><3be>: Abbrev Number: 3 (DW_TAG_base_type)
    <3bf>   DW_AT_byte_size   : 8
    <3c0>   DW_AT_encoding    : 4	(float)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x1e467): double
 <1><3c5>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <3c6>   DW_AT_encoding    : 7	(unsigned)
    <3c7>   DW_AT_byte_size   : 1
    <3c8>   DW_AT_type        : <0x216>
    <3cc>   DW_AT_decl_file   : 6
    <3cd>   DW_AT_decl_line   : 18
    <3ce>   DW_AT_decl_column : 14
    <3cf>   DW_AT_sibling     : <0x3e0>
 <2><3d3>: Abbrev Number: 15 (DW_TAG_enumerator)
    <3d4>   DW_AT_name        : (indirect string, offset: 0xb6284): STEERING
    <3d8>   DW_AT_const_value : 0
 <2><3d9>: Abbrev Number: 15 (DW_TAG_enumerator)
    <3da>   DW_AT_name        : (indirect string, offset: 0xc2d25): BRAKING
    <3de>   DW_AT_const_value : 1
 <2><3df>: Abbrev Number: 0
 <1><3e0>: Abbrev Number: 2 (DW_TAG_typedef)
    <3e1>   DW_AT_name        : (indirect string, offset: 0x7b51f): stepper_id
    <3e5>   DW_AT_decl_file   : 6
    <3e6>   DW_AT_decl_line   : 21
    <3e7>   DW_AT_decl_column : 3
    <3e8>   DW_AT_type        : <0x3c5>
 <1><3ec>: Abbrev Number: 6 (DW_TAG_const_type)
    <3ed>   DW_AT_type        : <0x3e0>
 <1><3f1>: Abbrev Number: 11 (DW_TAG_variable)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x84bc0): g_sendPing
    <3f6>   DW_AT_decl_file   : 1
    <3f7>   DW_AT_decl_line   : 14
    <3f8>   DW_AT_decl_column : 25
    <3f9>   DW_AT_type        : <0x285>
    <3fd>   DW_AT_external    : 1
    <3fd>   DW_AT_declaration : 1
 <1><3fd>: Abbrev Number: 16 (DW_TAG_subprogram)
    <3fe>   DW_AT_external    : 1
    <3fe>   DW_AT_name        : (indirect string, offset: 0xe09e0): HAL_GetTick
    <402>   DW_AT_decl_file   : 8
    <403>   DW_AT_decl_line   : 653
    <405>   DW_AT_decl_column : 20
    <406>   DW_AT_prototyped  : 1
    <406>   DW_AT_type        : <0x29b>
    <40a>   DW_AT_declaration : 1
 <1><40a>: Abbrev Number: 17 (DW_TAG_subprogram)
    <40b>   DW_AT_external    : 1
    <40b>   DW_AT_name        : (indirect string, offset: 0x590b0): can_parse_float
    <40f>   DW_AT_decl_file   : 7
    <410>   DW_AT_decl_line   : 47
    <411>   DW_AT_decl_column : 7
    <412>   DW_AT_prototyped  : 1
    <412>   DW_AT_type        : <0x30f>
    <416>   DW_AT_declaration : 1
    <416>   DW_AT_sibling     : <0x425>
 <2><41a>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <41b>   DW_AT_type        : <0x3b1>
 <2><41f>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <420>   DW_AT_type        : <0x279>
 <2><424>: Abbrev Number: 0
 <1><425>: Abbrev Number: 19 (DW_TAG_subprogram)
    <426>   DW_AT_external    : 1
    <426>   DW_AT_name        : (indirect string, offset: 0x69cf4): set_direction
    <42a>   DW_AT_decl_file   : 6
    <42b>   DW_AT_decl_line   : 56
    <42c>   DW_AT_decl_column : 6
    <42d>   DW_AT_prototyped  : 1
    <42d>   DW_AT_declaration : 1
    <42d>   DW_AT_sibling     : <0x43c>
 <2><431>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <432>   DW_AT_type        : <0x3ec>
 <2><436>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <437>   DW_AT_type        : <0x26d>
 <2><43b>: Abbrev Number: 0
 <1><43c>: Abbrev Number: 19 (DW_TAG_subprogram)
    <43d>   DW_AT_external    : 1
    <43d>   DW_AT_name        : (indirect string, offset: 0x5caf0): set_setpoint
    <441>   DW_AT_decl_file   : 6
    <442>   DW_AT_decl_line   : 57
    <443>   DW_AT_decl_column : 6
    <444>   DW_AT_prototyped  : 1
    <444>   DW_AT_declaration : 1
    <444>   DW_AT_sibling     : <0x458>
 <2><448>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <449>   DW_AT_type        : <0x3ec>
 <2><44d>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <44e>   DW_AT_type        : <0x28f>
 <2><452>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <453>   DW_AT_type        : <0x26d>
 <2><457>: Abbrev Number: 0
 <1><458>: Abbrev Number: 17 (DW_TAG_subprogram)
    <459>   DW_AT_external    : 1
    <459>   DW_AT_name        : (indirect string, offset: 0x789f4): can_parse_long
    <45d>   DW_AT_decl_file   : 7
    <45e>   DW_AT_decl_line   : 53
    <45f>   DW_AT_decl_column : 10
    <460>   DW_AT_prototyped  : 1
    <460>   DW_AT_type        : <0x29b>
    <464>   DW_AT_declaration : 1
    <464>   DW_AT_sibling     : <0x473>
 <2><468>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <469>   DW_AT_type        : <0x3b1>
 <2><46d>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <46e>   DW_AT_type        : <0x279>
 <2><472>: Abbrev Number: 0
 <1><473>: Abbrev Number: 17 (DW_TAG_subprogram)
    <474>   DW_AT_external    : 1
    <474>   DW_AT_name        : (indirect string, offset: 0x10e5e): can_parse_id
    <478>   DW_AT_decl_file   : 7
    <479>   DW_AT_decl_line   : 41
    <47a>   DW_AT_decl_column : 9
    <47b>   DW_AT_prototyped  : 1
    <47b>   DW_AT_type        : <0x279>
    <47f>   DW_AT_declaration : 1
    <47f>   DW_AT_sibling     : <0x48e>
 <2><483>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <484>   DW_AT_type        : <0x3b1>
 <2><488>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <489>   DW_AT_type        : <0x279>
 <2><48d>: Abbrev Number: 0
 <1><48e>: Abbrev Number: 20 (DW_TAG_subprogram)
    <48f>   DW_AT_external    : 1
    <48f>   DW_AT_name        : (indirect string, offset: 0x616a7): can_parse_msg
    <493>   DW_AT_decl_file   : 1
    <494>   DW_AT_decl_line   : 16
    <495>   DW_AT_decl_column : 6
    <496>   DW_AT_prototyped  : 1
    <496>   DW_AT_low_pc      : 0x80004d4
    <49a>   DW_AT_high_pc     : 0x110
    <49e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4a0>   DW_AT_GNU_all_tail_call_sites: 1
    <4a0>   DW_AT_sibling     : <0x560>
 <2><4a4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x69646): header
    <4a9>   DW_AT_decl_file   : 1
    <4aa>   DW_AT_decl_line   : 16
    <4ab>   DW_AT_decl_column : 41
    <4ac>   DW_AT_type        : <0x560>
    <4b0>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><4b3>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <4b4>   DW_AT_name        : (indirect string, offset: 0xe8b27): data
    <4b8>   DW_AT_decl_file   : 1
    <4b9>   DW_AT_decl_line   : 16
    <4ba>   DW_AT_decl_column : 58
    <4bb>   DW_AT_type        : <0x3ab>
    <4bf>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><4c2>: Abbrev Number: 22 (DW_TAG_variable)
    <4c3>   DW_AT_name        : id
    <4c6>   DW_AT_decl_file   : 1
    <4c7>   DW_AT_decl_line   : 19
    <4c8>   DW_AT_decl_column : 10
    <4c9>   DW_AT_type        : <0x279>
    <4cd>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><4d0>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <4d1>   DW_AT_low_pc      : 0x8000500
    <4d5>   DW_AT_high_pc     : 0x34
    <4d9>   DW_AT_sibling     : <0x50b>
 <3><4dd>: Abbrev Number: 24 (DW_TAG_variable)
    <4de>   DW_AT_name        : (indirect string, offset: 0x72703): frame
    <4e2>   DW_AT_decl_file   : 1
    <4e3>   DW_AT_decl_line   : 22
    <4e4>   DW_AT_decl_column : 12
    <4e5>   DW_AT_type        : <0x29b>
    <4e9>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><4ec>: Abbrev Number: 24 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x1203): steps
    <4f1>   DW_AT_decl_file   : 1
    <4f2>   DW_AT_decl_line   : 23
    <4f3>   DW_AT_decl_column : 12
    <4f4>   DW_AT_type        : <0x28f>
    <4f8>   DW_AT_location    : 2 byte block: 91 5e 	(DW_OP_fbreg: -34)
 <3><4fb>: Abbrev Number: 22 (DW_TAG_variable)
    <4fc>   DW_AT_name        : dir
    <500>   DW_AT_decl_file   : 1
    <501>   DW_AT_decl_line   : 24
    <502>   DW_AT_decl_column : 10
    <503>   DW_AT_type        : <0x26d>
    <507>   DW_AT_location    : 2 byte block: 91 5d 	(DW_OP_fbreg: -35)
 <3><50a>: Abbrev Number: 0
 <2><50b>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <50c>   DW_AT_low_pc      : 0x800053e
    <510>   DW_AT_high_pc     : 0x26
    <514>   DW_AT_sibling     : <0x537>
 <3><518>: Abbrev Number: 24 (DW_TAG_variable)
    <519>   DW_AT_name        : (indirect string, offset: 0x72703): frame
    <51d>   DW_AT_decl_file   : 1
    <51e>   DW_AT_decl_line   : 30
    <51f>   DW_AT_decl_column : 12
    <520>   DW_AT_type        : <0x29b>
    <524>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><527>: Abbrev Number: 22 (DW_TAG_variable)
    <528>   DW_AT_name        : dir
    <52c>   DW_AT_decl_file   : 1
    <52d>   DW_AT_decl_line   : 32
    <52e>   DW_AT_decl_column : 10
    <52f>   DW_AT_type        : <0x26d>
    <533>   DW_AT_location    : 2 byte block: 91 67 	(DW_OP_fbreg: -25)
 <3><536>: Abbrev Number: 0
 <2><537>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <538>   DW_AT_low_pc      : 0x8000576
    <53c>   DW_AT_high_pc     : 0x30
 <3><540>: Abbrev Number: 22 (DW_TAG_variable)
    <541>   DW_AT_name        : val
    <545>   DW_AT_decl_file   : 1
    <546>   DW_AT_decl_line   : 38
    <547>   DW_AT_decl_column : 9
    <548>   DW_AT_type        : <0x30f>
    <54c>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><54f>: Abbrev Number: 24 (DW_TAG_variable)
    <550>   DW_AT_name        : (indirect string, offset: 0xe4adc): angle
    <554>   DW_AT_decl_file   : 1
    <555>   DW_AT_decl_line   : 39
    <556>   DW_AT_decl_column : 9
    <557>   DW_AT_type        : <0x30f>
    <55b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><55e>: Abbrev Number: 0
 <2><55f>: Abbrev Number: 0
 <1><560>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <561>   DW_AT_byte_size   : 4
    <562>   DW_AT_type        : <0x39f>
 <1><566>: Abbrev Number: 0
  Compilation Unit @ offset 0x567:
   Length:        0xdc8 (32-bit)
   Version:       4
   Abbrev Offset: 0x203
   Pointer Size:  4
 <0><572>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <573>   DW_AT_producer    : (indirect string, offset: 0x3030): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <577>   DW_AT_language    : 12	(ANSI C99)
    <578>   DW_AT_name        : (indirect string, offset: 0xe3015): ../Core/Src/CAN/can_tasks.c
    <57c>   DW_AT_comp_dir    : (indirect string, offset: 0x18f8): /home/saveasmtz/Documents/embedded/stepper_boards_firmware/Debug
    <580>   DW_AT_ranges      : 0x10
    <584>   DW_AT_low_pc      : 0x0
    <588>   DW_AT_stmt_list   : 0xe4f
    <58c>   DW_AT_GNU_macros  : 0x2264b
 <1><590>: Abbrev Number: 2 (DW_TAG_base_type)
    <591>   DW_AT_byte_size   : 1
    <592>   DW_AT_encoding    : 6	(signed char)
    <593>   DW_AT_name        : (indirect string, offset: 0x29e5): signed char
 <1><597>: Abbrev Number: 3 (DW_TAG_typedef)
    <598>   DW_AT_name        : (indirect string, offset: 0x2c50): __uint8_t
    <59c>   DW_AT_decl_file   : 2
    <59d>   DW_AT_decl_line   : 43
    <59e>   DW_AT_decl_column : 24
    <59f>   DW_AT_type        : <0x5a3>
 <1><5a3>: Abbrev Number: 2 (DW_TAG_base_type)
    <5a4>   DW_AT_byte_size   : 1
    <5a5>   DW_AT_encoding    : 8	(unsigned char)
    <5a6>   DW_AT_name        : (indirect string, offset: 0x2bdf): unsigned char
 <1><5aa>: Abbrev Number: 2 (DW_TAG_base_type)
    <5ab>   DW_AT_byte_size   : 2
    <5ac>   DW_AT_encoding    : 5	(signed)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x763): short int
 <1><5b1>: Abbrev Number: 2 (DW_TAG_base_type)
    <5b2>   DW_AT_byte_size   : 2
    <5b3>   DW_AT_encoding    : 7	(unsigned)
    <5b4>   DW_AT_name        : (indirect string, offset: 0x604): short unsigned int
 <1><5b8>: Abbrev Number: 2 (DW_TAG_base_type)
    <5b9>   DW_AT_byte_size   : 4
    <5ba>   DW_AT_encoding    : 5	(signed)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x2868): long int
 <1><5bf>: Abbrev Number: 3 (DW_TAG_typedef)
    <5c0>   DW_AT_name        : (indirect string, offset: 0x323d): __uint32_t
    <5c4>   DW_AT_decl_file   : 2
    <5c5>   DW_AT_decl_line   : 79
    <5c6>   DW_AT_decl_column : 25
    <5c7>   DW_AT_type        : <0x5cb>
 <1><5cb>: Abbrev Number: 2 (DW_TAG_base_type)
    <5cc>   DW_AT_byte_size   : 4
    <5cd>   DW_AT_encoding    : 7	(unsigned)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x2598): long unsigned int
 <1><5d2>: Abbrev Number: 2 (DW_TAG_base_type)
    <5d3>   DW_AT_byte_size   : 8
    <5d4>   DW_AT_encoding    : 5	(signed)
    <5d5>   DW_AT_name        : (indirect string, offset: 0x17ae): long long int
 <1><5d9>: Abbrev Number: 2 (DW_TAG_base_type)
    <5da>   DW_AT_byte_size   : 8
    <5db>   DW_AT_encoding    : 7	(unsigned)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x36cb): long long unsigned int
 <1><5e0>: Abbrev Number: 4 (DW_TAG_base_type)
    <5e1>   DW_AT_byte_size   : 4
    <5e2>   DW_AT_encoding    : 5	(signed)
    <5e3>   DW_AT_name        : int
 <1><5e7>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e8>   DW_AT_byte_size   : 4
    <5e9>   DW_AT_encoding    : 7	(unsigned)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x337c): unsigned int
 <1><5ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <5ef>   DW_AT_name        : (indirect string, offset: 0x2c52): uint8_t
    <5f3>   DW_AT_decl_file   : 3
    <5f4>   DW_AT_decl_line   : 24
    <5f5>   DW_AT_decl_column : 19
    <5f6>   DW_AT_type        : <0x597>
 <1><5fa>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <5fb>   DW_AT_type        : <0x5ee>
 <1><5ff>: Abbrev Number: 6 (DW_TAG_const_type)
    <600>   DW_AT_type        : <0x5ee>
 <1><604>: Abbrev Number: 3 (DW_TAG_typedef)
    <605>   DW_AT_name        : (indirect string, offset: 0xa364d): uint32_t
    <609>   DW_AT_decl_file   : 3
    <60a>   DW_AT_decl_line   : 48
    <60b>   DW_AT_decl_column : 20
    <60c>   DW_AT_type        : <0x5bf>
 <1><610>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <611>   DW_AT_type        : <0x604>
 <1><615>: Abbrev Number: 6 (DW_TAG_const_type)
    <616>   DW_AT_type        : <0x604>
 <1><61a>: Abbrev Number: 2 (DW_TAG_base_type)
    <61b>   DW_AT_byte_size   : 4
    <61c>   DW_AT_encoding    : 4	(float)
    <61d>   DW_AT_name        : (indirect string, offset: 0x74d1): float
 <1><621>: Abbrev Number: 7 (DW_TAG_structure_type)
    <622>   DW_AT_byte_size   : 9
    <623>   DW_AT_decl_file   : 4
    <624>   DW_AT_decl_line   : 60
    <625>   DW_AT_decl_column : 9
    <626>   DW_AT_sibling     : <0x645>
 <2><62a>: Abbrev Number: 8 (DW_TAG_member)
    <62b>   DW_AT_name        : buf
    <62f>   DW_AT_decl_file   : 4
    <630>   DW_AT_decl_line   : 61
    <631>   DW_AT_decl_column : 10
    <632>   DW_AT_type        : <0x645>
    <636>   DW_AT_data_member_location: 0
 <2><637>: Abbrev Number: 9 (DW_TAG_member)
    <638>   DW_AT_name        : (indirect string, offset: 0xe17a7): msg_size
    <63c>   DW_AT_decl_file   : 4
    <63d>   DW_AT_decl_line   : 62
    <63e>   DW_AT_decl_column : 10
    <63f>   DW_AT_type        : <0x5ee>
    <643>   DW_AT_data_member_location: 8
 <2><644>: Abbrev Number: 0
 <1><645>: Abbrev Number: 10 (DW_TAG_array_type)
    <646>   DW_AT_type        : <0x5ee>
    <64a>   DW_AT_sibling     : <0x655>
 <2><64e>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <64f>   DW_AT_type        : <0x5e7>
    <653>   DW_AT_upper_bound : 7
 <2><654>: Abbrev Number: 0
 <1><655>: Abbrev Number: 3 (DW_TAG_typedef)
    <656>   DW_AT_name        : (indirect string, offset: 0xe1f12): CAN_TX_QUEUE_OBJ
    <65a>   DW_AT_decl_file   : 4
    <65b>   DW_AT_decl_line   : 63
    <65c>   DW_AT_decl_column : 3
    <65d>   DW_AT_type        : <0x621>
 <1><661>: Abbrev Number: 2 (DW_TAG_base_type)
    <662>   DW_AT_byte_size   : 8
    <663>   DW_AT_encoding    : 4	(float)
    <664>   DW_AT_name        : (indirect string, offset: 0x17f40): long double
 <1><668>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <669>   DW_AT_byte_size   : 4
    <66a>   DW_AT_type        : <0x66e>
 <1><66e>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <66f>   DW_AT_prototyped  : 1
    <66f>   DW_AT_sibling     : <0x679>
 <2><673>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <674>   DW_AT_type        : <0x679>
 <2><678>: Abbrev Number: 0
 <1><679>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <67a>   DW_AT_byte_size   : 4
 <1><67b>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <67c>   DW_AT_byte_size   : 4
    <67d>   DW_AT_type        : <0x5ee>
 <1><681>: Abbrev Number: 2 (DW_TAG_base_type)
    <682>   DW_AT_byte_size   : 1
    <683>   DW_AT_encoding    : 8	(unsigned char)
    <684>   DW_AT_name        : (indirect string, offset: 0x49674): char
 <1><688>: Abbrev Number: 6 (DW_TAG_const_type)
    <689>   DW_AT_type        : <0x681>
 <1><68d>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <68e>   DW_AT_byte_size   : 4
    <68f>   DW_AT_type        : <0x688>
 <1><693>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <694>   DW_AT_encoding    : 5	(signed)
    <695>   DW_AT_byte_size   : 4
    <696>   DW_AT_type        : <0x5e0>
    <69a>   DW_AT_decl_file   : 5
    <69b>   DW_AT_decl_line   : 82
    <69c>   DW_AT_decl_column : 14
    <69d>   DW_AT_sibling     : <0x7e3>
 <2><6a1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6a2>   DW_AT_name        : (indirect string, offset: 0xe1e03): osPriorityNone
    <6a6>   DW_AT_const_value : 0
 <2><6a7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6a8>   DW_AT_name        : (indirect string, offset: 0xe2cc5): osPriorityIdle
    <6ac>   DW_AT_const_value : 1
 <2><6ad>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6ae>   DW_AT_name        : (indirect string, offset: 0xe2e57): osPriorityLow
    <6b2>   DW_AT_const_value : 8
 <2><6b3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6b4>   DW_AT_name        : (indirect string, offset: 0xe2b36): osPriorityLow1
    <6b8>   DW_AT_const_value : 9
 <2><6b9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6ba>   DW_AT_name        : (indirect string, offset: 0xe2f79): osPriorityLow2
    <6be>   DW_AT_const_value : 10
 <2><6bf>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6c0>   DW_AT_name        : (indirect string, offset: 0xe2f88): osPriorityLow3
    <6c4>   DW_AT_const_value : 11
 <2><6c5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6c6>   DW_AT_name        : (indirect string, offset: 0xe2f97): osPriorityLow4
    <6ca>   DW_AT_const_value : 12
 <2><6cb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6cc>   DW_AT_name        : (indirect string, offset: 0xe2fa6): osPriorityLow5
    <6d0>   DW_AT_const_value : 13
 <2><6d1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6d2>   DW_AT_name        : (indirect string, offset: 0xe2fb5): osPriorityLow6
    <6d6>   DW_AT_const_value : 14
 <2><6d7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6d8>   DW_AT_name        : (indirect string, offset: 0xe2008): osPriorityLow7
    <6dc>   DW_AT_const_value : 15
 <2><6dd>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6de>   DW_AT_name        : (indirect string, offset: 0xe298a): osPriorityBelowNormal
    <6e2>   DW_AT_const_value : 16
 <2><6e3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6e4>   DW_AT_name        : (indirect string, offset: 0xe24fb): osPriorityBelowNormal1
    <6e8>   DW_AT_const_value : 17
 <2><6e9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6ea>   DW_AT_name        : (indirect string, offset: 0xe2c13): osPriorityBelowNormal2
    <6ee>   DW_AT_const_value : 18
 <2><6ef>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6f0>   DW_AT_name        : (indirect string, offset: 0xe28c1): osPriorityBelowNormal3
    <6f4>   DW_AT_const_value : 19
 <2><6f5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6f6>   DW_AT_name        : (indirect string, offset: 0xe2c2a): osPriorityBelowNormal4
    <6fa>   DW_AT_const_value : 20
 <2><6fb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6fc>   DW_AT_name        : (indirect string, offset: 0xe2c41): osPriorityBelowNormal5
    <700>   DW_AT_const_value : 21
 <2><701>: Abbrev Number: 17 (DW_TAG_enumerator)
    <702>   DW_AT_name        : (indirect string, offset: 0xe2c58): osPriorityBelowNormal6
    <706>   DW_AT_const_value : 22
 <2><707>: Abbrev Number: 17 (DW_TAG_enumerator)
    <708>   DW_AT_name        : (indirect string, offset: 0xe2c6f): osPriorityBelowNormal7
    <70c>   DW_AT_const_value : 23
 <2><70d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <70e>   DW_AT_name        : (indirect string, offset: 0xe2b56): osPriorityNormal
    <712>   DW_AT_const_value : 24
 <2><713>: Abbrev Number: 17 (DW_TAG_enumerator)
    <714>   DW_AT_name        : (indirect string, offset: 0xe19db): osPriorityNormal1
    <718>   DW_AT_const_value : 25
 <2><719>: Abbrev Number: 17 (DW_TAG_enumerator)
    <71a>   DW_AT_name        : (indirect string, offset: 0xe19ed): osPriorityNormal2
    <71e>   DW_AT_const_value : 26
 <2><71f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <720>   DW_AT_name        : (indirect string, offset: 0xe19ff): osPriorityNormal3
    <724>   DW_AT_const_value : 27
 <2><725>: Abbrev Number: 17 (DW_TAG_enumerator)
    <726>   DW_AT_name        : (indirect string, offset: 0xe1a11): osPriorityNormal4
    <72a>   DW_AT_const_value : 28
 <2><72b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <72c>   DW_AT_name        : (indirect string, offset: 0xe2a45): osPriorityNormal5
    <730>   DW_AT_const_value : 29
 <2><731>: Abbrev Number: 17 (DW_TAG_enumerator)
    <732>   DW_AT_name        : (indirect string, offset: 0xe1a23): osPriorityNormal6
    <736>   DW_AT_const_value : 30
 <2><737>: Abbrev Number: 17 (DW_TAG_enumerator)
    <738>   DW_AT_name        : (indirect string, offset: 0xe1a35): osPriorityNormal7
    <73c>   DW_AT_const_value : 31
 <2><73d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <73e>   DW_AT_name        : (indirect string, offset: 0xe268d): osPriorityAboveNormal
    <742>   DW_AT_const_value : 32
 <2><743>: Abbrev Number: 17 (DW_TAG_enumerator)
    <744>   DW_AT_name        : (indirect string, offset: 0xe30cb): osPriorityAboveNormal1
    <748>   DW_AT_const_value : 33
 <2><749>: Abbrev Number: 17 (DW_TAG_enumerator)
    <74a>   DW_AT_name        : (indirect string, offset: 0xe30e2): osPriorityAboveNormal2
    <74e>   DW_AT_const_value : 34
 <2><74f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <750>   DW_AT_name        : (indirect string, offset: 0xe30f9): osPriorityAboveNormal3
    <754>   DW_AT_const_value : 35
 <2><755>: Abbrev Number: 17 (DW_TAG_enumerator)
    <756>   DW_AT_name        : (indirect string, offset: 0xe3110): osPriorityAboveNormal4
    <75a>   DW_AT_const_value : 36
 <2><75b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <75c>   DW_AT_name        : (indirect string, offset: 0xe2d4c): osPriorityAboveNormal5
    <760>   DW_AT_const_value : 37
 <2><761>: Abbrev Number: 17 (DW_TAG_enumerator)
    <762>   DW_AT_name        : (indirect string, offset: 0xe3127): osPriorityAboveNormal6
    <766>   DW_AT_const_value : 38
 <2><767>: Abbrev Number: 17 (DW_TAG_enumerator)
    <768>   DW_AT_name        : (indirect string, offset: 0xe313e): osPriorityAboveNormal7
    <76c>   DW_AT_const_value : 39
 <2><76d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <76e>   DW_AT_name        : (indirect string, offset: 0xe1f36): osPriorityHigh
    <772>   DW_AT_const_value : 40
 <2><773>: Abbrev Number: 17 (DW_TAG_enumerator)
    <774>   DW_AT_name        : (indirect string, offset: 0xe278f): osPriorityHigh1
    <778>   DW_AT_const_value : 41
 <2><779>: Abbrev Number: 17 (DW_TAG_enumerator)
    <77a>   DW_AT_name        : (indirect string, offset: 0xe279f): osPriorityHigh2
    <77e>   DW_AT_const_value : 42
 <2><77f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <780>   DW_AT_name        : (indirect string, offset: 0xe27af): osPriorityHigh3
    <784>   DW_AT_const_value : 43
 <2><785>: Abbrev Number: 17 (DW_TAG_enumerator)
    <786>   DW_AT_name        : (indirect string, offset: 0xe27bf): osPriorityHigh4
    <78a>   DW_AT_const_value : 44
 <2><78b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <78c>   DW_AT_name        : (indirect string, offset: 0xe27cf): osPriorityHigh5
    <790>   DW_AT_const_value : 45
 <2><791>: Abbrev Number: 17 (DW_TAG_enumerator)
    <792>   DW_AT_name        : (indirect string, offset: 0xe27df): osPriorityHigh6
    <796>   DW_AT_const_value : 46
 <2><797>: Abbrev Number: 17 (DW_TAG_enumerator)
    <798>   DW_AT_name        : (indirect string, offset: 0xe27ef): osPriorityHigh7
    <79c>   DW_AT_const_value : 47
 <2><79d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <79e>   DW_AT_name        : (indirect string, offset: 0xe2dd3): osPriorityRealtime
    <7a2>   DW_AT_const_value : 48
 <2><7a3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7a4>   DW_AT_name        : (indirect string, offset: 0xe25ce): osPriorityRealtime1
    <7a8>   DW_AT_const_value : 49
 <2><7a9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7aa>   DW_AT_name        : (indirect string, offset: 0xe25e2): osPriorityRealtime2
    <7ae>   DW_AT_const_value : 50
 <2><7af>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7b0>   DW_AT_name        : (indirect string, offset: 0xe25f6): osPriorityRealtime3
    <7b4>   DW_AT_const_value : 51
 <2><7b5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xe260a): osPriorityRealtime4
    <7ba>   DW_AT_const_value : 52
 <2><7bb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7bc>   DW_AT_name        : (indirect string, offset: 0xe261e): osPriorityRealtime5
    <7c0>   DW_AT_const_value : 53
 <2><7c1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7c2>   DW_AT_name        : (indirect string, offset: 0xe2632): osPriorityRealtime6
    <7c6>   DW_AT_const_value : 54
 <2><7c7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7c8>   DW_AT_name        : (indirect string, offset: 0xe2646): osPriorityRealtime7
    <7cc>   DW_AT_const_value : 55
 <2><7cd>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7ce>   DW_AT_name        : (indirect string, offset: 0xe16ae): osPriorityISR
    <7d2>   DW_AT_const_value : 56
 <2><7d3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7d4>   DW_AT_name        : (indirect string, offset: 0xe2d3c): osPriorityError
    <7d8>   DW_AT_const_value : -1
 <2><7d9>: Abbrev Number: 19 (DW_TAG_enumerator)
    <7da>   DW_AT_name        : (indirect string, offset: 0xe2fc4): osPriorityReserved
    <7de>   DW_AT_const_value : 0x7fffffff
 <2><7e2>: Abbrev Number: 0
 <1><7e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xbd533): osPriority_t
    <7e8>   DW_AT_decl_file   : 5
    <7e9>   DW_AT_decl_line   : 136
    <7ea>   DW_AT_decl_column : 3
    <7eb>   DW_AT_type        : <0x693>
 <1><7ef>: Abbrev Number: 3 (DW_TAG_typedef)
    <7f0>   DW_AT_name        : (indirect string, offset: 0xe2425): osThreadFunc_t
    <7f4>   DW_AT_decl_file   : 5
    <7f5>   DW_AT_decl_line   : 139
    <7f6>   DW_AT_decl_column : 16
    <7f7>   DW_AT_type        : <0x668>
 <1><7fb>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <7fc>   DW_AT_encoding    : 5	(signed)
    <7fd>   DW_AT_byte_size   : 4
    <7fe>   DW_AT_type        : <0x5e0>
    <802>   DW_AT_decl_file   : 5
    <803>   DW_AT_decl_line   : 176
    <804>   DW_AT_decl_column : 14
    <805>   DW_AT_sibling     : <0x83d>
 <2><809>: Abbrev Number: 17 (DW_TAG_enumerator)
    <80a>   DW_AT_name        : (indirect string, offset: 0xe2aac): osOK
    <80e>   DW_AT_const_value : 0
 <2><80f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <810>   DW_AT_name        : (indirect string, offset: 0x6855a): osError
    <814>   DW_AT_const_value : -1
 <2><815>: Abbrev Number: 18 (DW_TAG_enumerator)
    <816>   DW_AT_name        : (indirect string, offset: 0x94cdd): osErrorTimeout
    <81a>   DW_AT_const_value : -2
 <2><81b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <81c>   DW_AT_name        : (indirect string, offset: 0xe2735): osErrorResource
    <820>   DW_AT_const_value : -3
 <2><821>: Abbrev Number: 18 (DW_TAG_enumerator)
    <822>   DW_AT_name        : (indirect string, offset: 0xe1d0e): osErrorParameter
    <826>   DW_AT_const_value : -4
 <2><827>: Abbrev Number: 18 (DW_TAG_enumerator)
    <828>   DW_AT_name        : (indirect string, offset: 0xe1a6c): osErrorNoMemory
    <82c>   DW_AT_const_value : -5
 <2><82d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <82e>   DW_AT_name        : (indirect string, offset: 0xe2b02): osErrorISR
    <832>   DW_AT_const_value : -6
 <2><833>: Abbrev Number: 19 (DW_TAG_enumerator)
    <834>   DW_AT_name        : (indirect string, offset: 0xe235d): osStatusReserved
    <838>   DW_AT_const_value : 0x7fffffff
 <2><83c>: Abbrev Number: 0
 <1><83d>: Abbrev Number: 3 (DW_TAG_typedef)
    <83e>   DW_AT_name        : (indirect string, offset: 0xe1eca): osStatus_t
    <842>   DW_AT_decl_file   : 5
    <843>   DW_AT_decl_line   : 185
    <844>   DW_AT_decl_column : 3
    <845>   DW_AT_type        : <0x7fb>
 <1><849>: Abbrev Number: 3 (DW_TAG_typedef)
    <84a>   DW_AT_name        : (indirect string, offset: 0x9472a): osThreadId_t
    <84e>   DW_AT_decl_file   : 5
    <84f>   DW_AT_decl_line   : 189
    <850>   DW_AT_decl_column : 15
    <851>   DW_AT_type        : <0x679>
 <1><855>: Abbrev Number: 3 (DW_TAG_typedef)
    <856>   DW_AT_name        : (indirect string, offset: 0xe217d): osMessageQueueId_t
    <85a>   DW_AT_decl_file   : 5
    <85b>   DW_AT_decl_line   : 207
    <85c>   DW_AT_decl_column : 15
    <85d>   DW_AT_type        : <0x679>
 <1><861>: Abbrev Number: 3 (DW_TAG_typedef)
    <862>   DW_AT_name        : (indirect string, offset: 0xe2817): TZ_ModuleId_t
    <866>   DW_AT_decl_file   : 5
    <867>   DW_AT_decl_line   : 213
    <868>   DW_AT_decl_column : 18
    <869>   DW_AT_type        : <0x604>
 <1><86d>: Abbrev Number: 7 (DW_TAG_structure_type)
    <86e>   DW_AT_byte_size   : 36
    <86f>   DW_AT_decl_file   : 5
    <870>   DW_AT_decl_line   : 218
    <871>   DW_AT_decl_column : 9
    <872>   DW_AT_sibling     : <0x8ec>
 <2><876>: Abbrev Number: 9 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0xc92a5): name
    <87b>   DW_AT_decl_file   : 5
    <87c>   DW_AT_decl_line   : 219
    <87d>   DW_AT_decl_column : 33
    <87e>   DW_AT_type        : <0x68d>
    <882>   DW_AT_data_member_location: 0
 <2><883>: Abbrev Number: 9 (DW_TAG_member)
    <884>   DW_AT_name        : (indirect string, offset: 0xe272b): attr_bits
    <888>   DW_AT_decl_file   : 5
    <889>   DW_AT_decl_line   : 220
    <88a>   DW_AT_decl_column : 28
    <88b>   DW_AT_type        : <0x604>
    <88f>   DW_AT_data_member_location: 4
 <2><890>: Abbrev Number: 9 (DW_TAG_member)
    <891>   DW_AT_name        : (indirect string, offset: 0xe1b7e): cb_mem
    <895>   DW_AT_decl_file   : 5
    <896>   DW_AT_decl_line   : 221
    <897>   DW_AT_decl_column : 30
    <898>   DW_AT_type        : <0x679>
    <89c>   DW_AT_data_member_location: 8
 <2><89d>: Abbrev Number: 9 (DW_TAG_member)
    <89e>   DW_AT_name        : (indirect string, offset: 0xe2f5c): cb_size
    <8a2>   DW_AT_decl_file   : 5
    <8a3>   DW_AT_decl_line   : 222
    <8a4>   DW_AT_decl_column : 30
    <8a5>   DW_AT_type        : <0x604>
    <8a9>   DW_AT_data_member_location: 12
 <2><8aa>: Abbrev Number: 9 (DW_TAG_member)
    <8ab>   DW_AT_name        : (indirect string, offset: 0xe2de6): stack_mem
    <8af>   DW_AT_decl_file   : 5
    <8b0>   DW_AT_decl_line   : 223
    <8b1>   DW_AT_decl_column : 27
    <8b2>   DW_AT_type        : <0x679>
    <8b6>   DW_AT_data_member_location: 16
 <2><8b7>: Abbrev Number: 9 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0xe265a): stack_size
    <8bc>   DW_AT_decl_file   : 5
    <8bd>   DW_AT_decl_line   : 224
    <8be>   DW_AT_decl_column : 27
    <8bf>   DW_AT_type        : <0x604>
    <8c3>   DW_AT_data_member_location: 20
 <2><8c4>: Abbrev Number: 9 (DW_TAG_member)
    <8c5>   DW_AT_name        : (indirect string, offset: 0xe2076): priority
    <8c9>   DW_AT_decl_file   : 5
    <8ca>   DW_AT_decl_line   : 225
    <8cb>   DW_AT_decl_column : 29
    <8cc>   DW_AT_type        : <0x7e3>
    <8d0>   DW_AT_data_member_location: 24
 <2><8d1>: Abbrev Number: 9 (DW_TAG_member)
    <8d2>   DW_AT_name        : (indirect string, offset: 0xe210f): tz_module
    <8d6>   DW_AT_decl_file   : 5
    <8d7>   DW_AT_decl_line   : 226
    <8d8>   DW_AT_decl_column : 28
    <8d9>   DW_AT_type        : <0x861>
    <8dd>   DW_AT_data_member_location: 28
 <2><8de>: Abbrev Number: 9 (DW_TAG_member)
    <8df>   DW_AT_name        : (indirect string, offset: 0xe2dae): reserved
    <8e3>   DW_AT_decl_file   : 5
    <8e4>   DW_AT_decl_line   : 227
    <8e5>   DW_AT_decl_column : 29
    <8e6>   DW_AT_type        : <0x604>
    <8ea>   DW_AT_data_member_location: 32
 <2><8eb>: Abbrev Number: 0
 <1><8ec>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ed>   DW_AT_name        : (indirect string, offset: 0xe19cc): osThreadAttr_t
    <8f1>   DW_AT_decl_file   : 5
    <8f2>   DW_AT_decl_line   : 228
    <8f3>   DW_AT_decl_column : 3
    <8f4>   DW_AT_type        : <0x86d>
 <1><8f8>: Abbrev Number: 6 (DW_TAG_const_type)
    <8f9>   DW_AT_type        : <0x8ec>
 <1><8fd>: Abbrev Number: 20 (DW_TAG_structure_type)
    <8fe>   DW_AT_byte_size   : 24
    <8ff>   DW_AT_decl_file   : 5
    <900>   DW_AT_decl_line   : 273
    <902>   DW_AT_decl_column : 9
    <903>   DW_AT_sibling     : <0x95c>
 <2><907>: Abbrev Number: 21 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0xc92a5): name
    <90c>   DW_AT_decl_file   : 5
    <90d>   DW_AT_decl_line   : 274
    <90f>   DW_AT_decl_column : 33
    <910>   DW_AT_type        : <0x68d>
    <914>   DW_AT_data_member_location: 0
 <2><915>: Abbrev Number: 21 (DW_TAG_member)
    <916>   DW_AT_name        : (indirect string, offset: 0xe272b): attr_bits
    <91a>   DW_AT_decl_file   : 5
    <91b>   DW_AT_decl_line   : 275
    <91d>   DW_AT_decl_column : 28
    <91e>   DW_AT_type        : <0x604>
    <922>   DW_AT_data_member_location: 4
 <2><923>: Abbrev Number: 21 (DW_TAG_member)
    <924>   DW_AT_name        : (indirect string, offset: 0xe1b7e): cb_mem
    <928>   DW_AT_decl_file   : 5
    <929>   DW_AT_decl_line   : 276
    <92b>   DW_AT_decl_column : 30
    <92c>   DW_AT_type        : <0x679>
    <930>   DW_AT_data_member_location: 8
 <2><931>: Abbrev Number: 21 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0xe2f5c): cb_size
    <936>   DW_AT_decl_file   : 5
    <937>   DW_AT_decl_line   : 277
    <939>   DW_AT_decl_column : 30
    <93a>   DW_AT_type        : <0x604>
    <93e>   DW_AT_data_member_location: 12
 <2><93f>: Abbrev Number: 21 (DW_TAG_member)
    <940>   DW_AT_name        : (indirect string, offset: 0xe206f): mq_mem
    <944>   DW_AT_decl_file   : 5
    <945>   DW_AT_decl_line   : 278
    <947>   DW_AT_decl_column : 30
    <948>   DW_AT_type        : <0x679>
    <94c>   DW_AT_data_member_location: 16
 <2><94d>: Abbrev Number: 21 (DW_TAG_member)
    <94e>   DW_AT_name        : (indirect string, offset: 0xe2d93): mq_size
    <952>   DW_AT_decl_file   : 5
    <953>   DW_AT_decl_line   : 279
    <955>   DW_AT_decl_column : 30
    <956>   DW_AT_type        : <0x604>
    <95a>   DW_AT_data_member_location: 20
 <2><95b>: Abbrev Number: 0
 <1><95c>: Abbrev Number: 22 (DW_TAG_typedef)
    <95d>   DW_AT_name        : (indirect string, offset: 0xe21a2): osMessageQueueAttr_t
    <961>   DW_AT_decl_file   : 5
    <962>   DW_AT_decl_line   : 280
    <964>   DW_AT_decl_column : 3
    <965>   DW_AT_type        : <0x8fd>
 <1><969>: Abbrev Number: 6 (DW_TAG_const_type)
    <96a>   DW_AT_type        : <0x95c>
 <1><96e>: Abbrev Number: 23 (DW_TAG_variable)
    <96f>   DW_AT_name        : (indirect string, offset: 0xe2e45): debugMessageQueue
    <973>   DW_AT_decl_file   : 6
    <974>   DW_AT_decl_line   : 15
    <975>   DW_AT_decl_column : 27
    <976>   DW_AT_type        : <0x855>
    <97a>   DW_AT_external    : 1
    <97a>   DW_AT_declaration : 1
 <1><97a>: Abbrev Number: 23 (DW_TAG_variable)
    <97b>   DW_AT_name        : (indirect string, offset: 0xe2fd7): txMessageQueue
    <97f>   DW_AT_decl_file   : 6
    <980>   DW_AT_decl_line   : 16
    <981>   DW_AT_decl_column : 27
    <982>   DW_AT_type        : <0x855>
    <986>   DW_AT_external    : 1
    <986>   DW_AT_declaration : 1
 <1><986>: Abbrev Number: 10 (DW_TAG_array_type)
    <987>   DW_AT_type        : <0x604>
    <98b>   DW_AT_sibling     : <0x996>
 <2><98f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <990>   DW_AT_type        : <0x5e7>
    <994>   DW_AT_upper_bound : 7
 <2><995>: Abbrev Number: 0
 <1><996>: Abbrev Number: 7 (DW_TAG_structure_type)
    <997>   DW_AT_byte_size   : 16
    <998>   DW_AT_decl_file   : 7
    <999>   DW_AT_decl_line   : 215
    <99a>   DW_AT_decl_column : 9
    <99b>   DW_AT_sibling     : <0x9d4>
 <2><99f>: Abbrev Number: 8 (DW_TAG_member)
    <9a0>   DW_AT_name        : TIR
    <9a4>   DW_AT_decl_file   : 7
    <9a5>   DW_AT_decl_line   : 217
    <9a6>   DW_AT_decl_column : 17
    <9a7>   DW_AT_type        : <0x610>
    <9ab>   DW_AT_data_member_location: 0
 <2><9ac>: Abbrev Number: 9 (DW_TAG_member)
    <9ad>   DW_AT_name        : (indirect string, offset: 0xe22f4): TDTR
    <9b1>   DW_AT_decl_file   : 7
    <9b2>   DW_AT_decl_line   : 218
    <9b3>   DW_AT_decl_column : 17
    <9b4>   DW_AT_type        : <0x610>
    <9b8>   DW_AT_data_member_location: 4
 <2><9b9>: Abbrev Number: 9 (DW_TAG_member)
    <9ba>   DW_AT_name        : (indirect string, offset: 0xe21f5): TDLR
    <9be>   DW_AT_decl_file   : 7
    <9bf>   DW_AT_decl_line   : 219
    <9c0>   DW_AT_decl_column : 17
    <9c1>   DW_AT_type        : <0x610>
    <9c5>   DW_AT_data_member_location: 8
 <2><9c6>: Abbrev Number: 9 (DW_TAG_member)
    <9c7>   DW_AT_name        : (indirect string, offset: 0xe21e3): TDHR
    <9cb>   DW_AT_decl_file   : 7
    <9cc>   DW_AT_decl_line   : 220
    <9cd>   DW_AT_decl_column : 17
    <9ce>   DW_AT_type        : <0x610>
    <9d2>   DW_AT_data_member_location: 12
 <2><9d3>: Abbrev Number: 0
 <1><9d4>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d5>   DW_AT_name        : (indirect string, offset: 0xe24be): CAN_TxMailBox_TypeDef
    <9d9>   DW_AT_decl_file   : 7
    <9da>   DW_AT_decl_line   : 221
    <9db>   DW_AT_decl_column : 3
    <9dc>   DW_AT_type        : <0x996>
 <1><9e0>: Abbrev Number: 7 (DW_TAG_structure_type)
    <9e1>   DW_AT_byte_size   : 16
    <9e2>   DW_AT_decl_file   : 7
    <9e3>   DW_AT_decl_line   : 227
    <9e4>   DW_AT_decl_column : 9
    <9e5>   DW_AT_sibling     : <0xa1e>
 <2><9e9>: Abbrev Number: 8 (DW_TAG_member)
    <9ea>   DW_AT_name        : RIR
    <9ee>   DW_AT_decl_file   : 7
    <9ef>   DW_AT_decl_line   : 229
    <9f0>   DW_AT_decl_column : 17
    <9f1>   DW_AT_type        : <0x610>
    <9f5>   DW_AT_data_member_location: 0
 <2><9f6>: Abbrev Number: 9 (DW_TAG_member)
    <9f7>   DW_AT_name        : (indirect string, offset: 0xe1911): RDTR
    <9fb>   DW_AT_decl_file   : 7
    <9fc>   DW_AT_decl_line   : 230
    <9fd>   DW_AT_decl_column : 17
    <9fe>   DW_AT_type        : <0x610>
    <a02>   DW_AT_data_member_location: 4
 <2><a03>: Abbrev Number: 9 (DW_TAG_member)
    <a04>   DW_AT_name        : (indirect string, offset: 0xe18c5): RDLR
    <a08>   DW_AT_decl_file   : 7
    <a09>   DW_AT_decl_line   : 231
    <a0a>   DW_AT_decl_column : 17
    <a0b>   DW_AT_type        : <0x610>
    <a0f>   DW_AT_data_member_location: 8
 <2><a10>: Abbrev Number: 9 (DW_TAG_member)
    <a11>   DW_AT_name        : (indirect string, offset: 0xe18c0): RDHR
    <a15>   DW_AT_decl_file   : 7
    <a16>   DW_AT_decl_line   : 232
    <a17>   DW_AT_decl_column : 17
    <a18>   DW_AT_type        : <0x610>
    <a1c>   DW_AT_data_member_location: 12
 <2><a1d>: Abbrev Number: 0
 <1><a1e>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1f>   DW_AT_name        : (indirect string, offset: 0xe1bd6): CAN_FIFOMailBox_TypeDef
    <a23>   DW_AT_decl_file   : 7
    <a24>   DW_AT_decl_line   : 233
    <a25>   DW_AT_decl_column : 3
    <a26>   DW_AT_type        : <0x9e0>
 <1><a2a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a2b>   DW_AT_byte_size   : 8
    <a2c>   DW_AT_decl_file   : 7
    <a2d>   DW_AT_decl_line   : 239
    <a2e>   DW_AT_decl_column : 9
    <a2f>   DW_AT_sibling     : <0xa4e>
 <2><a33>: Abbrev Number: 8 (DW_TAG_member)
    <a34>   DW_AT_name        : FR1
    <a38>   DW_AT_decl_file   : 7
    <a39>   DW_AT_decl_line   : 241
    <a3a>   DW_AT_decl_column : 17
    <a3b>   DW_AT_type        : <0x610>
    <a3f>   DW_AT_data_member_location: 0
 <2><a40>: Abbrev Number: 8 (DW_TAG_member)
    <a41>   DW_AT_name        : FR2
    <a45>   DW_AT_decl_file   : 7
    <a46>   DW_AT_decl_line   : 242
    <a47>   DW_AT_decl_column : 17
    <a48>   DW_AT_type        : <0x610>
    <a4c>   DW_AT_data_member_location: 4
 <2><a4d>: Abbrev Number: 0
 <1><a4e>: Abbrev Number: 3 (DW_TAG_typedef)
    <a4f>   DW_AT_name        : (indirect string, offset: 0xe220d): CAN_FilterRegister_TypeDef
    <a53>   DW_AT_decl_file   : 7
    <a54>   DW_AT_decl_line   : 243
    <a55>   DW_AT_decl_column : 3
    <a56>   DW_AT_type        : <0xa2a>
 <1><a5a>: Abbrev Number: 24 (DW_TAG_structure_type)
    <a5b>   DW_AT_byte_size   : 800
    <a5d>   DW_AT_decl_file   : 7
    <a5e>   DW_AT_decl_line   : 249
    <a5f>   DW_AT_decl_column : 9
    <a60>   DW_AT_sibling     : <0xba1>
 <2><a64>: Abbrev Number: 8 (DW_TAG_member)
    <a65>   DW_AT_name        : MCR
    <a69>   DW_AT_decl_file   : 7
    <a6a>   DW_AT_decl_line   : 251
    <a6b>   DW_AT_decl_column : 30
    <a6c>   DW_AT_type        : <0x610>
    <a70>   DW_AT_data_member_location: 0
 <2><a71>: Abbrev Number: 8 (DW_TAG_member)
    <a72>   DW_AT_name        : MSR
    <a76>   DW_AT_decl_file   : 7
    <a77>   DW_AT_decl_line   : 252
    <a78>   DW_AT_decl_column : 30
    <a79>   DW_AT_type        : <0x610>
    <a7d>   DW_AT_data_member_location: 4
 <2><a7e>: Abbrev Number: 8 (DW_TAG_member)
    <a7f>   DW_AT_name        : TSR
    <a83>   DW_AT_decl_file   : 7
    <a84>   DW_AT_decl_line   : 253
    <a85>   DW_AT_decl_column : 30
    <a86>   DW_AT_type        : <0x610>
    <a8a>   DW_AT_data_member_location: 8
 <2><a8b>: Abbrev Number: 9 (DW_TAG_member)
    <a8c>   DW_AT_name        : (indirect string, offset: 0xe1e8b): RF0R
    <a90>   DW_AT_decl_file   : 7
    <a91>   DW_AT_decl_line   : 254
    <a92>   DW_AT_decl_column : 30
    <a93>   DW_AT_type        : <0x610>
    <a97>   DW_AT_data_member_location: 12
 <2><a98>: Abbrev Number: 9 (DW_TAG_member)
    <a99>   DW_AT_name        : (indirect string, offset: 0xe1e90): RF1R
    <a9d>   DW_AT_decl_file   : 7
    <a9e>   DW_AT_decl_line   : 255
    <a9f>   DW_AT_decl_column : 30
    <aa0>   DW_AT_type        : <0x610>
    <aa4>   DW_AT_data_member_location: 16
 <2><aa5>: Abbrev Number: 25 (DW_TAG_member)
    <aa6>   DW_AT_name        : IER
    <aaa>   DW_AT_decl_file   : 7
    <aab>   DW_AT_decl_line   : 256
    <aad>   DW_AT_decl_column : 30
    <aae>   DW_AT_type        : <0x610>
    <ab2>   DW_AT_data_member_location: 20
 <2><ab3>: Abbrev Number: 25 (DW_TAG_member)
    <ab4>   DW_AT_name        : ESR
    <ab8>   DW_AT_decl_file   : 7
    <ab9>   DW_AT_decl_line   : 257
    <abb>   DW_AT_decl_column : 30
    <abc>   DW_AT_type        : <0x610>
    <ac0>   DW_AT_data_member_location: 24
 <2><ac1>: Abbrev Number: 25 (DW_TAG_member)
    <ac2>   DW_AT_name        : BTR
    <ac6>   DW_AT_decl_file   : 7
    <ac7>   DW_AT_decl_line   : 258
    <ac9>   DW_AT_decl_column : 30
    <aca>   DW_AT_type        : <0x610>
    <ace>   DW_AT_data_member_location: 28
 <2><acf>: Abbrev Number: 21 (DW_TAG_member)
    <ad0>   DW_AT_name        : (indirect string, offset: 0xe2f1b): RESERVED0
    <ad4>   DW_AT_decl_file   : 7
    <ad5>   DW_AT_decl_line   : 259
    <ad7>   DW_AT_decl_column : 30
    <ad8>   DW_AT_type        : <0xba1>
    <adc>   DW_AT_data_member_location: 32
 <2><add>: Abbrev Number: 26 (DW_TAG_member)
    <ade>   DW_AT_name        : (indirect string, offset: 0xe1f6b): sTxMailBox
    <ae2>   DW_AT_decl_file   : 7
    <ae3>   DW_AT_decl_line   : 260
    <ae5>   DW_AT_decl_column : 30
    <ae6>   DW_AT_type        : <0xbb1>
    <aea>   DW_AT_data_member_location: 384
 <2><aec>: Abbrev Number: 26 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0xe1bee): sFIFOMailBox
    <af1>   DW_AT_decl_file   : 7
    <af2>   DW_AT_decl_line   : 261
    <af4>   DW_AT_decl_column : 30
    <af5>   DW_AT_type        : <0xbc1>
    <af9>   DW_AT_data_member_location: 432
 <2><afb>: Abbrev Number: 26 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0xe2f25): RESERVED1
    <b00>   DW_AT_decl_file   : 7
    <b01>   DW_AT_decl_line   : 262
    <b03>   DW_AT_decl_column : 30
    <b04>   DW_AT_type        : <0xbd1>
    <b08>   DW_AT_data_member_location: 464
 <2><b0a>: Abbrev Number: 27 (DW_TAG_member)
    <b0b>   DW_AT_name        : FMR
    <b0f>   DW_AT_decl_file   : 7
    <b10>   DW_AT_decl_line   : 263
    <b12>   DW_AT_decl_column : 30
    <b13>   DW_AT_type        : <0x610>
    <b17>   DW_AT_data_member_location: 512
 <2><b19>: Abbrev Number: 26 (DW_TAG_member)
    <b1a>   DW_AT_name        : (indirect string, offset: 0xe17c5): FM1R
    <b1e>   DW_AT_decl_file   : 7
    <b1f>   DW_AT_decl_line   : 264
    <b21>   DW_AT_decl_column : 30
    <b22>   DW_AT_type        : <0x610>
    <b26>   DW_AT_data_member_location: 516
 <2><b28>: Abbrev Number: 26 (DW_TAG_member)
    <b29>   DW_AT_name        : (indirect string, offset: 0xe2f2f): RESERVED2
    <b2d>   DW_AT_decl_file   : 7
    <b2e>   DW_AT_decl_line   : 265
    <b30>   DW_AT_decl_column : 30
    <b31>   DW_AT_type        : <0x604>
    <b35>   DW_AT_data_member_location: 520
 <2><b37>: Abbrev Number: 26 (DW_TAG_member)
    <b38>   DW_AT_name        : (indirect string, offset: 0xe2da9): FS1R
    <b3c>   DW_AT_decl_file   : 7
    <b3d>   DW_AT_decl_line   : 266
    <b3f>   DW_AT_decl_column : 30
    <b40>   DW_AT_type        : <0x610>
    <b44>   DW_AT_data_member_location: 524
 <2><b46>: Abbrev Number: 26 (DW_TAG_member)
    <b47>   DW_AT_name        : (indirect string, offset: 0xe2f39): RESERVED3
    <b4b>   DW_AT_decl_file   : 7
    <b4c>   DW_AT_decl_line   : 267
    <b4e>   DW_AT_decl_column : 30
    <b4f>   DW_AT_type        : <0x604>
    <b53>   DW_AT_data_member_location: 528
 <2><b55>: Abbrev Number: 26 (DW_TAG_member)
    <b56>   DW_AT_name        : (indirect string, offset: 0xe2745): FFA1R
    <b5a>   DW_AT_decl_file   : 7
    <b5b>   DW_AT_decl_line   : 268
    <b5d>   DW_AT_decl_column : 30
    <b5e>   DW_AT_type        : <0x610>
    <b62>   DW_AT_data_member_location: 532
 <2><b64>: Abbrev Number: 26 (DW_TAG_member)
    <b65>   DW_AT_name        : (indirect string, offset: 0xe24b4): RESERVED4
    <b69>   DW_AT_decl_file   : 7
    <b6a>   DW_AT_decl_line   : 269
    <b6c>   DW_AT_decl_column : 30
    <b6d>   DW_AT_type        : <0x604>
    <b71>   DW_AT_data_member_location: 536
 <2><b73>: Abbrev Number: 26 (DW_TAG_member)
    <b74>   DW_AT_name        : (indirect string, offset: 0xe2746): FA1R
    <b78>   DW_AT_decl_file   : 7
    <b79>   DW_AT_decl_line   : 270
    <b7b>   DW_AT_decl_column : 30
    <b7c>   DW_AT_type        : <0x610>
    <b80>   DW_AT_data_member_location: 540
 <2><b82>: Abbrev Number: 26 (DW_TAG_member)
    <b83>   DW_AT_name        : (indirect string, offset: 0xe2f43): RESERVED5
    <b87>   DW_AT_decl_file   : 7
    <b88>   DW_AT_decl_line   : 271
    <b8a>   DW_AT_decl_column : 30
    <b8b>   DW_AT_type        : <0x986>
    <b8f>   DW_AT_data_member_location: 544
 <2><b91>: Abbrev Number: 26 (DW_TAG_member)
    <b92>   DW_AT_name        : (indirect string, offset: 0xe2496): sFilterRegister
    <b96>   DW_AT_decl_file   : 7
    <b97>   DW_AT_decl_line   : 272
    <b99>   DW_AT_decl_column : 30
    <b9a>   DW_AT_type        : <0xbe1>
    <b9e>   DW_AT_data_member_location: 576
 <2><ba0>: Abbrev Number: 0
 <1><ba1>: Abbrev Number: 10 (DW_TAG_array_type)
    <ba2>   DW_AT_type        : <0x604>
    <ba6>   DW_AT_sibling     : <0xbb1>
 <2><baa>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <bab>   DW_AT_type        : <0x5e7>
    <baf>   DW_AT_upper_bound : 87
 <2><bb0>: Abbrev Number: 0
 <1><bb1>: Abbrev Number: 10 (DW_TAG_array_type)
    <bb2>   DW_AT_type        : <0x9d4>
    <bb6>   DW_AT_sibling     : <0xbc1>
 <2><bba>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <bbb>   DW_AT_type        : <0x5e7>
    <bbf>   DW_AT_upper_bound : 2
 <2><bc0>: Abbrev Number: 0
 <1><bc1>: Abbrev Number: 10 (DW_TAG_array_type)
    <bc2>   DW_AT_type        : <0xa1e>
    <bc6>   DW_AT_sibling     : <0xbd1>
 <2><bca>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <bcb>   DW_AT_type        : <0x5e7>
    <bcf>   DW_AT_upper_bound : 1
 <2><bd0>: Abbrev Number: 0
 <1><bd1>: Abbrev Number: 10 (DW_TAG_array_type)
    <bd2>   DW_AT_type        : <0x604>
    <bd6>   DW_AT_sibling     : <0xbe1>
 <2><bda>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <bdb>   DW_AT_type        : <0x5e7>
    <bdf>   DW_AT_upper_bound : 11
 <2><be0>: Abbrev Number: 0
 <1><be1>: Abbrev Number: 10 (DW_TAG_array_type)
    <be2>   DW_AT_type        : <0xa4e>
    <be6>   DW_AT_sibling     : <0xbf1>
 <2><bea>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <beb>   DW_AT_type        : <0x5e7>
    <bef>   DW_AT_upper_bound : 27
 <2><bf0>: Abbrev Number: 0
 <1><bf1>: Abbrev Number: 22 (DW_TAG_typedef)
    <bf2>   DW_AT_name        : (indirect string, offset: 0xe2d87): CAN_TypeDef
    <bf6>   DW_AT_decl_file   : 7
    <bf7>   DW_AT_decl_line   : 273
    <bf9>   DW_AT_decl_column : 3
    <bfa>   DW_AT_type        : <0xa5a>
 <1><bfe>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <bff>   DW_AT_encoding    : 7	(unsigned)
    <c00>   DW_AT_byte_size   : 1
    <c01>   DW_AT_type        : <0x5a3>
    <c05>   DW_AT_decl_file   : 8
    <c06>   DW_AT_decl_line   : 192
    <c07>   DW_AT_decl_column : 1
    <c08>   DW_AT_sibling     : <0xc19>
 <2><c0c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x2cf80): DISABLE
    <c11>   DW_AT_const_value : 0
 <2><c12>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c13>   DW_AT_name        : (indirect string, offset: 0x33c4f): ENABLE
    <c17>   DW_AT_const_value : 1
 <2><c18>: Abbrev Number: 0
 <1><c19>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1a>   DW_AT_name        : (indirect string, offset: 0xe2c03): FunctionalState
    <c1e>   DW_AT_decl_file   : 8
    <c1f>   DW_AT_decl_line   : 195
    <c20>   DW_AT_decl_column : 3
    <c21>   DW_AT_type        : <0xbfe>
 <1><c25>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <c26>   DW_AT_encoding    : 7	(unsigned)
    <c27>   DW_AT_byte_size   : 1
    <c28>   DW_AT_type        : <0x5a3>
    <c2c>   DW_AT_decl_file   : 9
    <c2d>   DW_AT_decl_line   : 39
    <c2e>   DW_AT_decl_column : 1
    <c2f>   DW_AT_sibling     : <0xc4c>
 <2><c33>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c34>   DW_AT_name        : (indirect string, offset: 0xe1eb2): HAL_OK
    <c38>   DW_AT_const_value : 0
 <2><c39>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c3a>   DW_AT_name        : (indirect string, offset: 0xe25ba): HAL_ERROR
    <c3e>   DW_AT_const_value : 1
 <2><c3f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c40>   DW_AT_name        : (indirect string, offset: 0xe1a8c): HAL_BUSY
    <c44>   DW_AT_const_value : 2
 <2><c45>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c46>   DW_AT_name        : (indirect string, offset: 0xe1dd7): HAL_TIMEOUT
    <c4a>   DW_AT_const_value : 3
 <2><c4b>: Abbrev Number: 0
 <1><c4c>: Abbrev Number: 3 (DW_TAG_typedef)
    <c4d>   DW_AT_name        : (indirect string, offset: 0xe16d5): HAL_StatusTypeDef
    <c51>   DW_AT_decl_file   : 9
    <c52>   DW_AT_decl_line   : 44
    <c53>   DW_AT_decl_column : 3
    <c54>   DW_AT_type        : <0xc25>
 <1><c58>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <c59>   DW_AT_encoding    : 7	(unsigned)
    <c5a>   DW_AT_byte_size   : 1
    <c5b>   DW_AT_type        : <0x5a3>
    <c5f>   DW_AT_decl_file   : 10
    <c60>   DW_AT_decl_line   : 47
    <c61>   DW_AT_decl_column : 1
    <c62>   DW_AT_sibling     : <0xc8b>
 <2><c66>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c67>   DW_AT_name        : (indirect string, offset: 0xe274b): HAL_CAN_STATE_RESET
    <c6b>   DW_AT_const_value : 0
 <2><c6c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c6d>   DW_AT_name        : (indirect string, offset: 0xe1b30): HAL_CAN_STATE_READY
    <c71>   DW_AT_const_value : 1
 <2><c72>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c73>   DW_AT_name        : (indirect string, offset: 0xe237f): HAL_CAN_STATE_LISTENING
    <c77>   DW_AT_const_value : 2
 <2><c78>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c79>   DW_AT_name        : (indirect string, offset: 0xe2db7): HAL_CAN_STATE_SLEEP_PENDING
    <c7d>   DW_AT_const_value : 3
 <2><c7e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c7f>   DW_AT_name        : (indirect string, offset: 0xe1757): HAL_CAN_STATE_SLEEP_ACTIVE
    <c83>   DW_AT_const_value : 4
 <2><c84>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c85>   DW_AT_name        : (indirect string, offset: 0xe2a7f): HAL_CAN_STATE_ERROR
    <c89>   DW_AT_const_value : 5
 <2><c8a>: Abbrev Number: 0
 <1><c8b>: Abbrev Number: 3 (DW_TAG_typedef)
    <c8c>   DW_AT_name        : (indirect string, offset: 0xe2ca0): HAL_CAN_StateTypeDef
    <c90>   DW_AT_decl_file   : 10
    <c91>   DW_AT_decl_line   : 55
    <c92>   DW_AT_decl_column : 3
    <c93>   DW_AT_type        : <0xc58>
 <1><c97>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c98>   DW_AT_type        : <0xc8b>
 <1><c9c>: Abbrev Number: 7 (DW_TAG_structure_type)
    <c9d>   DW_AT_byte_size   : 28
    <c9e>   DW_AT_decl_file   : 10
    <c9f>   DW_AT_decl_line   : 60
    <ca0>   DW_AT_decl_column : 9
    <ca1>   DW_AT_sibling     : <0xd35>
 <2><ca5>: Abbrev Number: 9 (DW_TAG_member)
    <ca6>   DW_AT_name        : (indirect string, offset: 0xe488f): Prescaler
    <caa>   DW_AT_decl_file   : 10
    <cab>   DW_AT_decl_line   : 62
    <cac>   DW_AT_decl_column : 12
    <cad>   DW_AT_type        : <0x604>
    <cb1>   DW_AT_data_member_location: 0
 <2><cb2>: Abbrev Number: 9 (DW_TAG_member)
    <cb3>   DW_AT_name        : (indirect string, offset: 0xe67e8): Mode
    <cb7>   DW_AT_decl_file   : 10
    <cb8>   DW_AT_decl_line   : 65
    <cb9>   DW_AT_decl_column : 12
    <cba>   DW_AT_type        : <0x604>
    <cbe>   DW_AT_data_member_location: 4
 <2><cbf>: Abbrev Number: 9 (DW_TAG_member)
    <cc0>   DW_AT_name        : (indirect string, offset: 0xe1939): SyncJumpWidth
    <cc4>   DW_AT_decl_file   : 10
    <cc5>   DW_AT_decl_line   : 68
    <cc6>   DW_AT_decl_column : 12
    <cc7>   DW_AT_type        : <0x604>
    <ccb>   DW_AT_data_member_location: 8
 <2><ccc>: Abbrev Number: 9 (DW_TAG_member)
    <ccd>   DW_AT_name        : (indirect string, offset: 0xe2133): TimeSeg1
    <cd1>   DW_AT_decl_file   : 10
    <cd2>   DW_AT_decl_line   : 72
    <cd3>   DW_AT_decl_column : 12
    <cd4>   DW_AT_type        : <0x604>
    <cd8>   DW_AT_data_member_location: 12
 <2><cd9>: Abbrev Number: 9 (DW_TAG_member)
    <cda>   DW_AT_name        : (indirect string, offset: 0xe213c): TimeSeg2
    <cde>   DW_AT_decl_file   : 10
    <cdf>   DW_AT_decl_line   : 75
    <ce0>   DW_AT_decl_column : 12
    <ce1>   DW_AT_type        : <0x604>
    <ce5>   DW_AT_data_member_location: 16
 <2><ce6>: Abbrev Number: 9 (DW_TAG_member)
    <ce7>   DW_AT_name        : (indirect string, offset: 0xe185c): TimeTriggeredMode
    <ceb>   DW_AT_decl_file   : 10
    <cec>   DW_AT_decl_line   : 78
    <ced>   DW_AT_decl_column : 19
    <cee>   DW_AT_type        : <0xc19>
    <cf2>   DW_AT_data_member_location: 20
 <2><cf3>: Abbrev Number: 9 (DW_TAG_member)
    <cf4>   DW_AT_name        : (indirect string, offset: 0xe2895): AutoBusOff
    <cf8>   DW_AT_decl_file   : 10
    <cf9>   DW_AT_decl_line   : 81
    <cfa>   DW_AT_decl_column : 19
    <cfb>   DW_AT_type        : <0xc19>
    <cff>   DW_AT_data_member_location: 21
 <2><d00>: Abbrev Number: 9 (DW_TAG_member)
    <d01>   DW_AT_name        : (indirect string, offset: 0xe1e95): AutoWakeUp
    <d05>   DW_AT_decl_file   : 10
    <d06>   DW_AT_decl_line   : 84
    <d07>   DW_AT_decl_column : 19
    <d08>   DW_AT_type        : <0xc19>
    <d0c>   DW_AT_data_member_location: 22
 <2><d0d>: Abbrev Number: 9 (DW_TAG_member)
    <d0e>   DW_AT_name        : (indirect string, offset: 0xe30b8): AutoRetransmission
    <d12>   DW_AT_decl_file   : 10
    <d13>   DW_AT_decl_line   : 87
    <d14>   DW_AT_decl_column : 19
    <d15>   DW_AT_type        : <0xc19>
    <d19>   DW_AT_data_member_location: 23
 <2><d1a>: Abbrev Number: 9 (DW_TAG_member)
    <d1b>   DW_AT_name        : (indirect string, offset: 0xe1ea0): ReceiveFifoLocked
    <d1f>   DW_AT_decl_file   : 10
    <d20>   DW_AT_decl_line   : 90
    <d21>   DW_AT_decl_column : 19
    <d22>   DW_AT_type        : <0xc19>
    <d26>   DW_AT_data_member_location: 24
 <2><d27>: Abbrev Number: 9 (DW_TAG_member)
    <d28>   DW_AT_name        : (indirect string, offset: 0xe2a30): TransmitFifoPriority
    <d2c>   DW_AT_decl_file   : 10
    <d2d>   DW_AT_decl_line   : 93
    <d2e>   DW_AT_decl_column : 19
    <d2f>   DW_AT_type        : <0xc19>
    <d33>   DW_AT_data_member_location: 25
 <2><d34>: Abbrev Number: 0
 <1><d35>: Abbrev Number: 3 (DW_TAG_typedef)
    <d36>   DW_AT_name        : (indirect string, offset: 0xe1ab1): CAN_InitTypeDef
    <d3a>   DW_AT_decl_file   : 10
    <d3b>   DW_AT_decl_line   : 96
    <d3c>   DW_AT_decl_column : 3
    <d3d>   DW_AT_type        : <0xc9c>
 <1><d41>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d42>   DW_AT_byte_size   : 40
    <d43>   DW_AT_decl_file   : 10
    <d44>   DW_AT_decl_line   : 101
    <d45>   DW_AT_decl_column : 9
    <d46>   DW_AT_sibling     : <0xdcd>
 <2><d4a>: Abbrev Number: 9 (DW_TAG_member)
    <d4b>   DW_AT_name        : (indirect string, offset: 0xe1ba2): FilterIdHigh
    <d4f>   DW_AT_decl_file   : 10
    <d50>   DW_AT_decl_line   : 103
    <d51>   DW_AT_decl_column : 12
    <d52>   DW_AT_type        : <0x604>
    <d56>   DW_AT_data_member_location: 0
 <2><d57>: Abbrev Number: 9 (DW_TAG_member)
    <d58>   DW_AT_name        : (indirect string, offset: 0xe2ab1): FilterIdLow
    <d5c>   DW_AT_decl_file   : 10
    <d5d>   DW_AT_decl_line   : 108
    <d5e>   DW_AT_decl_column : 12
    <d5f>   DW_AT_type        : <0x604>
    <d63>   DW_AT_data_member_location: 4
 <2><d64>: Abbrev Number: 9 (DW_TAG_member)
    <d65>   DW_AT_name        : (indirect string, offset: 0xe1b91): FilterMaskIdHigh
    <d69>   DW_AT_decl_file   : 10
    <d6a>   DW_AT_decl_line   : 113
    <d6b>   DW_AT_decl_column : 12
    <d6c>   DW_AT_type        : <0x604>
    <d70>   DW_AT_data_member_location: 8
 <2><d71>: Abbrev Number: 9 (DW_TAG_member)
    <d72>   DW_AT_name        : (indirect string, offset: 0xe2ef0): FilterMaskIdLow
    <d76>   DW_AT_decl_file   : 10
    <d77>   DW_AT_decl_line   : 119
    <d78>   DW_AT_decl_column : 12
    <d79>   DW_AT_type        : <0x604>
    <d7d>   DW_AT_data_member_location: 12
 <2><d7e>: Abbrev Number: 9 (DW_TAG_member)
    <d7f>   DW_AT_name        : (indirect string, offset: 0xe2f64): FilterFIFOAssignment
    <d83>   DW_AT_decl_file   : 10
    <d84>   DW_AT_decl_line   : 125
    <d85>   DW_AT_decl_column : 12
    <d86>   DW_AT_type        : <0x604>
    <d8a>   DW_AT_data_member_location: 16
 <2><d8b>: Abbrev Number: 9 (DW_TAG_member)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xe2a61): FilterBank
    <d90>   DW_AT_decl_file   : 10
    <d91>   DW_AT_decl_line   : 128
    <d92>   DW_AT_decl_column : 12
    <d93>   DW_AT_type        : <0x604>
    <d97>   DW_AT_data_member_location: 20
 <2><d98>: Abbrev Number: 9 (DW_TAG_member)
    <d99>   DW_AT_name        : (indirect string, offset: 0xe207f): FilterMode
    <d9d>   DW_AT_decl_file   : 10
    <d9e>   DW_AT_decl_line   : 134
    <d9f>   DW_AT_decl_column : 12
    <da0>   DW_AT_type        : <0x604>
    <da4>   DW_AT_data_member_location: 24
 <2><da5>: Abbrev Number: 9 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0xe2e8d): FilterScale
    <daa>   DW_AT_decl_file   : 10
    <dab>   DW_AT_decl_line   : 137
    <dac>   DW_AT_decl_column : 12
    <dad>   DW_AT_type        : <0x604>
    <db1>   DW_AT_data_member_location: 28
 <2><db2>: Abbrev Number: 9 (DW_TAG_member)
    <db3>   DW_AT_name        : (indirect string, offset: 0xe1884): FilterActivation
    <db7>   DW_AT_decl_file   : 10
    <db8>   DW_AT_decl_line   : 140
    <db9>   DW_AT_decl_column : 12
    <dba>   DW_AT_type        : <0x604>
    <dbe>   DW_AT_data_member_location: 32
 <2><dbf>: Abbrev Number: 9 (DW_TAG_member)
    <dc0>   DW_AT_name        : (indirect string, offset: 0xe2a57): SlaveStartFilterBank
    <dc4>   DW_AT_decl_file   : 10
    <dc5>   DW_AT_decl_line   : 143
    <dc6>   DW_AT_decl_column : 12
    <dc7>   DW_AT_type        : <0x604>
    <dcb>   DW_AT_data_member_location: 36
 <2><dcc>: Abbrev Number: 0
 <1><dcd>: Abbrev Number: 3 (DW_TAG_typedef)
    <dce>   DW_AT_name        : (indirect string, offset: 0xe2e7b): CAN_FilterTypeDef
    <dd2>   DW_AT_decl_file   : 10
    <dd3>   DW_AT_decl_line   : 150
    <dd4>   DW_AT_decl_column : 3
    <dd5>   DW_AT_type        : <0xd41>
 <1><dd9>: Abbrev Number: 6 (DW_TAG_const_type)
    <dda>   DW_AT_type        : <0xdcd>
 <1><dde>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ddf>   DW_AT_byte_size   : 24
    <de0>   DW_AT_decl_file   : 10
    <de1>   DW_AT_decl_line   : 155
    <de2>   DW_AT_decl_column : 9
    <de3>   DW_AT_sibling     : <0xe36>
 <2><de7>: Abbrev Number: 9 (DW_TAG_member)
    <de8>   DW_AT_name        : (indirect string, offset: 0x2386e): StdId
    <dec>   DW_AT_decl_file   : 10
    <ded>   DW_AT_decl_line   : 157
    <dee>   DW_AT_decl_column : 12
    <def>   DW_AT_type        : <0x604>
    <df3>   DW_AT_data_member_location: 0
 <2><df4>: Abbrev Number: 9 (DW_TAG_member)
    <df5>   DW_AT_name        : (indirect string, offset: 0x8163f): ExtId
    <df9>   DW_AT_decl_file   : 10
    <dfa>   DW_AT_decl_line   : 160
    <dfb>   DW_AT_decl_column : 12
    <dfc>   DW_AT_type        : <0x604>
    <e00>   DW_AT_data_member_location: 4
 <2><e01>: Abbrev Number: 8 (DW_TAG_member)
    <e02>   DW_AT_name        : IDE
    <e06>   DW_AT_decl_file   : 10
    <e07>   DW_AT_decl_line   : 163
    <e08>   DW_AT_decl_column : 12
    <e09>   DW_AT_type        : <0x604>
    <e0d>   DW_AT_data_member_location: 8
 <2><e0e>: Abbrev Number: 8 (DW_TAG_member)
    <e0f>   DW_AT_name        : RTR
    <e13>   DW_AT_decl_file   : 10
    <e14>   DW_AT_decl_line   : 166
    <e15>   DW_AT_decl_column : 12
    <e16>   DW_AT_type        : <0x604>
    <e1a>   DW_AT_data_member_location: 12
 <2><e1b>: Abbrev Number: 8 (DW_TAG_member)
    <e1c>   DW_AT_name        : DLC
    <e20>   DW_AT_decl_file   : 10
    <e21>   DW_AT_decl_line   : 169
    <e22>   DW_AT_decl_column : 12
    <e23>   DW_AT_type        : <0x604>
    <e27>   DW_AT_data_member_location: 16
 <2><e28>: Abbrev Number: 9 (DW_TAG_member)
    <e29>   DW_AT_name        : (indirect string, offset: 0xe2bb0): TransmitGlobalTime
    <e2d>   DW_AT_decl_file   : 10
    <e2e>   DW_AT_decl_line   : 172
    <e2f>   DW_AT_decl_column : 19
    <e30>   DW_AT_type        : <0xc19>
    <e34>   DW_AT_data_member_location: 20
 <2><e35>: Abbrev Number: 0
 <1><e36>: Abbrev Number: 3 (DW_TAG_typedef)
    <e37>   DW_AT_name        : (indirect string, offset: 0xe1cd7): CAN_TxHeaderTypeDef
    <e3b>   DW_AT_decl_file   : 10
    <e3c>   DW_AT_decl_line   : 178
    <e3d>   DW_AT_decl_column : 3
    <e3e>   DW_AT_type        : <0xdde>
 <1><e42>: Abbrev Number: 6 (DW_TAG_const_type)
    <e43>   DW_AT_type        : <0xe36>
 <1><e47>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e48>   DW_AT_byte_size   : 28
    <e49>   DW_AT_decl_file   : 10
    <e4a>   DW_AT_decl_line   : 183
    <e4b>   DW_AT_decl_column : 9
    <e4c>   DW_AT_sibling     : <0xeac>
 <2><e50>: Abbrev Number: 9 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x2386e): StdId
    <e55>   DW_AT_decl_file   : 10
    <e56>   DW_AT_decl_line   : 185
    <e57>   DW_AT_decl_column : 12
    <e58>   DW_AT_type        : <0x604>
    <e5c>   DW_AT_data_member_location: 0
 <2><e5d>: Abbrev Number: 9 (DW_TAG_member)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x8163f): ExtId
    <e62>   DW_AT_decl_file   : 10
    <e63>   DW_AT_decl_line   : 188
    <e64>   DW_AT_decl_column : 12
    <e65>   DW_AT_type        : <0x604>
    <e69>   DW_AT_data_member_location: 4
 <2><e6a>: Abbrev Number: 8 (DW_TAG_member)
    <e6b>   DW_AT_name        : IDE
    <e6f>   DW_AT_decl_file   : 10
    <e70>   DW_AT_decl_line   : 191
    <e71>   DW_AT_decl_column : 12
    <e72>   DW_AT_type        : <0x604>
    <e76>   DW_AT_data_member_location: 8
 <2><e77>: Abbrev Number: 8 (DW_TAG_member)
    <e78>   DW_AT_name        : RTR
    <e7c>   DW_AT_decl_file   : 10
    <e7d>   DW_AT_decl_line   : 194
    <e7e>   DW_AT_decl_column : 12
    <e7f>   DW_AT_type        : <0x604>
    <e83>   DW_AT_data_member_location: 12
 <2><e84>: Abbrev Number: 8 (DW_TAG_member)
    <e85>   DW_AT_name        : DLC
    <e89>   DW_AT_decl_file   : 10
    <e8a>   DW_AT_decl_line   : 197
    <e8b>   DW_AT_decl_column : 12
    <e8c>   DW_AT_type        : <0x604>
    <e90>   DW_AT_data_member_location: 16
 <2><e91>: Abbrev Number: 9 (DW_TAG_member)
    <e92>   DW_AT_name        : (indirect string, offset: 0xe5fed): Timestamp
    <e96>   DW_AT_decl_file   : 10
    <e97>   DW_AT_decl_line   : 200
    <e98>   DW_AT_decl_column : 12
    <e99>   DW_AT_type        : <0x604>
    <e9d>   DW_AT_data_member_location: 20
 <2><e9e>: Abbrev Number: 9 (DW_TAG_member)
    <e9f>   DW_AT_name        : (indirect string, offset: 0x1e42b): FilterMatchIndex
    <ea3>   DW_AT_decl_file   : 10
    <ea4>   DW_AT_decl_line   : 204
    <ea5>   DW_AT_decl_column : 12
    <ea6>   DW_AT_type        : <0x604>
    <eaa>   DW_AT_data_member_location: 24
 <2><eab>: Abbrev Number: 0
 <1><eac>: Abbrev Number: 3 (DW_TAG_typedef)
    <ead>   DW_AT_name        : (indirect string, offset: 0xa7658): CAN_RxHeaderTypeDef
    <eb1>   DW_AT_decl_file   : 10
    <eb2>   DW_AT_decl_line   : 207
    <eb3>   DW_AT_decl_column : 3
    <eb4>   DW_AT_type        : <0xe47>
 <1><eb8>: Abbrev Number: 28 (DW_TAG_structure_type)
    <eb9>   DW_AT_name        : (indirect string, offset: 0xe22f9): __CAN_HandleTypeDef
    <ebd>   DW_AT_byte_size   : 40
    <ebe>   DW_AT_decl_file   : 10
    <ebf>   DW_AT_decl_line   : 212
    <ec0>   DW_AT_decl_column : 16
    <ec1>   DW_AT_sibling     : <0xefa>
 <2><ec5>: Abbrev Number: 9 (DW_TAG_member)
    <ec6>   DW_AT_name        : (indirect string, offset: 0xe2b67): Instance
    <eca>   DW_AT_decl_file   : 10
    <ecb>   DW_AT_decl_line   : 214
    <ecc>   DW_AT_decl_column : 32
    <ecd>   DW_AT_type        : <0xefa>
    <ed1>   DW_AT_data_member_location: 0
 <2><ed2>: Abbrev Number: 9 (DW_TAG_member)
    <ed3>   DW_AT_name        : (indirect string, offset: 0xe70ea): Init
    <ed7>   DW_AT_decl_file   : 10
    <ed8>   DW_AT_decl_line   : 216
    <ed9>   DW_AT_decl_column : 31
    <eda>   DW_AT_type        : <0xd35>
    <ede>   DW_AT_data_member_location: 4
 <2><edf>: Abbrev Number: 9 (DW_TAG_member)
    <ee0>   DW_AT_name        : (indirect string, offset: 0xe3723): State
    <ee4>   DW_AT_decl_file   : 10
    <ee5>   DW_AT_decl_line   : 218
    <ee6>   DW_AT_decl_column : 31
    <ee7>   DW_AT_type        : <0xc97>
    <eeb>   DW_AT_data_member_location: 32
 <2><eec>: Abbrev Number: 9 (DW_TAG_member)
    <eed>   DW_AT_name        : (indirect string, offset: 0xe3088): ErrorCode
    <ef1>   DW_AT_decl_file   : 10
    <ef2>   DW_AT_decl_line   : 220
    <ef3>   DW_AT_decl_column : 31
    <ef4>   DW_AT_type        : <0x610>
    <ef8>   DW_AT_data_member_location: 36
 <2><ef9>: Abbrev Number: 0
 <1><efa>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <efb>   DW_AT_byte_size   : 4
    <efc>   DW_AT_type        : <0xbf1>
 <1><f00>: Abbrev Number: 3 (DW_TAG_typedef)
    <f01>   DW_AT_name        : (indirect string, offset: 0xe22fb): CAN_HandleTypeDef
    <f05>   DW_AT_decl_file   : 10
    <f06>   DW_AT_decl_line   : 242
    <f07>   DW_AT_decl_column : 3
    <f08>   DW_AT_type        : <0xeb8>
 <1><f0c>: Abbrev Number: 6 (DW_TAG_const_type)
    <f0d>   DW_AT_type        : <0xf00>
 <1><f11>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <f12>   DW_AT_byte_size   : 4
    <f13>   DW_AT_type        : <0x5ff>
 <1><f17>: Abbrev Number: 29 (DW_TAG_variable)
    <f18>   DW_AT_name        : (indirect string, offset: 0xe170c): can_tx_task_delay
    <f1c>   DW_AT_decl_file   : 11
    <f1d>   DW_AT_decl_line   : 19
    <f1e>   DW_AT_decl_column : 23
    <f1f>   DW_AT_type        : <0x615>
    <f23>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><f29>: Abbrev Number: 29 (DW_TAG_variable)
    <f2a>   DW_AT_name        : (indirect string, offset: 0xe1ef0): can_rx_task_delay
    <f2e>   DW_AT_decl_file   : 11
    <f2f>   DW_AT_decl_line   : 21
    <f30>   DW_AT_decl_column : 23
    <f31>   DW_AT_type        : <0x615>
    <f35>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><f3b>: Abbrev Number: 23 (DW_TAG_variable)
    <f3c>   DW_AT_name        : (indirect string, offset: 0xe2044): hcan1
    <f40>   DW_AT_decl_file   : 1
    <f41>   DW_AT_decl_line   : 18
    <f42>   DW_AT_decl_column : 26
    <f43>   DW_AT_type        : <0xf00>
    <f47>   DW_AT_external    : 1
    <f47>   DW_AT_declaration : 1
 <1><f47>: Abbrev Number: 30 (DW_TAG_variable)
    <f48>   DW_AT_specification: <0x96e>
    <f4c>   DW_AT_decl_file   : 1
    <f4d>   DW_AT_decl_line   : 21
    <f4e>   DW_AT_decl_column : 20
    <f4f>   DW_AT_location    : 5 byte block: 3 a4 0 0 20 	(DW_OP_addr: 200000a4)
 <1><f55>: Abbrev Number: 30 (DW_TAG_variable)
    <f56>   DW_AT_specification: <0x97a>
    <f5a>   DW_AT_decl_file   : 1
    <f5b>   DW_AT_decl_line   : 22
    <f5c>   DW_AT_decl_column : 20
    <f5d>   DW_AT_location    : 5 byte block: 3 a8 0 0 20 	(DW_OP_addr: 200000a8)
 <1><f63>: Abbrev Number: 31 (DW_TAG_variable)
    <f64>   DW_AT_name        : (indirect string, offset: 0x84bc0): g_sendPing
    <f68>   DW_AT_decl_file   : 1
    <f69>   DW_AT_decl_line   : 24
    <f6a>   DW_AT_decl_column : 18
    <f6b>   DW_AT_type        : <0x5fa>
    <f6f>   DW_AT_external    : 1
    <f6f>   DW_AT_location    : 5 byte block: 3 ac 0 0 20 	(DW_OP_addr: 200000ac)
 <1><f75>: Abbrev Number: 31 (DW_TAG_variable)
    <f76>   DW_AT_name        : (indirect string, offset: 0xe18ab): canRxTask_attributes
    <f7a>   DW_AT_decl_file   : 1
    <f7b>   DW_AT_decl_line   : 26
    <f7c>   DW_AT_decl_column : 22
    <f7d>   DW_AT_type        : <0x8f8>
    <f81>   DW_AT_external    : 1
    <f81>   DW_AT_location    : 5 byte block: 3 8 98 0 8 	(DW_OP_addr: 8009808)
 <1><f87>: Abbrev Number: 31 (DW_TAG_variable)
    <f88>   DW_AT_name        : (indirect string, offset: 0xe1e44): canTxTask_attributes
    <f8c>   DW_AT_decl_file   : 1
    <f8d>   DW_AT_decl_line   : 32
    <f8e>   DW_AT_decl_column : 22
    <f8f>   DW_AT_type        : <0x8f8>
    <f93>   DW_AT_external    : 1
    <f93>   DW_AT_location    : 5 byte block: 3 2c 98 0 8 	(DW_OP_addr: 800982c)
 <1><f99>: Abbrev Number: 32 (DW_TAG_subprogram)
    <f9a>   DW_AT_external    : 1
    <f9a>   DW_AT_name        : (indirect string, offset: 0xe245d): osThreadNew
    <f9e>   DW_AT_decl_file   : 5
    <f9f>   DW_AT_decl_line   : 349
    <fa1>   DW_AT_decl_column : 14
    <fa2>   DW_AT_prototyped  : 1
    <fa2>   DW_AT_type        : <0x849>
    <fa6>   DW_AT_declaration : 1
    <fa6>   DW_AT_sibling     : <0xfba>
 <2><faa>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fab>   DW_AT_type        : <0x7ef>
 <2><faf>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fb0>   DW_AT_type        : <0x679>
 <2><fb4>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fb5>   DW_AT_type        : <0xfba>
 <2><fb9>: Abbrev Number: 0
 <1><fba>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <fbb>   DW_AT_byte_size   : 4
    <fbc>   DW_AT_type        : <0x8f8>
 <1><fc0>: Abbrev Number: 33 (DW_TAG_subprogram)
    <fc1>   DW_AT_external    : 1
    <fc1>   DW_AT_name        : (indirect string, offset: 0x616a7): can_parse_msg
    <fc5>   DW_AT_decl_file   : 12
    <fc6>   DW_AT_decl_line   : 13
    <fc7>   DW_AT_decl_column : 6
    <fc8>   DW_AT_prototyped  : 1
    <fc8>   DW_AT_declaration : 1
    <fc8>   DW_AT_sibling     : <0xfd7>
 <2><fcc>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fcd>   DW_AT_type        : <0xfd7>
 <2><fd1>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fd2>   DW_AT_type        : <0x67b>
 <2><fd6>: Abbrev Number: 0
 <1><fd7>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <fd8>   DW_AT_byte_size   : 4
    <fd9>   DW_AT_type        : <0xeac>
 <1><fdd>: Abbrev Number: 32 (DW_TAG_subprogram)
    <fde>   DW_AT_external    : 1
    <fde>   DW_AT_name        : (indirect string, offset: 0xe1baf): HAL_CAN_GetRxMessage
    <fe2>   DW_AT_decl_file   : 10
    <fe3>   DW_AT_decl_line   : 690
    <fe5>   DW_AT_decl_column : 19
    <fe6>   DW_AT_prototyped  : 1
    <fe6>   DW_AT_type        : <0xc4c>
    <fea>   DW_AT_declaration : 1
    <fea>   DW_AT_sibling     : <0x1003>
 <2><fee>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <fef>   DW_AT_type        : <0x1003>
 <2><ff3>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <ff4>   DW_AT_type        : <0x604>
 <2><ff8>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <ff9>   DW_AT_type        : <0xfd7>
 <2><ffd>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <ffe>   DW_AT_type        : <0x67b>
 <2><1002>: Abbrev Number: 0
 <1><1003>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1004>   DW_AT_byte_size   : 4
    <1005>   DW_AT_type        : <0xf00>
 <1><1009>: Abbrev Number: 32 (DW_TAG_subprogram)
    <100a>   DW_AT_external    : 1
    <100a>   DW_AT_name        : (indirect string, offset: 0xe1f76): HAL_CAN_GetRxFifoFillLevel
    <100e>   DW_AT_decl_file   : 10
    <100f>   DW_AT_decl_line   : 692
    <1011>   DW_AT_decl_column : 10
    <1012>   DW_AT_prototyped  : 1
    <1012>   DW_AT_type        : <0x604>
    <1016>   DW_AT_declaration : 1
    <1016>   DW_AT_sibling     : <0x1025>
 <2><101a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <101b>   DW_AT_type        : <0x1025>
 <2><101f>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1020>   DW_AT_type        : <0x604>
 <2><1024>: Abbrev Number: 0
 <1><1025>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1026>   DW_AT_byte_size   : 4
    <1027>   DW_AT_type        : <0xf0c>
 <1><102b>: Abbrev Number: 32 (DW_TAG_subprogram)
    <102c>   DW_AT_external    : 1
    <102c>   DW_AT_name        : (indirect string, offset: 0xe2164): osMessageQueueGet
    <1030>   DW_AT_decl_file   : 5
    <1031>   DW_AT_decl_line   : 697
    <1033>   DW_AT_decl_column : 12
    <1034>   DW_AT_prototyped  : 1
    <1034>   DW_AT_type        : <0x83d>
    <1038>   DW_AT_declaration : 1
    <1038>   DW_AT_sibling     : <0x1051>
 <2><103c>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <103d>   DW_AT_type        : <0x855>
 <2><1041>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1042>   DW_AT_type        : <0x679>
 <2><1046>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1047>   DW_AT_type        : <0x67b>
 <2><104b>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <104c>   DW_AT_type        : <0x604>
 <2><1050>: Abbrev Number: 0
 <1><1051>: Abbrev Number: 32 (DW_TAG_subprogram)
    <1052>   DW_AT_external    : 1
    <1052>   DW_AT_name        : (indirect string, offset: 0xe28ea): HAL_CAN_AddTxMessage
    <1056>   DW_AT_decl_file   : 10
    <1057>   DW_AT_decl_line   : 684
    <1059>   DW_AT_decl_column : 19
    <105a>   DW_AT_prototyped  : 1
    <105a>   DW_AT_type        : <0xc4c>
    <105e>   DW_AT_declaration : 1
    <105e>   DW_AT_sibling     : <0x1077>
 <2><1062>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1063>   DW_AT_type        : <0x1003>
 <2><1067>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1068>   DW_AT_type        : <0x1077>
 <2><106c>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <106d>   DW_AT_type        : <0xf11>
 <2><1071>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1072>   DW_AT_type        : <0x107d>
 <2><1076>: Abbrev Number: 0
 <1><1077>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1078>   DW_AT_byte_size   : 4
    <1079>   DW_AT_type        : <0xe42>
 <1><107d>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <107e>   DW_AT_byte_size   : 4
    <107f>   DW_AT_type        : <0x604>
 <1><1083>: Abbrev Number: 32 (DW_TAG_subprogram)
    <1084>   DW_AT_external    : 1
    <1084>   DW_AT_name        : (indirect string, offset: 0xe30a2): osDelay
    <1088>   DW_AT_decl_file   : 5
    <1089>   DW_AT_decl_line   : 459
    <108b>   DW_AT_decl_column : 12
    <108c>   DW_AT_prototyped  : 1
    <108c>   DW_AT_type        : <0x83d>
    <1090>   DW_AT_declaration : 1
    <1090>   DW_AT_sibling     : <0x109a>
 <2><1094>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <1095>   DW_AT_type        : <0x604>
 <2><1099>: Abbrev Number: 0
 <1><109a>: Abbrev Number: 32 (DW_TAG_subprogram)
    <109b>   DW_AT_external    : 1
    <109b>   DW_AT_name        : (indirect string, offset: 0xe208a): osMessageQueueNew
    <109f>   DW_AT_decl_file   : 5
    <10a0>   DW_AT_decl_line   : 676
    <10a2>   DW_AT_decl_column : 20
    <10a3>   DW_AT_prototyped  : 1
    <10a3>   DW_AT_type        : <0x855>
    <10a7>   DW_AT_declaration : 1
    <10a7>   DW_AT_sibling     : <0x10bb>
 <2><10ab>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <10ac>   DW_AT_type        : <0x604>
 <2><10b0>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <10b1>   DW_AT_type        : <0x604>
 <2><10b5>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <10b6>   DW_AT_type        : <0x10bb>
